liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
// biu_reg.h 6-18-2010
// gen_biu Ver 1.0 generated by weili.su 
#define xd_p_reg_pd_a	(*(volatile byte xdata *) 0xEC02)
#define    p_reg_pd_a	0xEC02 
#define	reg_pd_a_pos 0
#define	reg_pd_a_len 6
#define	reg_pd_a_lsb 0
#define xd_r_reg_lo_cal	(*(volatile byte xdata *) 0xEC02)
#define    r_reg_lo_cal	0xEC02 
#define	reg_lo_cal_pos 6
#define	reg_lo_cal_len 2
#define	reg_lo_cal_lsb 0
#define xd_p_reg_pd_b	(*(volatile byte xdata *) 0xEC03)
#define    p_reg_pd_b	0xEC03 
#define	reg_pd_b_pos 0
#define	reg_pd_b_len 6
#define	reg_pd_b_lsb 0
#define xd_r_reg_rc_cal_cnt_upd	(*(volatile byte xdata *) 0xEC03)
#define    r_reg_rc_cal_cnt_upd	0xEC03 
#define	reg_rc_cal_cnt_upd_pos 6
#define	reg_rc_cal_cnt_upd_len 1
#define	reg_rc_cal_cnt_upd_lsb 0
#define xd_p_reg_pd_c	(*(volatile byte xdata *) 0xEC04)
#define    p_reg_pd_c	0xEC04 
#define	reg_pd_c_pos 0
#define	reg_pd_c_len 6
#define	reg_pd_c_lsb 0
#define xd_r_reg_cal_count_a	(*(volatile byte xdata *) 0xEC04)
#define    r_reg_cal_count_a	0xEC04 
#define	reg_cal_count_a_pos 6
#define	reg_cal_count_a_len 2
#define	reg_cal_count_a_lsb 0
#define xd_p_reg_pd_d	(*(volatile byte xdata *) 0xEC05)
#define    p_reg_pd_d	0xEC05 
#define	reg_pd_d_pos 0
#define	reg_pd_d_len 6
#define	reg_pd_d_lsb 0
#define xd_r_reg_cal_count_b	(*(volatile byte xdata *) 0xEC05)
#define    r_reg_cal_count_b	0xEC05 
#define	reg_cal_count_b_pos 6
#define	reg_cal_count_b_len 2
#define	reg_cal_count_b_lsb 0
#define xd_p_reg_tst_a	(*(volatile byte xdata *) 0xEC06)
#define    p_reg_tst_a	0xEC06 
#define	reg_tst_a_pos 0
#define	reg_tst_a_len 6
#define	reg_tst_a_lsb 0
#define xd_r_reg_cal_count_c	(*(volatile byte xdata *) 0xEC06)
#define    r_reg_cal_count_c	0xEC06 
#define	reg_cal_count_c_pos 6
#define	reg_cal_count_c_len 2
#define	reg_cal_count_c_lsb 0
#define xd_p_reg_tst_b	(*(volatile byte xdata *) 0xEC07)
#define    p_reg_tst_b	0xEC07 
#define	reg_tst_b_pos 0
#define	reg_tst_b_len 2
#define	reg_tst_b_lsb 0
#define xd_r_reg_cal_count_d	(*(volatile byte xdata *) 0xEC07)
#define    r_reg_cal_count_d	0xEC07 
#define	reg_cal_count_d_pos 6
#define	reg_cal_count_d_len 2
#define	reg_cal_count_d_lsb 0
#define xd_p_reg_ctrl_a	(*(volatile byte xdata *) 0xEC08)
#define    p_reg_ctrl_a	0xEC08 
#define	reg_ctrl_a_pos 0
#define	reg_ctrl_a_len 6
#define	reg_ctrl_a_lsb 0
#define xd_r_reg_cal_count_e	(*(volatile byte xdata *) 0xEC08)
#define    r_reg_cal_count_e	0xEC08 
#define	reg_cal_count_e_pos 6
#define	reg_cal_count_e_len 2
#define	reg_cal_count_e_lsb 0
#define xd_p_reg_ctrl_b	(*(volatile byte xdata *) 0xEC09)
#define    p_reg_ctrl_b	0xEC09 
#define	reg_ctrl_b_pos 0
#define	reg_ctrl_b_len 2
#define	reg_ctrl_b_lsb 0
#define xd_r_reg_cal_count_f	(*(volatile byte xdata *) 0xEC09)
#define    r_reg_cal_count_f	0xEC09 
#define	reg_cal_count_f_pos 6
#define	reg_cal_count_f_len 2
#define	reg_cal_count_f_lsb 0
#define xd_p_reg_cal_freq_a	(*(volatile byte xdata *) 0xEC0A)
#define    p_reg_cal_freq_a	0xEC0A 
#define	reg_cal_freq_a_pos 0
#define	reg_cal_freq_a_len 6
#define	reg_cal_freq_a_lsb 0
#define xd_r_reg_rssi_a	(*(volatile byte xdata *) 0xEC0A)
#define    r_reg_rssi_a	0xEC0A 
#define	reg_rssi_a_pos 6
#define	reg_rssi_a_len 2
#define	reg_rssi_a_lsb 0
#define xd_p_reg_cal_freq_b	(*(volatile byte xdata *) 0xEC0B)
#define    p_reg_cal_freq_b	0xEC0B 
#define	reg_cal_freq_b_pos 0
#define	reg_cal_freq_b_len 6
#define	reg_cal_freq_b_lsb 0
#define xd_r_reg_rssi_b	(*(volatile byte xdata *) 0xEC0B)
#define    r_reg_rssi_b	0xEC0B 
#define	reg_rssi_b_pos 6
#define	reg_rssi_b_len 2
#define	reg_rssi_b_lsb 0
#define xd_p_reg_cal_freq_c	(*(volatile byte xdata *) 0xEC0C)
#define    p_reg_cal_freq_c	0xEC0C 
#define	reg_cal_freq_c_pos 0
#define	reg_cal_freq_c_len 4
#define	reg_cal_freq_c_lsb 0
#define xd_r_reg_rssi_c	(*(volatile byte xdata *) 0xEC0C)
#define    r_reg_rssi_c	0xEC0C 
#define	reg_rssi_c_pos 6
#define	reg_rssi_c_len 2
#define	reg_rssi_c_lsb 0
#define xd_p_reg_lo_freq_a	(*(volatile byte xdata *) 0xEC0D)
#define    p_reg_lo_freq_a	0xEC0D 
#define	reg_lo_freq_a_pos 0
#define	reg_lo_freq_a_len 6
#define	reg_lo_freq_a_lsb 0
#define xd_r_reg_rssi_d	(*(volatile byte xdata *) 0xEC0D)
#define    r_reg_rssi_d	0xEC0D 
#define	reg_rssi_d_pos 6
#define	reg_rssi_d_len 2
#define	reg_rssi_d_lsb 0
#define xd_p_reg_lo_freq_b	(*(volatile byte xdata *) 0xEC0E)
#define    p_reg_lo_freq_b	0xEC0E 
#define	reg_lo_freq_b_pos 0
#define	reg_lo_freq_b_len 6
#define	reg_lo_freq_b_lsb 0
#define xd_r_reg_rssi_e	(*(volatile byte xdata *) 0xEC0E)
#define    r_reg_rssi_e	0xEC0E 
#define	reg_rssi_e_pos 6
#define	reg_rssi_e_len 2
#define	reg_rssi_e_lsb 0
#define xd_p_reg_lo_freq_c	(*(volatile byte xdata *) 0xEC0F)
#define    p_reg_lo_freq_c	0xEC0F 
#define	reg_lo_freq_c_pos 0
#define	reg_lo_freq_c_len 4
#define	reg_lo_freq_c_lsb 0
#define xd_r_reg_cpll_cal	(*(volatile byte xdata *) 0xEC0F)
#define    r_reg_cpll_cal	0xEC0F 
#define	reg_cpll_cal_pos 6
#define	reg_cpll_cal_len 2
#define	reg_cpll_cal_lsb 0
#define xd_p_reg_lo_cap	(*(volatile byte xdata *) 0xEC10)
#define    p_reg_lo_cap	0xEC10 
#define	reg_lo_cap_pos 0
#define	reg_lo_cap_len 6
#define	reg_lo_cap_lsb 0
#define xd_p_reg_clk02_select	(*(volatile byte xdata *) 0xEC11)
#define    p_reg_clk02_select	0xEC11 
#define	reg_clk02_select_pos 0
#define	reg_clk02_select_len 3
#define	reg_clk02_select_lsb 0
#define xd_p_reg_clk01_select	(*(volatile byte xdata *) 0xEC11)
#define    p_reg_clk01_select	0xEC11 
#define	reg_clk01_select_pos 3
#define	reg_clk01_select_len 3
#define	reg_clk01_select_lsb 0
#define xd_p_reg_lna_g	(*(volatile byte xdata *) 0xEC12)
#define    p_reg_lna_g	0xEC12 
#define	reg_lna_g_pos 0
#define	reg_lna_g_len 3
#define	reg_lna_g_lsb 0
#define xd_p_reg_lna_cap	(*(volatile byte xdata *) 0xEC13)
#define    p_reg_lna_cap	0xEC13 
#define	reg_lna_cap_pos 0
#define	reg_lna_cap_len 6
#define	reg_lna_cap_lsb 0
#define xd_p_reg_lna_band	(*(volatile byte xdata *) 0xEC14)
#define    p_reg_lna_band	0xEC14 
#define	reg_lna_band_pos 0
#define	reg_lna_band_len 3
#define	reg_lna_band_lsb 0
#define xd_p_reg_pga	(*(volatile byte xdata *) 0xEC15)
#define    p_reg_pga	0xEC15 
#define	reg_pga_pos 0
#define	reg_pga_len 6
#define	reg_pga_lsb 0
#define xd_p_reg_pgc	(*(volatile byte xdata *) 0xEC17)
#define    p_reg_pgc	0xEC17 
#define	reg_pgc_pos 0
#define	reg_pgc_len 3
#define	reg_pgc_lsb 0
#define xd_p_reg_lpf_cap	(*(volatile byte xdata *) 0xEC18)
#define    p_reg_lpf_cap	0xEC18 
#define	reg_lpf_cap_pos 0
#define	reg_lpf_cap_len 5
#define	reg_lpf_cap_lsb 0
#define xd_p_reg_lpf_bw	(*(volatile byte xdata *) 0xEC19)
#define    p_reg_lpf_bw	0xEC19 
#define	reg_lpf_bw_pos 0
#define	reg_lpf_bw_len 3
#define	reg_lpf_bw_lsb 0
#define xd_p_reg_ofsi	(*(volatile byte xdata *) 0xEC1A)
#define    p_reg_ofsi	0xEC1A 
#define	reg_ofsi_pos 0
#define	reg_ofsi_len 6
#define	reg_ofsi_lsb 0
#define xd_p_reg_ofsq	(*(volatile byte xdata *) 0xEC1B)
#define    p_reg_ofsq	0xEC1B 
#define	reg_ofsq_pos 0
#define	reg_ofsq_len 6
#define	reg_ofsq_lsb 0
#define xd_p_reg_dcxo_a	(*(volatile byte xdata *) 0xEC1C)
#define    p_reg_dcxo_a	0xEC1C 
#define	reg_dcxo_a_pos 0
#define	reg_dcxo_a_len 6
#define	reg_dcxo_a_lsb 0
#define xd_p_reg_dcxo_b	(*(volatile byte xdata *) 0xEC1D)
#define    p_reg_dcxo_b	0xEC1D 
#define	reg_dcxo_b_pos 0
#define	reg_dcxo_b_len 4
#define	reg_dcxo_b_lsb 0
#define xd_p_reg_tddo	(*(volatile byte xdata *) 0xEC1E)
#define    p_reg_tddo	0xEC1E 
#define	reg_tddo_pos 0
#define	reg_tddo_len 6
#define	reg_tddo_lsb 0
#define xd_p_reg_strength_setting	(*(volatile byte xdata *) 0xEC1F)
#define    p_reg_strength_setting	0xEC1F 
#define	reg_strength_setting_pos 0
#define	reg_strength_setting_len 6
#define	reg_strength_setting_lsb 0
#define xd_p_reg_gi	(*(volatile byte xdata *) 0xEC22)
#define    p_reg_gi	0xEC22 
#define	reg_gi_pos 0
#define	reg_gi_len 2
#define	reg_gi_lsb 0
#define xd_p_reg_clk_del_sel	(*(volatile byte xdata *) 0xEC22)
#define    p_reg_clk_del_sel	0xEC22 
#define	reg_clk_del_sel_pos 2
#define	reg_clk_del_sel_len 2
#define	reg_clk_del_sel_lsb 0
#define xd_p_reg_p2s_ck_sel	(*(volatile byte xdata *) 0xEC22)
#define    p_reg_p2s_ck_sel	0xEC22 
#define	reg_p2s_ck_sel_pos 4
#define	reg_p2s_ck_sel_len 1
#define	reg_p2s_ck_sel_lsb 0
#define xd_p_reg_rssi_sel	(*(volatile byte xdata *) 0xEC22)
#define    p_reg_rssi_sel	0xEC22 
#define	reg_rssi_sel_pos 5
#define	reg_rssi_sel_len 1
#define	reg_rssi_sel_lsb 0
#define xd_p_reg_tst_sel	(*(volatile byte xdata *) 0xEC23)
#define    p_reg_tst_sel	0xEC23 
#define	reg_tst_sel_pos 4
#define	reg_tst_sel_len 2
#define	reg_tst_sel_lsb 0
#define xd_p_reg_ctrl_c	(*(volatile byte xdata *) 0xEC24)
#define    p_reg_ctrl_c	0xEC24 
#define	reg_ctrl_c_pos 0
#define	reg_ctrl_c_len 6
#define	reg_ctrl_c_lsb 0
#define xd_p_reg_ctrl_d	(*(volatile byte xdata *) 0xEC25)
#define    p_reg_ctrl_d	0xEC25 
#define	reg_ctrl_d_pos 0
#define	reg_ctrl_d_len 6
#define	reg_ctrl_d_lsb 0
#define xd_p_reg_ctrl_e	(*(volatile byte xdata *) 0xEC26)
#define    p_reg_ctrl_e	0xEC26 
#define	reg_ctrl_e_pos 0
#define	reg_ctrl_e_len 6
#define	reg_ctrl_e_lsb 0
#define xd_p_reg_ctrl_f	(*(volatile byte xdata *) 0xEC27)
#define    p_reg_ctrl_f	0xEC27 
#define	reg_ctrl_f_pos 0
#define	reg_ctrl_f_len 6
#define	reg_ctrl_f_lsb 0
#define xd_p_reg_lo_bias	(*(volatile byte xdata *) 0xEC28)
#define    p_reg_lo_bias	0xEC28 
#define	reg_lo_bias_pos 0
#define	reg_lo_bias_len 3
#define	reg_lo_bias_lsb 0
#define xd_p_reg_ext_lna_en	(*(volatile byte xdata *) 0xEC29)
#define    p_reg_ext_lna_en	0xEC29 
#define	reg_ext_lna_en_pos 0
#define	reg_ext_lna_en_len 1
#define	reg_ext_lna_en_lsb 0
#define xd_p_reg_pga_bak	(*(volatile byte xdata *) 0xEC2A)
#define    p_reg_pga_bak	0xEC2A 
#define	reg_pga_bak_pos 0
#define	reg_pga_bak_len 3
#define	reg_pga_bak_lsb 0
#define xd_p_reg_cpll_cap	(*(volatile byte xdata *) 0xEC2B)
#define    p_reg_cpll_cap	0xEC2B 
#define	reg_cpll_cap_pos 0
#define	reg_cpll_cap_len 6
#define	reg_cpll_cap_lsb 0
#define xd_p_reg_p_if_en	(*(volatile byte xdata *) 0xEC40)
#define    p_reg_p_if_en	0xEC40 
#define	reg_p_if_en_pos 0
#define	reg_p_if_en_len 2
#define	reg_p_if_en_lsb 0
#define xd_p_reg_t_direct_en	(*(volatile byte xdata *) 0xEC41)
#define    p_reg_t_direct_en	0xEC41 
#define	reg_t_direct_en_pos 0
#define	reg_t_direct_en_len 1
#define	reg_t_direct_en_lsb 0
#define xd_r_reg_t_lo_cal	(*(volatile byte xdata *) 0xEC42)
#define    r_reg_t_lo_cal	0xEC42 
#define	reg_t_lo_cal_pos 0
#define	reg_t_lo_cal_len 2
#define	reg_t_lo_cal_lsb 0
#define xd_r_reg_t_cal_rdy	(*(volatile byte xdata *) 0xEC43)
#define    r_reg_t_cal_rdy	0xEC43 
#define	reg_t_cal_rdy_pos 0
#define	reg_t_cal_rdy_len 1
#define	reg_t_cal_rdy_lsb 0
#define xd_r_reg_t_cal_count_7_0	(*(volatile byte xdata *) 0xEC44)
#define    r_reg_t_cal_count_7_0	0xEC44 
#define	reg_t_cal_count_7_0_pos 0
#define	reg_t_cal_count_7_0_len 8
#define	reg_t_cal_count_7_0_lsb 0
#define xd_r_reg_t_cal_count_11_8	(*(volatile byte xdata *) 0xEC45)
#define    r_reg_t_cal_count_11_8	0xEC45 
#define	reg_t_cal_count_11_8_pos 0
#define	reg_t_cal_count_11_8_len 4
#define	reg_t_cal_count_11_8_lsb 8
#define xd_r_reg_t_rssi_7_0	(*(volatile byte xdata *) 0xEC46)
#define    r_reg_t_rssi_7_0	0xEC46 
#define	reg_t_rssi_7_0_pos 0
#define	reg_t_rssi_7_0_len 8
#define	reg_t_rssi_7_0_lsb 0
#define xd_r_reg_t_rssi_9_8	(*(volatile byte xdata *) 0xEC47)
#define    r_reg_t_rssi_9_8	0xEC47 
#define	reg_t_rssi_9_8_pos 0
#define	reg_t_rssi_9_8_len 2
#define	reg_t_rssi_9_8_lsb 8
#define xd_p_reg_t_pd_7_0	(*(volatile byte xdata *) 0xEC48)
#define    p_reg_t_pd_7_0	0xEC48 
#define	reg_t_pd_7_0_pos 0
#define	reg_t_pd_7_0_len 8
#define	reg_t_pd_7_0_lsb 0
#define xd_p_reg_t_pd_15_8	(*(volatile byte xdata *) 0xEC49)
#define    p_reg_t_pd_15_8	0xEC49 
#define	reg_t_pd_15_8_pos 0
#define	reg_t_pd_15_8_len 8
#define	reg_t_pd_15_8_lsb 8
#define xd_p_reg_t_pd_23_16	(*(volatile byte xdata *) 0xEC4A)
#define    p_reg_t_pd_23_16	0xEC4A 
#define	reg_t_pd_23_16_pos 0
#define	reg_t_pd_23_16_len 8
#define	reg_t_pd_23_16_lsb 16
#define xd_p_reg_t_tst	(*(volatile byte xdata *) 0xEC4B)
#define    p_reg_t_tst	0xEC4B 
#define	reg_t_tst_pos 0
#define	reg_t_tst_len 8
#define	reg_t_tst_lsb 0
#define xd_p_reg_t_ctrl	(*(volatile byte xdata *) 0xEC4C)
#define    p_reg_t_ctrl	0xEC4C 
#define	reg_t_ctrl_pos 0
#define	reg_t_ctrl_len 8
#define	reg_t_ctrl_lsb 0
#define xd_p_reg_t_cal_freq_7_0	(*(volatile byte xdata *) 0xEC4D)
#define    p_reg_t_cal_freq_7_0	0xEC4D 
#define	reg_t_cal_freq_7_0_pos 0
#define	reg_t_cal_freq_7_0_len 8
#define	reg_t_cal_freq_7_0_lsb 0
#define xd_p_reg_t_cal_freq_15_8	(*(volatile byte xdata *) 0xEC4E)
#define    p_reg_t_cal_freq_15_8	0xEC4E 
#define	reg_t_cal_freq_15_8_pos 0
#define	reg_t_cal_freq_15_8_len 8
#define	reg_t_cal_freq_15_8_lsb 8
#define xd_p_reg_t_lo_freq_7_0	(*(volatile byte xdata *) 0xEC4F)
#define    p_reg_t_lo_freq_7_0	0xEC4F 
#define	reg_t_lo_freq_7_0_pos 0
#define	reg_t_lo_freq_7_0_len 8
#define	reg_t_lo_freq_7_0_lsb 0
#define xd_p_reg_t_lo_freq_15_8	(*(volatile byte xdata *) 0xEC50)
#define    p_reg_t_lo_freq_15_8	0xEC50 
#define	reg_t_lo_freq_15_8_pos 0
#define	reg_t_lo_freq_15_8_len 8
#define	reg_t_lo_freq_15_8_lsb 8
#define xd_p_reg_t_lo_cap	(*(volatile byte xdata *) 0xEC51)
#define    p_reg_t_lo_cap	0xEC51 
#define	reg_t_lo_cap_pos 0
#define	reg_t_lo_cap_len 6
#define	reg_t_lo_cap_lsb 0
#define xd_p_reg_t_clko_sel	(*(volatile byte xdata *) 0xEC52)
#define    p_reg_t_clko_sel	0xEC52 
#define	reg_t_clko_sel_pos 0
#define	reg_t_clko_sel_len 6
#define	reg_t_clko_sel_lsb 0
#define xd_p_reg_t_lna_cap	(*(volatile byte xdata *) 0xEC53)
#define    p_reg_t_lna_cap	0xEC53 
#define	reg_t_lna_cap_pos 0
#define	reg_t_lna_cap_len 6
#define	reg_t_lna_cap_lsb 0
#define xd_p_reg_t_lna_band	(*(volatile byte xdata *) 0xEC54)
#define    p_reg_t_lna_band	0xEC54 
#define	reg_t_lna_band_pos 0
#define	reg_t_lna_band_len 3
#define	reg_t_lna_band_lsb 0
#define xd_p_reg_t_lpf_cap	(*(volatile byte xdata *) 0xEC55)
#define    p_reg_t_lpf_cap	0xEC55 
#define	reg_t_lpf_cap_pos 0
#define	reg_t_lpf_cap_len 5
#define	reg_t_lpf_cap_lsb 0
#define xd_p_reg_t_lpf_bw	(*(volatile byte xdata *) 0xEC56)
#define    p_reg_t_lpf_bw	0xEC56 
#define	reg_t_lpf_bw_pos 0
#define	reg_t_lpf_bw_len 3
#define	reg_t_lpf_bw_lsb 0
#define xd_p_reg_t_dcxo_7_0	(*(volatile byte xdata *) 0xEC57)
#define    p_reg_t_dcxo_7_0	0xEC57 
#define	reg_t_dcxo_7_0_pos 0
#define	reg_t_dcxo_7_0_len 8
#define	reg_t_dcxo_7_0_lsb 0
#define xd_p_reg_t_dcxo_9_8	(*(volatile byte xdata *) 0xEC58)
#define    p_reg_t_dcxo_9_8	0xEC58 
#define	reg_t_dcxo_9_8_pos 0
#define	reg_t_dcxo_9_8_len 2
#define	reg_t_dcxo_9_8_lsb 8
#define xd_p_reg_t_t_ddo_sel_7_0	(*(volatile byte xdata *) 0xEC59)
#define    p_reg_t_t_ddo_sel_7_0	0xEC59 
#define	reg_t_t_ddo_sel_7_0_pos 0
#define	reg_t_t_ddo_sel_7_0_len 8
#define	reg_t_t_ddo_sel_7_0_lsb 0
#define xd_p_reg_t_t_ddo_sel_11_8	(*(volatile byte xdata *) 0xEC5A)
#define    p_reg_t_t_ddo_sel_11_8	0xEC5A 
#define	reg_t_t_ddo_sel_11_8_pos 0
#define	reg_t_t_ddo_sel_11_8_len 4
#define	reg_t_t_ddo_sel_11_8_lsb 8
#define xd_p_reg_t_rssi_avg_sel	(*(volatile byte xdata *) 0xEC5B)
#define    p_reg_t_rssi_avg_sel	0xEC5B 
#define	reg_t_rssi_avg_sel_pos 0
#define	reg_t_rssi_avg_sel_len 2
#define	reg_t_rssi_avg_sel_lsb 0
#define xd_p_reg_t_lo_protect	(*(volatile byte xdata *) 0xEC5C)
#define    p_reg_t_lo_protect	0xEC5C 
#define	reg_t_lo_protect_pos 0
#define	reg_t_lo_protect_len 1
#define	reg_t_lo_protect_lsb 0
#define xd_p_reg_t_gi	(*(volatile byte xdata *) 0xEC5D)
#define    p_reg_t_gi	0xEC5D 
#define	reg_t_gi_pos 0
#define	reg_t_gi_len 2
#define	reg_t_gi_lsb 0
#define xd_p_reg_t_clk_del_sel	(*(volatile byte xdata *) 0xEC5E)
#define    p_reg_t_clk_del_sel	0xEC5E 
#define	reg_t_clk_del_sel_pos 0
#define	reg_t_clk_del_sel_len 2
#define	reg_t_clk_del_sel_lsb 0
#define xd_p_reg_t_p2s_ck_sel	(*(volatile byte xdata *) 0xEC5F)
#define    p_reg_t_p2s_ck_sel	0xEC5F 
#define	reg_t_p2s_ck_sel_pos 0
#define	reg_t_p2s_ck_sel_len 1
#define	reg_t_p2s_ck_sel_lsb 0
#define xd_p_reg_t_rssi_sel	(*(volatile byte xdata *) 0xEC60)
#define    p_reg_t_rssi_sel	0xEC60 
#define	reg_t_rssi_sel_pos 0
#define	reg_t_rssi_sel_len 1
#define	reg_t_rssi_sel_lsb 0
#define xd_p_reg_t_tst_sel	(*(volatile byte xdata *) 0xEC61)
#define    p_reg_t_tst_sel	0xEC61 
#define	reg_t_tst_sel_pos 0
#define	reg_t_tst_sel_len 2
#define	reg_t_tst_sel_lsb 0
#define xd_p_reg_t_ctrl_new_7_0	(*(volatile byte xdata *) 0xEC62)
#define    p_reg_t_ctrl_new_7_0	0xEC62 
#define	reg_t_ctrl_new_7_0_pos 0
#define	reg_t_ctrl_new_7_0_len 8
#define	reg_t_ctrl_new_7_0_lsb 0
#define xd_p_reg_t_ctrl_new_15_8	(*(volatile byte xdata *) 0xEC63)
#define    p_reg_t_ctrl_new_15_8	0xEC63 
#define	reg_t_ctrl_new_15_8_pos 0
#define	reg_t_ctrl_new_15_8_len 8
#define	reg_t_ctrl_new_15_8_lsb 8
#define xd_p_reg_t_ctrl_new_23_16	(*(volatile byte xdata *) 0xEC64)
#define    p_reg_t_ctrl_new_23_16	0xEC64 
#define	reg_t_ctrl_new_23_16_pos 0
#define	reg_t_ctrl_new_23_16_len 8
#define	reg_t_ctrl_new_23_16_lsb 16
#define xd_p_reg_t_lo_bias	(*(volatile byte xdata *) 0xEC65)
#define    p_reg_t_lo_bias	0xEC65 
#define	reg_t_lo_bias_pos 0
#define	reg_t_lo_bias_len 3
#define	reg_t_lo_bias_lsb 0
#define xd_r_reg_t_ext_lna_en	(*(volatile byte xdata *) 0xEC66)
#define    r_reg_t_ext_lna_en	0xEC66 
#define	reg_t_ext_lna_en_pos 0
#define	reg_t_ext_lna_en_len 1
#define	reg_t_ext_lna_en_lsb 0
#define xd_r_reg_t_pga_bak	(*(volatile byte xdata *) 0xEC67)
#define    r_reg_t_pga_bak	0xEC67 
#define	reg_t_pga_bak_pos 0
#define	reg_t_pga_bak_len 3
#define	reg_t_pga_bak_lsb 0
#define xd_r_reg_t_cpll_cal	(*(volatile byte xdata *) 0xEC68)
#define    r_reg_t_cpll_cal	0xEC68 
#define	reg_t_cpll_cal_pos 0
#define	reg_t_cpll_cal_len 2
#define	reg_t_cpll_cal_lsb 0
#define xd_p_reg_t_cpll_cap	(*(volatile byte xdata *) 0xEC69)
#define    p_reg_t_cpll_cap	0xEC69 
#define	reg_t_cpll_cap_pos 0
#define	reg_t_cpll_cap_len 6
#define	reg_t_cpll_cap_lsb 0
#define xd_p_reg_p_tsm_init_vld	(*(volatile byte xdata *) 0xEC80)
#define    p_reg_p_tsm_init_vld	0xEC80 
#define	reg_p_tsm_init_vld_pos 0
#define	reg_p_tsm_init_vld_len 1
#define	reg_p_tsm_init_vld_lsb 0
#define xd_p_reg_p_tsm_init_rst	(*(volatile byte xdata *) 0xEC81)
#define    p_reg_p_tsm_init_rst	0xEC81 
#define	reg_p_tsm_init_rst_pos 0
#define	reg_p_tsm_init_rst_len 1
#define	reg_p_tsm_init_rst_lsb 0
#define xd_p_reg_p_tsm_init_mode	(*(volatile byte xdata *) 0xEC82)
#define    p_reg_p_tsm_init_mode	0xEC82 
#define	reg_p_tsm_init_mode_pos 0
#define	reg_p_tsm_init_mode_len 1
#define	reg_p_tsm_init_mode_lsb 0
#define xd_p_reg_p_tsm_init_pd_7_0	(*(volatile byte xdata *) 0xEC83)
#define    p_reg_p_tsm_init_pd_7_0	0xEC83 
#define	reg_p_tsm_init_pd_7_0_pos 0
#define	reg_p_tsm_init_pd_7_0_len 8
#define	reg_p_tsm_init_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_init_pd_15_8	(*(volatile byte xdata *) 0xEC84)
#define    p_reg_p_tsm_init_pd_15_8	0xEC84 
#define	reg_p_tsm_init_pd_15_8_pos 0
#define	reg_p_tsm_init_pd_15_8_len 8
#define	reg_p_tsm_init_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_init_pd_23_16	(*(volatile byte xdata *) 0xEC85)
#define    p_reg_p_tsm_init_pd_23_16	0xEC85 
#define	reg_p_tsm_init_pd_23_16_pos 0
#define	reg_p_tsm_init_pd_23_16_len 8
#define	reg_p_tsm_init_pd_23_16_lsb 16
#define xd_p_reg_p_tsm_init_clock_mode	(*(volatile byte xdata *) 0xEC86)
#define    p_reg_p_tsm_init_clock_mode	0xEC86 
#define	reg_p_tsm_init_clock_mode_pos 0
#define	reg_p_tsm_init_clock_mode_len 2
#define	reg_p_tsm_init_clock_mode_lsb 0
#define xd_r_reg_r_tsm_init_fail	(*(volatile byte xdata *) 0xEC87)
#define    r_reg_r_tsm_init_fail	0xEC87 
#define	reg_r_tsm_init_fail_pos 0
#define	reg_r_tsm_init_fail_len 1
#define	reg_r_tsm_init_fail_lsb 0
#define xd_p_reg_p_tsm_sf_vld	(*(volatile byte xdata *) 0xEC88)
#define    p_reg_p_tsm_sf_vld	0xEC88 
#define	reg_p_tsm_sf_vld_pos 0
#define	reg_p_tsm_sf_vld_len 1
#define	reg_p_tsm_sf_vld_lsb 0
#define xd_p_reg_p_tsm_sf_rst	(*(volatile byte xdata *) 0xEC89)
#define    p_reg_p_tsm_sf_rst	0xEC89 
#define	reg_p_tsm_sf_rst_pos 0
#define	reg_p_tsm_sf_rst_len 1
#define	reg_p_tsm_sf_rst_lsb 0
#define xd_p_reg_p_tsm_sf_mode	(*(volatile byte xdata *) 0xEC8A)
#define    p_reg_p_tsm_sf_mode	0xEC8A 
#define	reg_p_tsm_sf_mode_pos 0
#define	reg_p_tsm_sf_mode_len 1
#define	reg_p_tsm_sf_mode_lsb 0
#define xd_p_reg_p_tsm_sf_pll_sel	(*(volatile byte xdata *) 0xEC8B)
#define    p_reg_p_tsm_sf_pll_sel	0xEC8B 
#define	reg_p_tsm_sf_pll_sel_pos 0
#define	reg_p_tsm_sf_pll_sel_len 1
#define	reg_p_tsm_sf_pll_sel_lsb 0
#define xd_p_reg_p_tsm_sf_pll_del	(*(volatile byte xdata *) 0xEC8C)
#define    p_reg_p_tsm_sf_pll_del	0xEC8C 
#define	reg_p_tsm_sf_pll_del_pos 0
#define	reg_p_tsm_sf_pll_del_len 8
#define	reg_p_tsm_sf_pll_del_lsb 0
#define xd_p_reg_p_tsm_sf_dcc_en	(*(volatile byte xdata *) 0xEC8D)
#define    p_reg_p_tsm_sf_dcc_en	0xEC8D 
#define	reg_p_tsm_sf_dcc_en_pos 0
#define	reg_p_tsm_sf_dcc_en_len 1
#define	reg_p_tsm_sf_dcc_en_lsb 0
#define xd_p_reg_p_tsm_sf_iqik_en	(*(volatile byte xdata *) 0xEC8E)
#define    p_reg_p_tsm_sf_iqik_en	0xEC8E 
#define	reg_p_tsm_sf_iqik_en_pos 0
#define	reg_p_tsm_sf_iqik_en_len 1
#define	reg_p_tsm_sf_iqik_en_lsb 0
#define xd_r_reg_r_tsm_sf_fail	(*(volatile byte xdata *) 0xEC8F)
#define    r_reg_r_tsm_sf_fail	0xEC8F 
#define	reg_r_tsm_sf_fail_pos 0
#define	reg_r_tsm_sf_fail_len 1
#define	reg_r_tsm_sf_fail_lsb 0
#define xd_p_reg_p_tsm_default_pd_7_0	(*(volatile byte xdata *) 0xEC90)
#define    p_reg_p_tsm_default_pd_7_0	0xEC90 
#define	reg_p_tsm_default_pd_7_0_pos 0
#define	reg_p_tsm_default_pd_7_0_len 8
#define	reg_p_tsm_default_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_default_pd_15_8	(*(volatile byte xdata *) 0xEC91)
#define    p_reg_p_tsm_default_pd_15_8	0xEC91 
#define	reg_p_tsm_default_pd_15_8_pos 0
#define	reg_p_tsm_default_pd_15_8_len 8
#define	reg_p_tsm_default_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_default_pd_23_16	(*(volatile byte xdata *) 0xEC92)
#define    p_reg_p_tsm_default_pd_23_16	0xEC92 
#define	reg_p_tsm_default_pd_23_16_pos 0
#define	reg_p_tsm_default_pd_23_16_len 8
#define	reg_p_tsm_default_pd_23_16_lsb 16
#define xd_p_reg_p_tsm_dccc_pd_7_0	(*(volatile byte xdata *) 0xEC93)
#define    p_reg_p_tsm_dccc_pd_7_0	0xEC93 
#define	reg_p_tsm_dccc_pd_7_0_pos 0
#define	reg_p_tsm_dccc_pd_7_0_len 8
#define	reg_p_tsm_dccc_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_dccc_pd_15_8	(*(volatile byte xdata *) 0xEC94)
#define    p_reg_p_tsm_dccc_pd_15_8	0xEC94 
#define	reg_p_tsm_dccc_pd_15_8_pos 0
#define	reg_p_tsm_dccc_pd_15_8_len 8
#define	reg_p_tsm_dccc_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_dccc_pd_23_16	(*(volatile byte xdata *) 0xEC95)
#define    p_reg_p_tsm_dccc_pd_23_16	0xEC95 
#define	reg_p_tsm_dccc_pd_23_16_pos 0
#define	reg_p_tsm_dccc_pd_23_16_len 8
#define	reg_p_tsm_dccc_pd_23_16_lsb 16
#define xd_p_reg_p_tsm_iqikc_pd_7_0	(*(volatile byte xdata *) 0xEC96)
#define    p_reg_p_tsm_iqikc_pd_7_0	0xEC96 
#define	reg_p_tsm_iqikc_pd_7_0_pos 0
#define	reg_p_tsm_iqikc_pd_7_0_len 8
#define	reg_p_tsm_iqikc_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_iqikc_pd_15_8	(*(volatile byte xdata *) 0xEC97)
#define    p_reg_p_tsm_iqikc_pd_15_8	0xEC97 
#define	reg_p_tsm_iqikc_pd_15_8_pos 0
#define	reg_p_tsm_iqikc_pd_15_8_len 8
#define	reg_p_tsm_iqikc_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_iqikc_pd_23_16	(*(volatile byte xdata *) 0xEC98)
#define    p_reg_p_tsm_iqikc_pd_23_16	0xEC98 
#define	reg_p_tsm_iqikc_pd_23_16_pos 0
#define	reg_p_tsm_iqikc_pd_23_16_len 8
#define	reg_p_tsm_iqikc_pd_23_16_lsb 16
#define xd_p_reg_p_tsm_lnac_pd_7_0	(*(volatile byte xdata *) 0xEC99)
#define    p_reg_p_tsm_lnac_pd_7_0	0xEC99 
#define	reg_p_tsm_lnac_pd_7_0_pos 0
#define	reg_p_tsm_lnac_pd_7_0_len 8
#define	reg_p_tsm_lnac_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_lnac_pd_15_8	(*(volatile byte xdata *) 0xEC9A)
#define    p_reg_p_tsm_lnac_pd_15_8	0xEC9A 
#define	reg_p_tsm_lnac_pd_15_8_pos 0
#define	reg_p_tsm_lnac_pd_15_8_len 8
#define	reg_p_tsm_lnac_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_lnac_pd_23_16	(*(volatile byte xdata *) 0xEC9B)
#define    p_reg_p_tsm_lnac_pd_23_16	0xEC9B 
#define	reg_p_tsm_lnac_pd_23_16_pos 0
#define	reg_p_tsm_lnac_pd_23_16_len 8
#define	reg_p_tsm_lnac_pd_23_16_lsb 16
