liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_p_reg_p_tsm_rcc_pd_7_0	(*(volatile byte xdata *) 0xEC9C)
#define    p_reg_p_tsm_rcc_pd_7_0	0xEC9C 
#define	reg_p_tsm_rcc_pd_7_0_pos 0
#define	reg_p_tsm_rcc_pd_7_0_len 8
#define	reg_p_tsm_rcc_pd_7_0_lsb 0
#define xd_p_reg_p_tsm_rcc_pd_15_8	(*(volatile byte xdata *) 0xEC9D)
#define    p_reg_p_tsm_rcc_pd_15_8	0xEC9D 
#define	reg_p_tsm_rcc_pd_15_8_pos 0
#define	reg_p_tsm_rcc_pd_15_8_len 8
#define	reg_p_tsm_rcc_pd_15_8_lsb 8
#define xd_p_reg_p_tsm_rcc_pd_23_16	(*(volatile byte xdata *) 0xEC9E)
#define    p_reg_p_tsm_rcc_pd_23_16	0xEC9E 
#define	reg_p_tsm_rcc_pd_23_16_pos 0
#define	reg_p_tsm_rcc_pd_23_16_len 8
#define	reg_p_tsm_rcc_pd_23_16_lsb 16
#define xd_p_reg_p_tsm_default_ctrl	(*(volatile byte xdata *) 0xEC9F)
#define    p_reg_p_tsm_default_ctrl	0xEC9F 
#define	reg_p_tsm_default_ctrl_pos 0
#define	reg_p_tsm_default_ctrl_len 2
#define	reg_p_tsm_default_ctrl_lsb 0
#define xd_p_reg_p_tsm_dccc_ctrl	(*(volatile byte xdata *) 0xECA0)
#define    p_reg_p_tsm_dccc_ctrl	0xECA0 
#define	reg_p_tsm_dccc_ctrl_pos 0
#define	reg_p_tsm_dccc_ctrl_len 2
#define	reg_p_tsm_dccc_ctrl_lsb 0
#define xd_p_reg_p_tsm_iqikc_ctrl	(*(volatile byte xdata *) 0xECA1)
#define    p_reg_p_tsm_iqikc_ctrl	0xECA1 
#define	reg_p_tsm_iqikc_ctrl_pos 0
#define	reg_p_tsm_iqikc_ctrl_len 2
#define	reg_p_tsm_iqikc_ctrl_lsb 0
#define xd_p_reg_p_tsm_lnac_ctrl	(*(volatile byte xdata *) 0xECA2)
#define    p_reg_p_tsm_lnac_ctrl	0xECA2 
#define	reg_p_tsm_lnac_ctrl_pos 0
#define	reg_p_tsm_lnac_ctrl_len 2
#define	reg_p_tsm_lnac_ctrl_lsb 0
#define xd_p_reg_p_tsm_rcc_ctrl	(*(volatile byte xdata *) 0xECA3)
#define    p_reg_p_tsm_rcc_ctrl	0xECA3 
#define	reg_p_tsm_rcc_ctrl_pos 0
#define	reg_p_tsm_rcc_ctrl_len 2
#define	reg_p_tsm_rcc_ctrl_lsb 0
#define xd_p_reg_p_tsm_group1_clken	(*(volatile byte xdata *) 0xECA4)
#define    p_reg_p_tsm_group1_clken	0xECA4 
#define	reg_p_tsm_group1_clken_pos 0
#define	reg_p_tsm_group1_clken_len 1
#define	reg_p_tsm_group1_clken_lsb 0
#define xd_p_reg_p_tsm_group2_clken	(*(volatile byte xdata *) 0xECA5)
#define    p_reg_p_tsm_group2_clken	0xECA5 
#define	reg_p_tsm_group2_clken_pos 0
#define	reg_p_tsm_group2_clken_len 1
#define	reg_p_tsm_group2_clken_lsb 0
#define xd_p_reg_p_tsm_group3_clken	(*(volatile byte xdata *) 0xECA6)
#define    p_reg_p_tsm_group3_clken	0xECA6 
#define	reg_p_tsm_group3_clken_pos 0
#define	reg_p_tsm_group3_clken_len 1
#define	reg_p_tsm_group3_clken_lsb 0
#define xd_p_reg_p_tsm_trigger_set_sel	(*(volatile byte xdata *) 0xECA7)
#define    p_reg_p_tsm_trigger_set_sel	0xECA7 
#define	reg_p_tsm_trigger_set_sel_pos 0
#define	reg_p_tsm_trigger_set_sel_len 4
#define	reg_p_tsm_trigger_set_sel_lsb 0
#define xd_p_reg_p_tsm_adc_latch_sel	(*(volatile byte xdata *) 0xECA8)
#define    p_reg_p_tsm_adc_latch_sel	0xECA8 
#define	reg_p_tsm_adc_latch_sel_pos 0
#define	reg_p_tsm_adc_latch_sel_len 4
#define	reg_p_tsm_adc_latch_sel_lsb 0
#define xd_p_reg_p_aagci_rf_agc_mode	(*(volatile byte xdata *) 0xECC0)
#define    p_reg_p_aagci_rf_agc_mode	0xECC0 
#define	reg_p_aagci_rf_agc_mode_pos 0
#define	reg_p_aagci_rf_agc_mode_len 1
#define	reg_p_aagci_rf_agc_mode_lsb 0
#define xd_p_reg_p_aagci_bb_agc_mode	(*(volatile byte xdata *) 0xECC1)
#define    p_reg_p_aagci_bb_agc_mode	0xECC1 
#define	reg_p_aagci_bb_agc_mode_pos 0
#define	reg_p_aagci_bb_agc_mode_len 1
#define	reg_p_aagci_bb_agc_mode_lsb 0
#define xd_p_reg_p_aagci_ext_lna_mode	(*(volatile byte xdata *) 0xECC2)
#define    p_reg_p_aagci_ext_lna_mode	0xECC2 
#define	reg_p_aagci_ext_lna_mode_pos 0
#define	reg_p_aagci_ext_lna_mode_len 1
#define	reg_p_aagci_ext_lna_mode_lsb 0
#define xd_p_reg_p_aagci_pga_bak_mode	(*(volatile byte xdata *) 0xECC3)
#define    p_reg_p_aagci_pga_bak_mode	0xECC3 
#define	reg_p_aagci_pga_bak_mode_pos 0
#define	reg_p_aagci_pga_bak_mode_len 1
#define	reg_p_aagci_pga_bak_mode_lsb 0
#define xd_p_reg_p_aagci_rf_lna_gain	(*(volatile byte xdata *) 0xECC4)
#define    p_reg_p_aagci_rf_lna_gain	0xECC4 
#define	reg_p_aagci_rf_lna_gain_pos 0
#define	reg_p_aagci_rf_lna_gain_len 3
#define	reg_p_aagci_rf_lna_gain_lsb 0
#define xd_p_reg_p_aagci_rf_pgc_gain	(*(volatile byte xdata *) 0xECC5)
#define    p_reg_p_aagci_rf_pgc_gain	0xECC5 
#define	reg_p_aagci_rf_pgc_gain_pos 0
#define	reg_p_aagci_rf_pgc_gain_len 3
#define	reg_p_aagci_rf_pgc_gain_lsb 0
#define xd_p_reg_p_aagci_bb_pga1_gain	(*(volatile byte xdata *) 0xECC6)
#define    p_reg_p_aagci_bb_pga1_gain	0xECC6 
#define	reg_p_aagci_bb_pga1_gain_pos 0
#define	reg_p_aagci_bb_pga1_gain_len 2
#define	reg_p_aagci_bb_pga1_gain_lsb 0
#define xd_p_reg_p_aagci_bb_pga2_gain	(*(volatile byte xdata *) 0xECC7)
#define    p_reg_p_aagci_bb_pga2_gain	0xECC7 
#define	reg_p_aagci_bb_pga2_gain_pos 0
#define	reg_p_aagci_bb_pga2_gain_len 4
#define	reg_p_aagci_bb_pga2_gain_lsb 0
#define xd_p_reg_p_aagci_ext_lna_gain	(*(volatile byte xdata *) 0xECC8)
#define    p_reg_p_aagci_ext_lna_gain	0xECC8 
#define	reg_p_aagci_ext_lna_gain_pos 0
#define	reg_p_aagci_ext_lna_gain_len 1
#define	reg_p_aagci_ext_lna_gain_lsb 0
#define xd_p_reg_p_aagci_pga_bak_gain	(*(volatile byte xdata *) 0xECC9)
#define    p_reg_p_aagci_pga_bak_gain	0xECC9 
#define	reg_p_aagci_pga_bak_gain_pos 0
#define	reg_p_aagci_pga_bak_gain_len 3
#define	reg_p_aagci_pga_bak_gain_lsb 0
#define xd_r_reg_r_aagci_rf_lna_gain	(*(volatile byte xdata *) 0xECCA)
#define    r_reg_r_aagci_rf_lna_gain	0xECCA 
#define	reg_r_aagci_rf_lna_gain_pos 0
#define	reg_r_aagci_rf_lna_gain_len 3
#define	reg_r_aagci_rf_lna_gain_lsb 0
#define xd_r_reg_r_aagci_rf_pgc_gain	(*(volatile byte xdata *) 0xECCB)
#define    r_reg_r_aagci_rf_pgc_gain	0xECCB 
#define	reg_r_aagci_rf_pgc_gain_pos 0
#define	reg_r_aagci_rf_pgc_gain_len 3
#define	reg_r_aagci_rf_pgc_gain_lsb 0
#define xd_r_reg_r_aagci_bb_pga1_gain	(*(volatile byte xdata *) 0xECCC)
#define    r_reg_r_aagci_bb_pga1_gain	0xECCC 
#define	reg_r_aagci_bb_pga1_gain_pos 0
#define	reg_r_aagci_bb_pga1_gain_len 2
#define	reg_r_aagci_bb_pga1_gain_lsb 0
#define xd_r_reg_r_aagci_bb_pga2_gain	(*(volatile byte xdata *) 0xECCD)
#define    r_reg_r_aagci_bb_pga2_gain	0xECCD 
#define	reg_r_aagci_bb_pga2_gain_pos 0
#define	reg_r_aagci_bb_pga2_gain_len 4
#define	reg_r_aagci_bb_pga2_gain_lsb 0
#define xd_r_reg_r_aagci_ext_lna_gain	(*(volatile byte xdata *) 0xECCE)
#define    r_reg_r_aagci_ext_lna_gain	0xECCE 
#define	reg_r_aagci_ext_lna_gain_pos 0
#define	reg_r_aagci_ext_lna_gain_len 1
#define	reg_r_aagci_ext_lna_gain_lsb 0
#define xd_r_reg_r_aagci_pga_bak_gain	(*(volatile byte xdata *) 0xECCF)
#define    r_reg_r_aagci_pga_bak_gain	0xECCF 
#define	reg_r_aagci_pga_bak_gain_pos 0
#define	reg_r_aagci_pga_bak_gain_len 3
#define	reg_r_aagci_pga_bak_gain_lsb 0
#define xd_p_reg_p_aagci_clr	(*(volatile byte xdata *) 0xECD0)
#define    p_reg_p_aagci_clr	0xECD0 
#define	reg_p_aagci_clr_pos 0
#define	reg_p_aagci_clr_len 1
#define	reg_p_aagci_clr_lsb 0
#define xd_p_reg_p_aagci_dccc_pga2	(*(volatile byte xdata *) 0xECD1)
#define    p_reg_p_aagci_dccc_pga2	0xECD1 
#define	reg_p_aagci_dccc_pga2_pos 0
#define	reg_p_aagci_dccc_pga2_len 4
#define	reg_p_aagci_dccc_pga2_lsb 0
#define xd_p_reg_p_aagci_iqikc_pga1	(*(volatile byte xdata *) 0xECD2)
#define    p_reg_p_aagci_iqikc_pga1	0xECD2 
#define	reg_p_aagci_iqikc_pga1_pos 0
#define	reg_p_aagci_iqikc_pga1_len 2
#define	reg_p_aagci_iqikc_pga1_lsb 0
#define xd_p_reg_p_aagci_iqikc_pga2	(*(volatile byte xdata *) 0xECD3)
#define    p_reg_p_aagci_iqikc_pga2	0xECD3 
#define	reg_p_aagci_iqikc_pga2_pos 0
#define	reg_p_aagci_iqikc_pga2_len 4
#define	reg_p_aagci_iqikc_pga2_lsb 0
#define xd_p_reg_p_aagci_lnac_lna	(*(volatile byte xdata *) 0xECD4)
#define    p_reg_p_aagci_lnac_lna	0xECD4 
#define	reg_p_aagci_lnac_lna_pos 0
#define	reg_p_aagci_lnac_lna_len 3
#define	reg_p_aagci_lnac_lna_lsb 0
#define xd_p_reg_p_aagci_lnac_pgc	(*(volatile byte xdata *) 0xECD5)
#define    p_reg_p_aagci_lnac_pgc	0xECD5 
#define	reg_p_aagci_lnac_pgc_pos 0
#define	reg_p_aagci_lnac_pgc_len 3
#define	reg_p_aagci_lnac_pgc_lsb 0
#define xd_p_reg_p_aagci_lnac_pga1	(*(volatile byte xdata *) 0xECD6)
#define    p_reg_p_aagci_lnac_pga1	0xECD6 
#define	reg_p_aagci_lnac_pga1_pos 0
#define	reg_p_aagci_lnac_pga1_len 2
#define	reg_p_aagci_lnac_pga1_lsb 0
#define xd_p_reg_p_aagci_lnac_pga2	(*(volatile byte xdata *) 0xECD7)
#define    p_reg_p_aagci_lnac_pga2	0xECD7 
#define	reg_p_aagci_lnac_pga2_pos 0
#define	reg_p_aagci_lnac_pga2_len 4
#define	reg_p_aagci_lnac_pga2_lsb 0
#define xd_p_reg_p_aagci_timeout_en	(*(volatile byte xdata *) 0xECD8)
#define    p_reg_p_aagci_timeout_en	0xECD8 
#define	reg_p_aagci_timeout_en_pos 0
#define	reg_p_aagci_timeout_en_len 1
#define	reg_p_aagci_timeout_en_lsb 0
#define xd_p_reg_p_aagci_timeout_time	(*(volatile byte xdata *) 0xECD9)
#define    p_reg_p_aagci_timeout_time	0xECD9 
#define	reg_p_aagci_timeout_time_pos 0
#define	reg_p_aagci_timeout_time_len 8
#define	reg_p_aagci_timeout_time_lsb 0
#define xd_p_reg_p_aagci_apply_loc	(*(volatile byte xdata *) 0xECDA)
#define    p_reg_p_aagci_apply_loc	0xECDA 
#define	reg_p_aagci_apply_loc_pos 0
#define	reg_p_aagci_apply_loc_len 1
#define	reg_p_aagci_apply_loc_lsb 0
#define xd_r_reg_r_aagci_error_flag	(*(volatile byte xdata *) 0xECDB)
#define    r_reg_r_aagci_error_flag	0xECDB 
#define	reg_r_aagci_error_flag_pos 0
#define	reg_r_aagci_error_flag_len 1
#define	reg_r_aagci_error_flag_lsb 0
#define xd_r_reg_r_aagci_error_type	(*(volatile byte xdata *) 0xECDC)
#define    r_reg_r_aagci_error_type	0xECDC 
#define	reg_r_aagci_error_type_pos 0
#define	reg_r_aagci_error_type_len 8
#define	reg_r_aagci_error_type_lsb 0
#define xd_r_reg_r_aagci_rcv_bitcnt	(*(volatile byte xdata *) 0xECDD)
#define    r_reg_r_aagci_rcv_bitcnt	0xECDD 
#define	reg_r_aagci_rcv_bitcnt_pos 0
#define	reg_r_aagci_rcv_bitcnt_len 5
#define	reg_r_aagci_rcv_bitcnt_lsb 0
#define xd_r_reg_r_aagci_rcv_bits_7_0	(*(volatile byte xdata *) 0xECDE)
#define    r_reg_r_aagci_rcv_bits_7_0	0xECDE 
#define	reg_r_aagci_rcv_bits_7_0_pos 0
#define	reg_r_aagci_rcv_bits_7_0_len 8
#define	reg_r_aagci_rcv_bits_7_0_lsb 0
#define xd_r_reg_r_aagci_rcv_bits_15_8	(*(volatile byte xdata *) 0xECDF)
#define    r_reg_r_aagci_rcv_bits_15_8	0xECDF 
#define	reg_r_aagci_rcv_bits_15_8_pos 0
#define	reg_r_aagci_rcv_bits_15_8_len 8
#define	reg_r_aagci_rcv_bits_15_8_lsb 8
#define xd_r_reg_r_aagci_rcv_parity	(*(volatile byte xdata *) 0xECE0)
#define    r_reg_r_aagci_rcv_parity	0xECE0 
#define	reg_r_aagci_rcv_parity_pos 0
#define	reg_r_aagci_rcv_parity_len 2
#define	reg_r_aagci_rcv_parity_lsb 0
#define xd_r_reg_r_aagci_apply_bits_7_0	(*(volatile byte xdata *) 0xECE1)
#define    r_reg_r_aagci_apply_bits_7_0	0xECE1 
#define	reg_r_aagci_apply_bits_7_0_pos 0
#define	reg_r_aagci_apply_bits_7_0_len 8
#define	reg_r_aagci_apply_bits_7_0_lsb 0
#define xd_r_reg_r_aagci_apply_bits_15_8	(*(volatile byte xdata *) 0xECE2)
#define    r_reg_r_aagci_apply_bits_15_8	0xECE2 
#define	reg_r_aagci_apply_bits_15_8_pos 0
#define	reg_r_aagci_apply_bits_15_8_len 8
#define	reg_r_aagci_apply_bits_15_8_lsb 8
#define xd_p_reg_p_fbc_vld	(*(volatile byte xdata *) 0xED00)
#define    p_reg_p_fbc_vld	0xED00 
#define	reg_p_fbc_vld_pos 0
#define	reg_p_fbc_vld_len 1
#define	reg_p_fbc_vld_lsb 0
#define xd_p_reg_p_fbc_rst	(*(volatile byte xdata *) 0xED01)
#define    p_reg_p_fbc_rst	0xED01 
#define	reg_p_fbc_rst_pos 0
#define	reg_p_fbc_rst_len 1
#define	reg_p_fbc_rst_lsb 0
#define xd_p_reg_p_fbc_pll_del	(*(volatile byte xdata *) 0xED02)
#define    p_reg_p_fbc_pll_del	0xED02 
#define	reg_p_fbc_pll_del_pos 0
#define	reg_p_fbc_pll_del_len 8
#define	reg_p_fbc_pll_del_lsb 0
#define xd_p_reg_p_fbc_n_code	(*(volatile byte xdata *) 0xED03)
#define    p_reg_p_fbc_n_code	0xED03 
#define	reg_p_fbc_n_code_pos 0
#define	reg_p_fbc_n_code_len 3
#define	reg_p_fbc_n_code_lsb 0
#define xd_p_reg_p_fbc_m1200_min_7_0	(*(volatile byte xdata *) 0xED04)
#define    p_reg_p_fbc_m1200_min_7_0	0xED04 
#define	reg_p_fbc_m1200_min_7_0_pos 0
#define	reg_p_fbc_m1200_min_7_0_len 8
#define	reg_p_fbc_m1200_min_7_0_lsb 0
#define xd_p_reg_p_fbc_m1200_min_12_8	(*(volatile byte xdata *) 0xED05)
#define    p_reg_p_fbc_m1200_min_12_8	0xED05 
#define	reg_p_fbc_m1200_min_12_8_pos 0
#define	reg_p_fbc_m1200_min_12_8_len 5
#define	reg_p_fbc_m1200_min_12_8_lsb 8
#define xd_p_reg_p_fbc_m1200_max_7_0	(*(volatile byte xdata *) 0xED06)
#define    p_reg_p_fbc_m1200_max_7_0	0xED06 
#define	reg_p_fbc_m1200_max_7_0_pos 0
#define	reg_p_fbc_m1200_max_7_0_len 8
#define	reg_p_fbc_m1200_max_7_0_lsb 0
#define xd_p_reg_p_fbc_m1200_max_12_8	(*(volatile byte xdata *) 0xED07)
#define    p_reg_p_fbc_m1200_max_12_8	0xED07 
#define	reg_p_fbc_m1200_max_12_8_pos 0
#define	reg_p_fbc_m1200_max_12_8_len 5
#define	reg_p_fbc_m1200_max_12_8_lsb 8
#define xd_p_reg_p_fbc_m1200_mid_7_0	(*(volatile byte xdata *) 0xED08)
#define    p_reg_p_fbc_m1200_mid_7_0	0xED08 
#define	reg_p_fbc_m1200_mid_7_0_pos 0
#define	reg_p_fbc_m1200_mid_7_0_len 8
#define	reg_p_fbc_m1200_mid_7_0_lsb 0
#define xd_p_reg_p_fbc_m1200_mid_12_8	(*(volatile byte xdata *) 0xED09)
#define    p_reg_p_fbc_m1200_mid_12_8	0xED09 
#define	reg_p_fbc_m1200_mid_12_8_pos 0
#define	reg_p_fbc_m1200_mid_12_8_len 5
#define	reg_p_fbc_m1200_mid_12_8_lsb 8
#define xd_p_reg_p_fbc_m2048_min_7_0	(*(volatile byte xdata *) 0xED0A)
#define    p_reg_p_fbc_m2048_min_7_0	0xED0A 
#define	reg_p_fbc_m2048_min_7_0_pos 0
#define	reg_p_fbc_m2048_min_7_0_len 8
#define	reg_p_fbc_m2048_min_7_0_lsb 0
#define xd_p_reg_p_fbc_m2048_min_12_8	(*(volatile byte xdata *) 0xED0B)
#define    p_reg_p_fbc_m2048_min_12_8	0xED0B 
#define	reg_p_fbc_m2048_min_12_8_pos 0
#define	reg_p_fbc_m2048_min_12_8_len 5
#define	reg_p_fbc_m2048_min_12_8_lsb 8
#define xd_p_reg_p_fbc_m2048_max_7_0	(*(volatile byte xdata *) 0xED0C)
#define    p_reg_p_fbc_m2048_max_7_0	0xED0C 
#define	reg_p_fbc_m2048_max_7_0_pos 0
#define	reg_p_fbc_m2048_max_7_0_len 8
#define	reg_p_fbc_m2048_max_7_0_lsb 0
#define xd_p_reg_p_fbc_m2048_max_12_8	(*(volatile byte xdata *) 0xED0D)
#define    p_reg_p_fbc_m2048_max_12_8	0xED0D 
#define	reg_p_fbc_m2048_max_12_8_pos 0
#define	reg_p_fbc_m2048_max_12_8_len 5
#define	reg_p_fbc_m2048_max_12_8_lsb 8
#define xd_p_reg_p_fbc_m2048_mid_7_0	(*(volatile byte xdata *) 0xED0E)
#define    p_reg_p_fbc_m2048_mid_7_0	0xED0E 
#define	reg_p_fbc_m2048_mid_7_0_pos 0
#define	reg_p_fbc_m2048_mid_7_0_len 8
#define	reg_p_fbc_m2048_mid_7_0_lsb 0
#define xd_p_reg_p_fbc_m2048_mid_12_8	(*(volatile byte xdata *) 0xED0F)
#define    p_reg_p_fbc_m2048_mid_12_8	0xED0F 
#define	reg_p_fbc_m2048_mid_12_8_pos 0
#define	reg_p_fbc_m2048_mid_12_8_len 5
#define	reg_p_fbc_m2048_mid_12_8_lsb 8
#define xd_p_reg_p_fbc_m_step_log2	(*(volatile byte xdata *) 0xED10)
#define    p_reg_p_fbc_m_step_log2	0xED10 
#define	reg_p_fbc_m_step_log2_pos 0
#define	reg_p_fbc_m_step_log2_len 4
#define	reg_p_fbc_m_step_log2_lsb 0
#define xd_p_reg_p_fbc_lo_m1200_0_7_0	(*(volatile byte xdata *) 0xED11)
#define    p_reg_p_fbc_lo_m1200_0_7_0	0xED11 
#define	reg_p_fbc_lo_m1200_0_7_0_pos 0
#define	reg_p_fbc_lo_m1200_0_7_0_len 8
#define	reg_p_fbc_lo_m1200_0_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m1200_0_12_8	(*(volatile byte xdata *) 0xED12)
#define    p_reg_p_fbc_lo_m1200_0_12_8	0xED12 
#define	reg_p_fbc_lo_m1200_0_12_8_pos 0
#define	reg_p_fbc_lo_m1200_0_12_8_len 5
#define	reg_p_fbc_lo_m1200_0_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_m1200_1_7_0	(*(volatile byte xdata *) 0xED13)
#define    p_reg_p_fbc_lo_m1200_1_7_0	0xED13 
#define	reg_p_fbc_lo_m1200_1_7_0_pos 0
#define	reg_p_fbc_lo_m1200_1_7_0_len 8
#define	reg_p_fbc_lo_m1200_1_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m1200_1_12_8	(*(volatile byte xdata *) 0xED14)
#define    p_reg_p_fbc_lo_m1200_1_12_8	0xED14 
#define	reg_p_fbc_lo_m1200_1_12_8_pos 0
#define	reg_p_fbc_lo_m1200_1_12_8_len 5
#define	reg_p_fbc_lo_m1200_1_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_m1200_2_7_0	(*(volatile byte xdata *) 0xED15)
#define    p_reg_p_fbc_lo_m1200_2_7_0	0xED15 
#define	reg_p_fbc_lo_m1200_2_7_0_pos 0
#define	reg_p_fbc_lo_m1200_2_7_0_len 8
#define	reg_p_fbc_lo_m1200_2_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m1200_2_12_8	(*(volatile byte xdata *) 0xED16)
#define    p_reg_p_fbc_lo_m1200_2_12_8	0xED16 
#define	reg_p_fbc_lo_m1200_2_12_8_pos 0
#define	reg_p_fbc_lo_m1200_2_12_8_len 5
#define	reg_p_fbc_lo_m1200_2_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_m2048_0_7_0	(*(volatile byte xdata *) 0xED17)
#define    p_reg_p_fbc_lo_m2048_0_7_0	0xED17 
#define	reg_p_fbc_lo_m2048_0_7_0_pos 0
#define	reg_p_fbc_lo_m2048_0_7_0_len 8
#define	reg_p_fbc_lo_m2048_0_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m2048_0_12_8	(*(volatile byte xdata *) 0xED18)
#define    p_reg_p_fbc_lo_m2048_0_12_8	0xED18 
#define	reg_p_fbc_lo_m2048_0_12_8_pos 0
#define	reg_p_fbc_lo_m2048_0_12_8_len 5
#define	reg_p_fbc_lo_m2048_0_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_m2048_1_7_0	(*(volatile byte xdata *) 0xED19)
#define    p_reg_p_fbc_lo_m2048_1_7_0	0xED19 
#define	reg_p_fbc_lo_m2048_1_7_0_pos 0
#define	reg_p_fbc_lo_m2048_1_7_0_len 8
#define	reg_p_fbc_lo_m2048_1_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m2048_1_12_8	(*(volatile byte xdata *) 0xED1A)
#define    p_reg_p_fbc_lo_m2048_1_12_8	0xED1A 
#define	reg_p_fbc_lo_m2048_1_12_8_pos 0
#define	reg_p_fbc_lo_m2048_1_12_8_len 5
#define	reg_p_fbc_lo_m2048_1_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_m2048_2_7_0	(*(volatile byte xdata *) 0xED1B)
#define    p_reg_p_fbc_lo_m2048_2_7_0	0xED1B 
#define	reg_p_fbc_lo_m2048_2_7_0_pos 0
#define	reg_p_fbc_lo_m2048_2_7_0_len 8
#define	reg_p_fbc_lo_m2048_2_7_0_lsb 0
#define xd_p_reg_p_fbc_lo_m2048_2_12_8	(*(volatile byte xdata *) 0xED1C)
#define    p_reg_p_fbc_lo_m2048_2_12_8	0xED1C 
#define	reg_p_fbc_lo_m2048_2_12_8_pos 0
#define	reg_p_fbc_lo_m2048_2_12_8_len 5
#define	reg_p_fbc_lo_m2048_2_12_8_lsb 8
#define xd_p_reg_p_fbc_lo_bias_0	(*(volatile byte xdata *) 0xED1D)
#define    p_reg_p_fbc_lo_bias_0	0xED1D 
#define	reg_p_fbc_lo_bias_0_pos 0
#define	reg_p_fbc_lo_bias_0_len 3
#define	reg_p_fbc_lo_bias_0_lsb 0
#define xd_p_reg_p_fbc_lo_bias_1	(*(volatile byte xdata *) 0xED1E)
#define    p_reg_p_fbc_lo_bias_1	0xED1E 
#define	reg_p_fbc_lo_bias_1_pos 0
#define	reg_p_fbc_lo_bias_1_len 3
#define	reg_p_fbc_lo_bias_1_lsb 0
#define xd_p_reg_p_fbc_lo_bias_2	(*(volatile byte xdata *) 0xED1F)
#define    p_reg_p_fbc_lo_bias_2	0xED1F 
#define	reg_p_fbc_lo_bias_2_pos 0
#define	reg_p_fbc_lo_bias_2_len 3
#define	reg_p_fbc_lo_bias_2_lsb 0
#define xd_p_reg_p_fbc_lo_bias_3	(*(volatile byte xdata *) 0xED20)
#define    p_reg_p_fbc_lo_bias_3	0xED20 
#define	reg_p_fbc_lo_bias_3_pos 0
#define	reg_p_fbc_lo_bias_3_len 3
#define	reg_p_fbc_lo_bias_3_lsb 0
#define xd_r_reg_r_fbc_fail	(*(volatile byte xdata *) 0xED21)
#define    r_reg_r_fbc_fail	0xED21 
#define	reg_r_fbc_fail_pos 0
#define	reg_r_fbc_fail_len 1
#define	reg_r_fbc_fail_lsb 0
#define xd_r_reg_r_fbc_error_type	(*(volatile byte xdata *) 0xED22)
#define    r_reg_r_fbc_error_type	0xED22 
#define	reg_r_fbc_error_type_pos 0
#define	reg_r_fbc_error_type_len 1
#define	reg_r_fbc_error_type_lsb 0
#define xd_r_reg_r_fbc_m_bdry_7_0	(*(volatile byte xdata *) 0xED23)
#define    r_reg_r_fbc_m_bdry_7_0	0xED23 
#define	reg_r_fbc_m_bdry_7_0_pos 0
#define	reg_r_fbc_m_bdry_7_0_len 8
#define	reg_r_fbc_m_bdry_7_0_lsb 0
#define xd_r_reg_r_fbc_m_bdry_12_8	(*(volatile byte xdata *) 0xED24)
#define    r_reg_r_fbc_m_bdry_12_8	0xED24 
#define	reg_r_fbc_m_bdry_12_8_pos 0
#define	reg_r_fbc_m_bdry_12_8_len 5
#define	reg_r_fbc_m_bdry_12_8_lsb 8
#define xd_p_reg_p_dcc_mode	(*(volatile byte xdata *) 0xED40)
#define    p_reg_p_dcc_mode	0xED40 
#define	reg_p_dcc_mode_pos 0
#define	reg_p_dcc_mode_len 2
#define	reg_p_dcc_mode_lsb 0
#define xd_p_reg_p_dcc_i_acc_0_fixed	(*(volatile byte xdata *) 0xED41)
#define    p_reg_p_dcc_i_acc_0_fixed	0xED41 
#define	reg_p_dcc_i_acc_0_fixed_pos 0
#define	reg_p_dcc_i_acc_0_fixed_len 6
#define	reg_p_dcc_i_acc_0_fixed_lsb 0
#define xd_p_reg_p_dcc_q_acc_0_fixed	(*(volatile byte xdata *) 0xED42)
#define    p_reg_p_dcc_q_acc_0_fixed	0xED42 
#define	reg_p_dcc_q_acc_0_fixed_pos 0
#define	reg_p_dcc_q_acc_0_fixed_len 6
#define	reg_p_dcc_q_acc_0_fixed_lsb 0
#define xd_p_reg_p_dcc_i_acc_1_fixed	(*(volatile byte xdata *) 0xED43)
#define    p_reg_p_dcc_i_acc_1_fixed	0xED43 
#define	reg_p_dcc_i_acc_1_fixed_pos 0
#define	reg_p_dcc_i_acc_1_fixed_len 6
#define	reg_p_dcc_i_acc_1_fixed_lsb 0
#define xd_p_reg_p_dcc_q_acc_1_fixed	(*(volatile byte xdata *) 0xED44)
#define    p_reg_p_dcc_q_acc_1_fixed	0xED44 
#define	reg_p_dcc_q_acc_1_fixed_pos 0
#define	reg_p_dcc_q_acc_1_fixed_len 6
#define	reg_p_dcc_q_acc_1_fixed_lsb 0
#define xd_p_reg_p_dcc_i_acc_2_fixed	(*(volatile byte xdata *) 0xED45)
#define    p_reg_p_dcc_i_acc_2_fixed	0xED45 
#define	reg_p_dcc_i_acc_2_fixed_pos 0
#define	reg_p_dcc_i_acc_2_fixed_len 6
#define	reg_p_dcc_i_acc_2_fixed_lsb 0
#define xd_p_reg_p_dcc_q_acc_2_fixed	(*(volatile byte xdata *) 0xED46)
#define    p_reg_p_dcc_q_acc_2_fixed	0xED46 
#define	reg_p_dcc_q_acc_2_fixed_pos 0
#define	reg_p_dcc_q_acc_2_fixed_len 6
#define	reg_p_dcc_q_acc_2_fixed_lsb 0
#define xd_p_reg_p_dcc_i_acc_3_fixed	(*(volatile byte xdata *) 0xED47)
#define    p_reg_p_dcc_i_acc_3_fixed	0xED47 
#define	reg_p_dcc_i_acc_3_fixed_pos 0
#define	reg_p_dcc_i_acc_3_fixed_len 6
#define	reg_p_dcc_i_acc_3_fixed_lsb 0
#define xd_p_reg_p_dcc_q_acc_3_fixed	(*(volatile byte xdata *) 0xED48)
#define    p_reg_p_dcc_q_acc_3_fixed	0xED48 
#define	reg_p_dcc_q_acc_3_fixed_pos 0
#define	reg_p_dcc_q_acc_3_fixed_len 6
#define	reg_p_dcc_q_acc_3_fixed_lsb 0
#define xd_p_reg_p_dcc_timer_thld_ini	(*(volatile byte xdata *) 0xED49)
#define    p_reg_p_dcc_timer_thld_ini	0xED49 
#define	reg_p_dcc_timer_thld_ini_pos 0
#define	reg_p_dcc_timer_thld_ini_len 3
#define	reg_p_dcc_timer_thld_ini_lsb 0
#define xd_p_reg_p_dcc_timer_thld_track	(*(volatile byte xdata *) 0xED4A)
#define    p_reg_p_dcc_timer_thld_track	0xED4A 
#define	reg_p_dcc_timer_thld_track_pos 0
#define	reg_p_dcc_timer_thld_track_len 3
#define	reg_p_dcc_timer_thld_track_lsb 0
#define xd_p_reg_p_dcc_iir_weight_ini	(*(volatile byte xdata *) 0xED4B)
#define    p_reg_p_dcc_iir_weight_ini	0xED4B 
#define	reg_p_dcc_iir_weight_ini_pos 0
#define	reg_p_dcc_iir_weight_ini_len 3
#define	reg_p_dcc_iir_weight_ini_lsb 0
#define xd_p_reg_p_dcc_iir_weight_track	(*(volatile byte xdata *) 0xED4C)
#define    p_reg_p_dcc_iir_weight_track	0xED4C 
#define	reg_p_dcc_iir_weight_track_pos 0
#define	reg_p_dcc_iir_weight_track_len 3
#define	reg_p_dcc_iir_weight_track_lsb 0
#define xd_p_reg_p_dcc_lock_thld	(*(volatile byte xdata *) 0xED4D)
#define    p_reg_p_dcc_lock_thld	0xED4D 
#define	reg_p_dcc_lock_thld_pos 0
#define	reg_p_dcc_lock_thld_len 2
#define	reg_p_dcc_lock_thld_lsb 0
#define xd_p_reg_p_dcc_i_inv	(*(volatile byte xdata *) 0xED4E)
#define    p_reg_p_dcc_i_inv	0xED4E 
#define	reg_p_dcc_i_inv_pos 0
#define	reg_p_dcc_i_inv_len 1
#define	reg_p_dcc_i_inv_lsb 0
#define xd_p_reg_p_dcc_q_inv	(*(volatile byte xdata *) 0xED4F)
#define    p_reg_p_dcc_q_inv	0xED4F 
#define	reg_p_dcc_q_inv_pos 0
#define	reg_p_dcc_q_inv_len 1
#define	reg_p_dcc_q_inv_lsb 0
#define xd_p_reg_p_dcc_iq_swap	(*(volatile byte xdata *) 0xED50)
#define    p_reg_p_dcc_iq_swap	0xED50 
#define	reg_p_dcc_iq_swap_pos 0
#define	reg_p_dcc_iq_swap_len 1
#define	reg_p_dcc_iq_swap_lsb 0
#define xd_p_reg_p_dcc_normal_mode	(*(volatile byte xdata *) 0xED51)
#define    p_reg_p_dcc_normal_mode	0xED51 
#define	reg_p_dcc_normal_mode_pos 0
#define	reg_p_dcc_normal_mode_len 1
#define	reg_p_dcc_normal_mode_lsb 0
#define xd_r_reg_r_dcc_ste	(*(volatile byte xdata *) 0xED52)
#define    r_reg_r_dcc_ste	0xED52 
#define	reg_r_dcc_ste_pos 0
#define	reg_r_dcc_ste_len 2
#define	reg_r_dcc_ste_lsb 0
#define xd_r_reg_r_dcc_i_acc	(*(volatile byte xdata *) 0xED53)
#define    r_reg_r_dcc_i_acc	0xED53 
#define	reg_r_dcc_i_acc_pos 0
#define	reg_r_dcc_i_acc_len 6
#define	reg_r_dcc_i_acc_lsb 0
#define xd_r_reg_r_dcc_q_acc	(*(volatile byte xdata *) 0xED54)
#define    r_reg_r_dcc_q_acc	0xED54 
#define	reg_r_dcc_q_acc_pos 0
#define	reg_r_dcc_q_acc_len 6
#define	reg_r_dcc_q_acc_lsb 0
#define xd_r_reg_r_dcc_i_iir_7_0	(*(volatile byte xdata *) 0xED55)
#define    r_reg_r_dcc_i_iir_7_0	0xED55 
#define	reg_r_dcc_i_iir_7_0_pos 0
#define	reg_r_dcc_i_iir_7_0_len 8
#define	reg_r_dcc_i_iir_7_0_lsb 0
