liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_r_reg_r_dcc_i_iir_15_8	(*(volatile byte xdata *) 0xED56)
#define    r_reg_r_dcc_i_iir_15_8	0xED56 
#define	reg_r_dcc_i_iir_15_8_pos 0
#define	reg_r_dcc_i_iir_15_8_len 8
#define	reg_r_dcc_i_iir_15_8_lsb 8
#define xd_r_reg_r_dcc_q_iir_7_0	(*(volatile byte xdata *) 0xED57)
#define    r_reg_r_dcc_q_iir_7_0	0xED57 
#define	reg_r_dcc_q_iir_7_0_pos 0
#define	reg_r_dcc_q_iir_7_0_len 8
#define	reg_r_dcc_q_iir_7_0_lsb 0
#define xd_r_reg_r_dcc_q_iir_15_8	(*(volatile byte xdata *) 0xED58)
#define    r_reg_r_dcc_q_iir_15_8	0xED58 
#define	reg_r_dcc_q_iir_15_8_pos 0
#define	reg_r_dcc_q_iir_15_8_len 8
#define	reg_r_dcc_q_iir_15_8_lsb 8
#define xd_p_reg_p_dccc_vld	(*(volatile byte xdata *) 0xED59)
#define    p_reg_p_dccc_vld	0xED59 
#define	reg_p_dccc_vld_pos 0
#define	reg_p_dccc_vld_len 1
#define	reg_p_dccc_vld_lsb 0
#define xd_p_reg_p_dccc_rst	(*(volatile byte xdata *) 0xED5A)
#define    p_reg_p_dccc_rst	0xED5A 
#define	reg_p_dccc_rst_pos 0
#define	reg_p_dccc_rst_len 1
#define	reg_p_dccc_rst_lsb 0
#define xd_p_reg_p_dccc_pga_del	(*(volatile byte xdata *) 0xED5B)
#define    p_reg_p_dccc_pga_del	0xED5B 
#define	reg_p_dccc_pga_del_pos 0
#define	reg_p_dccc_pga_del_len 8
#define	reg_p_dccc_pga_del_lsb 0
#define xd_p_reg_p_dccc_timeout_time	(*(volatile byte xdata *) 0xED5C)
#define    p_reg_p_dccc_timeout_time	0xED5C 
#define	reg_p_dccc_timeout_time_pos 0
#define	reg_p_dccc_timeout_time_len 8
#define	reg_p_dccc_timeout_time_lsb 0
#define xd_p_reg_r_dccc_fail	(*(volatile byte xdata *) 0xED5D)
#define    p_reg_r_dccc_fail	0xED5D 
#define	reg_r_dccc_fail_pos 0
#define	reg_r_dccc_fail_len 1
#define	reg_r_dccc_fail_lsb 0
#define xd_p_reg_p_iqik_mode	(*(volatile byte xdata *) 0xED80)
#define    p_reg_p_iqik_mode	0xED80 
#define	reg_p_iqik_mode_pos 0
#define	reg_p_iqik_mode_len 2
#define	reg_p_iqik_mode_lsb 0
#define xd_p_reg_p_iqik_m_cal	(*(volatile byte xdata *) 0xED81)
#define    p_reg_p_iqik_m_cal	0xED81 
#define	reg_p_iqik_m_cal_pos 0
#define	reg_p_iqik_m_cal_len 6
#define	reg_p_iqik_m_cal_lsb 0
#define xd_p_reg_p_iqik_duration	(*(volatile byte xdata *) 0xED82)
#define    p_reg_p_iqik_duration	0xED82 
#define	reg_p_iqik_duration_pos 0
#define	reg_p_iqik_duration_len 3
#define	reg_p_iqik_duration_lsb 0
#define xd_p_reg_p_iqik_i_inv	(*(volatile byte xdata *) 0xED83)
#define    p_reg_p_iqik_i_inv	0xED83 
#define	reg_p_iqik_i_inv_pos 0
#define	reg_p_iqik_i_inv_len 1
#define	reg_p_iqik_i_inv_lsb 0
#define xd_p_reg_p_iqik_q_inv	(*(volatile byte xdata *) 0xED84)
#define    p_reg_p_iqik_q_inv	0xED84 
#define	reg_p_iqik_q_inv_pos 0
#define	reg_p_iqik_q_inv_len 1
#define	reg_p_iqik_q_inv_lsb 0
#define xd_p_reg_p_iqik_iq_swap	(*(volatile byte xdata *) 0xED85)
#define    p_reg_p_iqik_iq_swap	0xED85 
#define	reg_p_iqik_iq_swap_pos 0
#define	reg_p_iqik_iq_swap_len 1
#define	reg_p_iqik_iq_swap_lsb 0
#define xd_p_reg_p_iqik_snrth_lin_7_0	(*(volatile byte xdata *) 0xED86)
#define    p_reg_p_iqik_snrth_lin_7_0	0xED86 
#define	reg_p_iqik_snrth_lin_7_0_pos 0
#define	reg_p_iqik_snrth_lin_7_0_len 8
#define	reg_p_iqik_snrth_lin_7_0_lsb 0
#define xd_p_reg_p_iqik_snrth_lin_15_8	(*(volatile byte xdata *) 0xED87)
#define    p_reg_p_iqik_snrth_lin_15_8	0xED87 
#define	reg_p_iqik_snrth_lin_15_8_pos 0
#define	reg_p_iqik_snrth_lin_15_8_len 8
#define	reg_p_iqik_snrth_lin_15_8_lsb 8
#define xd_r_reg_r_iqik_vi_real_7_0	(*(volatile byte xdata *) 0xED88)
#define    r_reg_r_iqik_vi_real_7_0	0xED88 
#define	reg_r_iqik_vi_real_7_0_pos 0
#define	reg_r_iqik_vi_real_7_0_len 8
#define	reg_r_iqik_vi_real_7_0_lsb 0
#define xd_r_reg_r_iqik_vi_real_15_8	(*(volatile byte xdata *) 0xED89)
#define    r_reg_r_iqik_vi_real_15_8	0xED89 
#define	reg_r_iqik_vi_real_15_8_pos 0
#define	reg_r_iqik_vi_real_15_8_len 8
#define	reg_r_iqik_vi_real_15_8_lsb 8
#define xd_r_reg_r_iqik_vi_real_16	(*(volatile byte xdata *) 0xED8A)
#define    r_reg_r_iqik_vi_real_16	0xED8A 
#define	reg_r_iqik_vi_real_16_pos 0
#define	reg_r_iqik_vi_real_16_len 1
#define	reg_r_iqik_vi_real_16_lsb 16
#define xd_r_reg_r_iqik_vi_imag_7_0	(*(volatile byte xdata *) 0xED8B)
#define    r_reg_r_iqik_vi_imag_7_0	0xED8B 
#define	reg_r_iqik_vi_imag_7_0_pos 0
#define	reg_r_iqik_vi_imag_7_0_len 8
#define	reg_r_iqik_vi_imag_7_0_lsb 0
#define xd_r_reg_r_iqik_vi_imag_15_8	(*(volatile byte xdata *) 0xED8C)
#define    r_reg_r_iqik_vi_imag_15_8	0xED8C 
#define	reg_r_iqik_vi_imag_15_8_pos 0
#define	reg_r_iqik_vi_imag_15_8_len 8
#define	reg_r_iqik_vi_imag_15_8_lsb 8
#define xd_r_reg_r_iqik_vi_imag_16	(*(volatile byte xdata *) 0xED8D)
#define    r_reg_r_iqik_vi_imag_16	0xED8D 
#define	reg_r_iqik_vi_imag_16_pos 0
#define	reg_r_iqik_vi_imag_16_len 1
#define	reg_r_iqik_vi_imag_16_lsb 16
#define xd_r_reg_r_iqik_vq_real_7_0	(*(volatile byte xdata *) 0xED8E)
#define    r_reg_r_iqik_vq_real_7_0	0xED8E 
#define	reg_r_iqik_vq_real_7_0_pos 0
#define	reg_r_iqik_vq_real_7_0_len 8
#define	reg_r_iqik_vq_real_7_0_lsb 0
#define xd_r_reg_r_iqik_vq_real_15_8	(*(volatile byte xdata *) 0xED8F)
#define    r_reg_r_iqik_vq_real_15_8	0xED8F 
#define	reg_r_iqik_vq_real_15_8_pos 0
#define	reg_r_iqik_vq_real_15_8_len 8
#define	reg_r_iqik_vq_real_15_8_lsb 8
#define xd_r_reg_r_iqik_vq_real_16	(*(volatile byte xdata *) 0xED90)
#define    r_reg_r_iqik_vq_real_16	0xED90 
#define	reg_r_iqik_vq_real_16_pos 0
#define	reg_r_iqik_vq_real_16_len 1
#define	reg_r_iqik_vq_real_16_lsb 16
#define xd_r_reg_r_iqik_vq_imag_7_0	(*(volatile byte xdata *) 0xED91)
#define    r_reg_r_iqik_vq_imag_7_0	0xED91 
#define	reg_r_iqik_vq_imag_7_0_pos 0
#define	reg_r_iqik_vq_imag_7_0_len 8
#define	reg_r_iqik_vq_imag_7_0_lsb 0
#define xd_r_reg_r_iqik_vq_imag_15_8	(*(volatile byte xdata *) 0xED92)
#define    r_reg_r_iqik_vq_imag_15_8	0xED92 
#define	reg_r_iqik_vq_imag_15_8_pos 0
#define	reg_r_iqik_vq_imag_15_8_len 8
#define	reg_r_iqik_vq_imag_15_8_lsb 8
#define xd_r_reg_r_iqik_vq_imag_16	(*(volatile byte xdata *) 0xED93)
#define    r_reg_r_iqik_vq_imag_16	0xED93 
#define	reg_r_iqik_vq_imag_16_pos 0
#define	reg_r_iqik_vq_imag_16_len 1
#define	reg_r_iqik_vq_imag_16_lsb 16
#define xd_r_reg_r_iqik_ste	(*(volatile byte xdata *) 0xED94)
#define    r_reg_r_iqik_ste	0xED94 
#define	reg_r_iqik_ste_pos 0
#define	reg_r_iqik_ste_len 2
#define	reg_r_iqik_ste_lsb 0
#define xd_r_reg_r_iqik_coe1_7_0	(*(volatile byte xdata *) 0xED95)
#define    r_reg_r_iqik_coe1_7_0	0xED95 
#define	reg_r_iqik_coe1_7_0_pos 0
#define	reg_r_iqik_coe1_7_0_len 8
#define	reg_r_iqik_coe1_7_0_lsb 0
#define xd_r_reg_r_iqik_coe1_10_8	(*(volatile byte xdata *) 0xED96)
#define    r_reg_r_iqik_coe1_10_8	0xED96 
#define	reg_r_iqik_coe1_10_8_pos 0
#define	reg_r_iqik_coe1_10_8_len 3
#define	reg_r_iqik_coe1_10_8_lsb 8
#define xd_r_reg_r_iqik_coe2_7_0	(*(volatile byte xdata *) 0xED97)
#define    r_reg_r_iqik_coe2_7_0	0xED97 
#define	reg_r_iqik_coe2_7_0_pos 0
#define	reg_r_iqik_coe2_7_0_len 8
#define	reg_r_iqik_coe2_7_0_lsb 0
#define xd_r_reg_r_iqik_coe2_10_8	(*(volatile byte xdata *) 0xED98)
#define    r_reg_r_iqik_coe2_10_8	0xED98 
#define	reg_r_iqik_coe2_10_8_pos 0
#define	reg_r_iqik_coe2_10_8_len 3
#define	reg_r_iqik_coe2_10_8_lsb 8
#define xd_r_reg_r_iqik_coe3_7_0	(*(volatile byte xdata *) 0xED99)
#define    r_reg_r_iqik_coe3_7_0	0xED99 
#define	reg_r_iqik_coe3_7_0_pos 0
#define	reg_r_iqik_coe3_7_0_len 8
#define	reg_r_iqik_coe3_7_0_lsb 0
#define xd_r_reg_r_iqik_coe3_10_8	(*(volatile byte xdata *) 0xED9A)
#define    r_reg_r_iqik_coe3_10_8	0xED9A 
#define	reg_r_iqik_coe3_10_8_pos 0
#define	reg_r_iqik_coe3_10_8_len 3
#define	reg_r_iqik_coe3_10_8_lsb 8
#define xd_r_reg_r_iqik_adcsnr_i_pass	(*(volatile byte xdata *) 0xED9B)
#define    r_reg_r_iqik_adcsnr_i_pass	0xED9B 
#define	reg_r_iqik_adcsnr_i_pass_pos 0
#define	reg_r_iqik_adcsnr_i_pass_len 1
#define	reg_r_iqik_adcsnr_i_pass_lsb 0
#define xd_r_reg_r_iqik_adcsnr_q_pass	(*(volatile byte xdata *) 0xED9C)
#define    r_reg_r_iqik_adcsnr_q_pass	0xED9C 
#define	reg_r_iqik_adcsnr_q_pass_pos 0
#define	reg_r_iqik_adcsnr_q_pass_len 1
#define	reg_r_iqik_adcsnr_q_pass_lsb 0
#define xd_p_reg_p_iqik_cal_use_clk12mhz_en	(*(volatile byte xdata *) 0xED9D)
#define    p_reg_p_iqik_cal_use_clk12mhz_en	0xED9D 
#define	reg_p_iqik_cal_use_clk12mhz_en_pos 0
#define	reg_p_iqik_cal_use_clk12mhz_en_len 1
#define	reg_p_iqik_cal_use_clk12mhz_en_lsb 0
#define xd_p_reg_p_iqikc_vld	(*(volatile byte xdata *) 0xEDC0)
#define    p_reg_p_iqikc_vld	0xEDC0 
#define	reg_p_iqikc_vld_pos 0
#define	reg_p_iqikc_vld_len 1
#define	reg_p_iqikc_vld_lsb 0
#define xd_p_reg_p_iqikc_rst	(*(volatile byte xdata *) 0xEDC1)
#define    p_reg_p_iqikc_rst	0xEDC1 
#define	reg_p_iqikc_rst_pos 0
#define	reg_p_iqikc_rst_len 1
#define	reg_p_iqikc_rst_lsb 0
#define xd_p_reg_p_iqikc_pll_del	(*(volatile byte xdata *) 0xEDC2)
#define    p_reg_p_iqikc_pll_del	0xEDC2 
#define	reg_p_iqikc_pll_del_pos 0
#define	reg_p_iqikc_pll_del_len 8
#define	reg_p_iqikc_pll_del_lsb 0
#define xd_p_reg_p_iqikc_m_cal1200	(*(volatile byte xdata *) 0xEDC3)
#define    p_reg_p_iqikc_m_cal1200	0xEDC3 
#define	reg_p_iqikc_m_cal1200_pos 0
#define	reg_p_iqikc_m_cal1200_len 6
#define	reg_p_iqikc_m_cal1200_lsb 0
#define xd_p_reg_p_iqikc_m_cal2048	(*(volatile byte xdata *) 0xEDC4)
#define    p_reg_p_iqikc_m_cal2048	0xEDC4 
#define	reg_p_iqikc_m_cal2048_pos 0
#define	reg_p_iqikc_m_cal2048_len 6
#define	reg_p_iqikc_m_cal2048_lsb 0
#define xd_r_reg_r_iqikc_fail	(*(volatile byte xdata *) 0xEDC5)
#define    r_reg_r_iqikc_fail	0xEDC5 
#define	reg_r_iqikc_fail_pos 0
#define	reg_r_iqikc_fail_len 1
#define	reg_r_iqikc_fail_lsb 0
#define xd_p_reg_p_lnac_vld	(*(volatile byte xdata *) 0xEE00)
#define    p_reg_p_lnac_vld	0xEE00 
#define	reg_p_lnac_vld_pos 0
#define	reg_p_lnac_vld_len 1
#define	reg_p_lnac_vld_lsb 0
#define xd_p_reg_p_lnac_rst	(*(volatile byte xdata *) 0xEE01)
#define    p_reg_p_lnac_rst	0xEE01 
#define	reg_p_lnac_rst_pos 0
#define	reg_p_lnac_rst_len 1
#define	reg_p_lnac_rst_lsb 0
#define xd_p_reg_p_lnac_search_mode	(*(volatile byte xdata *) 0xEE02)
#define    p_reg_p_lnac_search_mode	0xEE02 
#define	reg_p_lnac_search_mode_pos 0
#define	reg_p_lnac_search_mode_len 1
#define	reg_p_lnac_search_mode_lsb 0
#define xd_p_reg_p_lnac_lna_cap_del	(*(volatile byte xdata *) 0xEE03)
#define    p_reg_p_lnac_lna_cap_del	0xEE03 
#define	reg_p_lnac_lna_cap_del_pos 0
#define	reg_p_lnac_lna_cap_del_len 8
#define	reg_p_lnac_lna_cap_del_lsb 0
#define xd_p_reg_p_lnac_m_cal1200	(*(volatile byte xdata *) 0xEE04)
#define    p_reg_p_lnac_m_cal1200	0xEE04 
#define	reg_p_lnac_m_cal1200_pos 0
#define	reg_p_lnac_m_cal1200_len 6
#define	reg_p_lnac_m_cal1200_lsb 0
#define xd_p_reg_p_lnac_m_cal2048	(*(volatile byte xdata *) 0xEE05)
#define    p_reg_p_lnac_m_cal2048	0xEE05 
#define	reg_p_lnac_m_cal2048_pos 0
#define	reg_p_lnac_m_cal2048_len 6
#define	reg_p_lnac_m_cal2048_lsb 0
#define xd_p_reg_p_lnac_lna_cap_sel	(*(volatile byte xdata *) 0xEE06)
#define    p_reg_p_lnac_lna_cap_sel	0xEE06 
#define	reg_p_lnac_lna_cap_sel_pos 0
#define	reg_p_lnac_lna_cap_sel_len 3
#define	reg_p_lnac_lna_cap_sel_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_en	(*(volatile byte xdata *) 0xEE07)
#define    p_reg_p_lnac_lna_cap_force_en	0xEE07 
#define	reg_p_lnac_lna_cap_force_en_pos 0
#define	reg_p_lnac_lna_cap_force_en_len 1
#define	reg_p_lnac_lna_cap_force_en_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_0	(*(volatile byte xdata *) 0xEE08)
#define    p_reg_p_lnac_lna_cap_force_0	0xEE08 
#define	reg_p_lnac_lna_cap_force_0_pos 0
#define	reg_p_lnac_lna_cap_force_0_len 6
#define	reg_p_lnac_lna_cap_force_0_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_1	(*(volatile byte xdata *) 0xEE09)
#define    p_reg_p_lnac_lna_cap_force_1	0xEE09 
#define	reg_p_lnac_lna_cap_force_1_pos 0
#define	reg_p_lnac_lna_cap_force_1_len 6
#define	reg_p_lnac_lna_cap_force_1_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_2	(*(volatile byte xdata *) 0xEE0A)
#define    p_reg_p_lnac_lna_cap_force_2	0xEE0A 
#define	reg_p_lnac_lna_cap_force_2_pos 0
#define	reg_p_lnac_lna_cap_force_2_len 6
#define	reg_p_lnac_lna_cap_force_2_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_3	(*(volatile byte xdata *) 0xEE0B)
#define    p_reg_p_lnac_lna_cap_force_3	0xEE0B 
#define	reg_p_lnac_lna_cap_force_3_pos 0
#define	reg_p_lnac_lna_cap_force_3_len 6
#define	reg_p_lnac_lna_cap_force_3_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_4	(*(volatile byte xdata *) 0xEE0C)
#define    p_reg_p_lnac_lna_cap_force_4	0xEE0C 
#define	reg_p_lnac_lna_cap_force_4_pos 0
#define	reg_p_lnac_lna_cap_force_4_len 6
#define	reg_p_lnac_lna_cap_force_4_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_5	(*(volatile byte xdata *) 0xEE0D)
#define    p_reg_p_lnac_lna_cap_force_5	0xEE0D 
#define	reg_p_lnac_lna_cap_force_5_pos 0
#define	reg_p_lnac_lna_cap_force_5_len 6
#define	reg_p_lnac_lna_cap_force_5_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_6	(*(volatile byte xdata *) 0xEE0E)
#define    p_reg_p_lnac_lna_cap_force_6	0xEE0E 
#define	reg_p_lnac_lna_cap_force_6_pos 0
#define	reg_p_lnac_lna_cap_force_6_len 6
#define	reg_p_lnac_lna_cap_force_6_lsb 0
#define xd_p_reg_p_lnac_lna_cap_force_7	(*(volatile byte xdata *) 0xEE0F)
#define    p_reg_p_lnac_lna_cap_force_7	0xEE0F 
#define	reg_p_lnac_lna_cap_force_7_pos 0
#define	reg_p_lnac_lna_cap_force_7_len 6
#define	reg_p_lnac_lna_cap_force_7_lsb 0
#define xd_r_reg_r_lnac_lna_cap_0	(*(volatile byte xdata *) 0xEE10)
#define    r_reg_r_lnac_lna_cap_0	0xEE10 
#define	reg_r_lnac_lna_cap_0_pos 0
#define	reg_r_lnac_lna_cap_0_len 6
#define	reg_r_lnac_lna_cap_0_lsb 0
#define xd_r_reg_r_lnac_lna_cap_1	(*(volatile byte xdata *) 0xEE11)
#define    r_reg_r_lnac_lna_cap_1	0xEE11 
#define	reg_r_lnac_lna_cap_1_pos 0
#define	reg_r_lnac_lna_cap_1_len 6
#define	reg_r_lnac_lna_cap_1_lsb 0
#define xd_r_reg_r_lnac_lna_cap_2	(*(volatile byte xdata *) 0xEE12)
#define    r_reg_r_lnac_lna_cap_2	0xEE12 
#define	reg_r_lnac_lna_cap_2_pos 0
#define	reg_r_lnac_lna_cap_2_len 6
#define	reg_r_lnac_lna_cap_2_lsb 0
#define xd_r_reg_r_lnac_lna_cap_3	(*(volatile byte xdata *) 0xEE13)
#define    r_reg_r_lnac_lna_cap_3	0xEE13 
#define	reg_r_lnac_lna_cap_3_pos 0
#define	reg_r_lnac_lna_cap_3_len 6
#define	reg_r_lnac_lna_cap_3_lsb 0
#define xd_r_reg_r_lnac_lna_cap_4	(*(volatile byte xdata *) 0xEE14)
#define    r_reg_r_lnac_lna_cap_4	0xEE14 
#define	reg_r_lnac_lna_cap_4_pos 0
#define	reg_r_lnac_lna_cap_4_len 6
#define	reg_r_lnac_lna_cap_4_lsb 0
#define xd_r_reg_r_lnac_lna_cap_5	(*(volatile byte xdata *) 0xEE15)
#define    r_reg_r_lnac_lna_cap_5	0xEE15 
#define	reg_r_lnac_lna_cap_5_pos 0
#define	reg_r_lnac_lna_cap_5_len 6
#define	reg_r_lnac_lna_cap_5_lsb 0
#define xd_r_reg_r_lnac_lna_cap_6	(*(volatile byte xdata *) 0xEE16)
#define    r_reg_r_lnac_lna_cap_6	0xEE16 
#define	reg_r_lnac_lna_cap_6_pos 0
#define	reg_r_lnac_lna_cap_6_len 6
#define	reg_r_lnac_lna_cap_6_lsb 0
#define xd_r_reg_r_lnac_lna_cap_7	(*(volatile byte xdata *) 0xEE17)
#define    r_reg_r_lnac_lna_cap_7	0xEE17 
#define	reg_r_lnac_lna_cap_7_pos 0
#define	reg_r_lnac_lna_cap_7_len 6
#define	reg_r_lnac_lna_cap_7_lsb 0
#define xd_r_reg_r_lnac_fail	(*(volatile byte xdata *) 0xEE18)
#define    r_reg_r_lnac_fail	0xEE18 
#define	reg_r_lnac_fail_pos 0
#define	reg_r_lnac_fail_len 1
#define	reg_r_lnac_fail_lsb 0
#define xd_p_reg_p_loc_vld	(*(volatile byte xdata *) 0xEE40)
#define    p_reg_p_loc_vld	0xEE40 
#define	reg_p_loc_vld_pos 0
#define	reg_p_loc_vld_len 1
#define	reg_p_loc_vld_lsb 0
#define xd_p_reg_p_loc_rst	(*(volatile byte xdata *) 0xEE41)
#define    p_reg_p_loc_rst	0xEE41 
#define	reg_p_loc_rst_pos 0
#define	reg_p_loc_rst_len 1
#define	reg_p_loc_rst_lsb 0
#define xd_p_reg_p_loc_pll_del	(*(volatile byte xdata *) 0xEE42)
#define    p_reg_p_loc_pll_del	0xEE42 
#define	reg_p_loc_pll_del_pos 0
#define	reg_p_loc_pll_del_len 8
#define	reg_p_loc_pll_del_lsb 0
#define xd_p_reg_p_loc_lo_cap_mid	(*(volatile byte xdata *) 0xEE43)
#define    p_reg_p_loc_lo_cap_mid	0xEE43 
#define	reg_p_loc_lo_cap_mid_pos 0
#define	reg_p_loc_lo_cap_mid_len 6
#define	reg_p_loc_lo_cap_mid_lsb 0
#define xd_p_reg_p_loc_lo_cap_step_log2	(*(volatile byte xdata *) 0xEE44)
#define    p_reg_p_loc_lo_cap_step_log2	0xEE44 
#define	reg_p_loc_lo_cap_step_log2_pos 0
#define	reg_p_loc_lo_cap_step_log2_len 4
#define	reg_p_loc_lo_cap_step_log2_lsb 0
#define xd_p_reg_p_loc_ceil	(*(volatile byte xdata *) 0xEE45)
#define    p_reg_p_loc_ceil	0xEE45 
#define	reg_p_loc_ceil_pos 0
#define	reg_p_loc_ceil_len 1
#define	reg_p_loc_ceil_lsb 0
#define xd_r_reg_r_loc_fail	(*(volatile byte xdata *) 0xEE46)
#define    r_reg_r_loc_fail	0xEE46 
#define	reg_r_loc_fail_pos 0
#define	reg_r_loc_fail_len 1
#define	reg_r_loc_fail_lsb 0
#define xd_r_reg_r_loc_error_type	(*(volatile byte xdata *) 0xEE47)
#define    r_reg_r_loc_error_type	0xEE47 
#define	reg_r_loc_error_type_pos 0
#define	reg_r_loc_error_type_len 1
#define	reg_r_loc_error_type_lsb 0
#define xd_r_reg_r_loc_lo_cap_opt	(*(volatile byte xdata *) 0xEE48)
#define    r_reg_r_loc_lo_cap_opt	0xEE48 
#define	reg_r_loc_lo_cap_opt_pos 0
#define	reg_r_loc_lo_cap_opt_len 6
#define	reg_r_loc_lo_cap_opt_lsb 0
#define xd_p_reg_p_cpllc_vld	(*(volatile byte xdata *) 0xEE80)
#define    p_reg_p_cpllc_vld	0xEE80 
#define	reg_p_cpllc_vld_pos 0
#define	reg_p_cpllc_vld_len 1
#define	reg_p_cpllc_vld_lsb 0
#define xd_p_reg_p_cpllc_rst	(*(volatile byte xdata *) 0xEE81)
#define    p_reg_p_cpllc_rst	0xEE81 
#define	reg_p_cpllc_rst_pos 0
#define	reg_p_cpllc_rst_len 1
#define	reg_p_cpllc_rst_lsb 0
#define xd_p_reg_p_cpllc_pll_del	(*(volatile byte xdata *) 0xEE82)
#define    p_reg_p_cpllc_pll_del	0xEE82 
#define	reg_p_cpllc_pll_del_pos 0
#define	reg_p_cpllc_pll_del_len 8
#define	reg_p_cpllc_pll_del_lsb 0
#define xd_p_reg_p_cpllc_cpll_cap_mid	(*(volatile byte xdata *) 0xEE83)
#define    p_reg_p_cpllc_cpll_cap_mid	0xEE83 
#define	reg_p_cpllc_cpll_cap_mid_pos 0
#define	reg_p_cpllc_cpll_cap_mid_len 6
#define	reg_p_cpllc_cpll_cap_mid_lsb 0
#define xd_p_reg_p_cpllc_cpll_cap_step_log2	(*(volatile byte xdata *) 0xEE84)
#define    p_reg_p_cpllc_cpll_cap_step_log2	0xEE84 
#define	reg_p_cpllc_cpll_cap_step_log2_pos 0
#define	reg_p_cpllc_cpll_cap_step_log2_len 4
#define	reg_p_cpllc_cpll_cap_step_log2_lsb 0
#define xd_p_reg_p_cpllc_ceil	(*(volatile byte xdata *) 0xEE85)
#define    p_reg_p_cpllc_ceil	0xEE85 
#define	reg_p_cpllc_ceil_pos 0
#define	reg_p_cpllc_ceil_len 1
#define	reg_p_cpllc_ceil_lsb 0
#define xd_r_reg_r_cpllc_fail	(*(volatile byte xdata *) 0xEE86)
#define    r_reg_r_cpllc_fail	0xEE86 
#define	reg_r_cpllc_fail_pos 0
#define	reg_r_cpllc_fail_len 1
#define	reg_r_cpllc_fail_lsb 0
#define xd_r_reg_r_cpllc_error_type	(*(volatile byte xdata *) 0xEE87)
#define    r_reg_r_cpllc_error_type	0xEE87 
#define	reg_r_cpllc_error_type_pos 0
#define	reg_r_cpllc_error_type_len 1
#define	reg_r_cpllc_error_type_lsb 0
#define xd_r_reg_r_cpllc_cpll_cap_opt	(*(volatile byte xdata *) 0xEE88)
#define    r_reg_r_cpllc_cpll_cap_opt	0xEE88 
#define	reg_r_cpllc_cpll_cap_opt_pos 0
#define	reg_r_cpllc_cpll_cap_opt_len 6
#define	reg_r_cpllc_cpll_cap_opt_lsb 0
#define xd_p_reg_p_rcc_vld	(*(volatile byte xdata *) 0xEEC0)
#define    p_reg_p_rcc_vld	0xEEC0 
#define	reg_p_rcc_vld_pos 0
#define	reg_p_rcc_vld_len 1
#define	reg_p_rcc_vld_lsb 0
#define xd_p_reg_p_rcc_rst	(*(volatile byte xdata *) 0xEEC1)
#define    p_reg_p_rcc_rst	0xEEC1 
#define	reg_p_rcc_rst_pos 0
#define	reg_p_rcc_rst_len 1
#define	reg_p_rcc_rst_lsb 0
#define xd_p_reg_p_rcc_lpf_cap_del	(*(volatile byte xdata *) 0xEEC2)
#define    p_reg_p_rcc_lpf_cap_del	0xEEC2 
#define	reg_p_rcc_lpf_cap_del_pos 0
#define	reg_p_rcc_lpf_cap_del_len 8
#define	reg_p_rcc_lpf_cap_del_lsb 0
#define xd_p_reg_p_rcc_counter_del	(*(volatile byte xdata *) 0xEEC3)
#define    p_reg_p_rcc_counter_del	0xEEC3 
#define	reg_p_rcc_counter_del_pos 0
#define	reg_p_rcc_counter_del_len 8
#define	reg_p_rcc_counter_del_lsb 0
#define xd_p_reg_p_rcc_ntnom1200_5_7_0	(*(volatile byte xdata *) 0xEEC4)
#define    p_reg_p_rcc_ntnom1200_5_7_0	0xEEC4 
#define	reg_p_rcc_ntnom1200_5_7_0_pos 0
#define	reg_p_rcc_ntnom1200_5_7_0_len 8
#define	reg_p_rcc_ntnom1200_5_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom1200_5_9_8	(*(volatile byte xdata *) 0xEEC5)
#define    p_reg_p_rcc_ntnom1200_5_9_8	0xEEC5 
#define	reg_p_rcc_ntnom1200_5_9_8_pos 0
#define	reg_p_rcc_ntnom1200_5_9_8_len 2
#define	reg_p_rcc_ntnom1200_5_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom1200_6_7_0	(*(volatile byte xdata *) 0xEEC6)
#define    p_reg_p_rcc_ntnom1200_6_7_0	0xEEC6 
#define	reg_p_rcc_ntnom1200_6_7_0_pos 0
#define	reg_p_rcc_ntnom1200_6_7_0_len 8
#define	reg_p_rcc_ntnom1200_6_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom1200_6_9_8	(*(volatile byte xdata *) 0xEEC7)
#define    p_reg_p_rcc_ntnom1200_6_9_8	0xEEC7 
#define	reg_p_rcc_ntnom1200_6_9_8_pos 0
#define	reg_p_rcc_ntnom1200_6_9_8_len 2
#define	reg_p_rcc_ntnom1200_6_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom1200_7_7_0	(*(volatile byte xdata *) 0xEEC8)
#define    p_reg_p_rcc_ntnom1200_7_7_0	0xEEC8 
#define	reg_p_rcc_ntnom1200_7_7_0_pos 0
#define	reg_p_rcc_ntnom1200_7_7_0_len 8
#define	reg_p_rcc_ntnom1200_7_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom1200_7_9_8	(*(volatile byte xdata *) 0xEEC9)
#define    p_reg_p_rcc_ntnom1200_7_9_8	0xEEC9 
#define	reg_p_rcc_ntnom1200_7_9_8_pos 0
#define	reg_p_rcc_ntnom1200_7_9_8_len 2
#define	reg_p_rcc_ntnom1200_7_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom1200_8_7_0	(*(volatile byte xdata *) 0xEECA)
#define    p_reg_p_rcc_ntnom1200_8_7_0	0xEECA 
#define	reg_p_rcc_ntnom1200_8_7_0_pos 0
#define	reg_p_rcc_ntnom1200_8_7_0_len 8
#define	reg_p_rcc_ntnom1200_8_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom1200_8_9_8	(*(volatile byte xdata *) 0xEECB)
#define    p_reg_p_rcc_ntnom1200_8_9_8	0xEECB 
#define	reg_p_rcc_ntnom1200_8_9_8_pos 0
#define	reg_p_rcc_ntnom1200_8_9_8_len 2
#define	reg_p_rcc_ntnom1200_8_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom2048_5_7_0	(*(volatile byte xdata *) 0xEECC)
#define    p_reg_p_rcc_ntnom2048_5_7_0	0xEECC 
#define	reg_p_rcc_ntnom2048_5_7_0_pos 0
#define	reg_p_rcc_ntnom2048_5_7_0_len 8
#define	reg_p_rcc_ntnom2048_5_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom2048_5_9_8	(*(volatile byte xdata *) 0xEECD)
#define    p_reg_p_rcc_ntnom2048_5_9_8	0xEECD 
#define	reg_p_rcc_ntnom2048_5_9_8_pos 0
#define	reg_p_rcc_ntnom2048_5_9_8_len 2
#define	reg_p_rcc_ntnom2048_5_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom2048_6_7_0	(*(volatile byte xdata *) 0xEECE)
#define    p_reg_p_rcc_ntnom2048_6_7_0	0xEECE 
#define	reg_p_rcc_ntnom2048_6_7_0_pos 0
#define	reg_p_rcc_ntnom2048_6_7_0_len 8
#define	reg_p_rcc_ntnom2048_6_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom2048_6_9_8	(*(volatile byte xdata *) 0xEECF)
#define    p_reg_p_rcc_ntnom2048_6_9_8	0xEECF 
#define	reg_p_rcc_ntnom2048_6_9_8_pos 0
#define	reg_p_rcc_ntnom2048_6_9_8_len 2
#define	reg_p_rcc_ntnom2048_6_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom2048_7_7_0	(*(volatile byte xdata *) 0xEED0)
#define    p_reg_p_rcc_ntnom2048_7_7_0	0xEED0 
#define	reg_p_rcc_ntnom2048_7_7_0_pos 0
#define	reg_p_rcc_ntnom2048_7_7_0_len 8
#define	reg_p_rcc_ntnom2048_7_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom2048_7_9_8	(*(volatile byte xdata *) 0xEED1)
#define    p_reg_p_rcc_ntnom2048_7_9_8	0xEED1 
#define	reg_p_rcc_ntnom2048_7_9_8_pos 0
#define	reg_p_rcc_ntnom2048_7_9_8_len 2
#define	reg_p_rcc_ntnom2048_7_9_8_lsb 8
#define xd_p_reg_p_rcc_ntnom2048_8_7_0	(*(volatile byte xdata *) 0xEED2)
#define    p_reg_p_rcc_ntnom2048_8_7_0	0xEED2 
#define	reg_p_rcc_ntnom2048_8_7_0_pos 0
#define	reg_p_rcc_ntnom2048_8_7_0_len 8
#define	reg_p_rcc_ntnom2048_8_7_0_lsb 0
#define xd_p_reg_p_rcc_ntnom2048_8_9_8	(*(volatile byte xdata *) 0xEED3)
#define    p_reg_p_rcc_ntnom2048_8_9_8	0xEED3 
#define	reg_p_rcc_ntnom2048_8_9_8_pos 0
#define	reg_p_rcc_ntnom2048_8_9_8_len 2
#define	reg_p_rcc_ntnom2048_8_9_8_lsb 8
#define xd_p_reg_p_rcc_lpf_cap_force_en	(*(volatile byte xdata *) 0xEED4)
#define    p_reg_p_rcc_lpf_cap_force_en	0xEED4 
#define	reg_p_rcc_lpf_cap_force_en_pos 0
#define	reg_p_rcc_lpf_cap_force_en_len 1
#define	reg_p_rcc_lpf_cap_force_en_lsb 0
#define xd_p_reg_p_rcc_lpf_cap_force_5	(*(volatile byte xdata *) 0xEED5)
#define    p_reg_p_rcc_lpf_cap_force_5	0xEED5 
#define	reg_p_rcc_lpf_cap_force_5_pos 0
#define	reg_p_rcc_lpf_cap_force_5_len 5
#define	reg_p_rcc_lpf_cap_force_5_lsb 0
#define xd_p_reg_p_rcc_lpf_cap_force_6	(*(volatile byte xdata *) 0xEED6)
