liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define    p_reg_p_rcc_lpf_cap_force_6	0xEED6 
#define	reg_p_rcc_lpf_cap_force_6_pos 0
#define	reg_p_rcc_lpf_cap_force_6_len 5
#define	reg_p_rcc_lpf_cap_force_6_lsb 0
#define xd_p_reg_p_rcc_lpf_cap_force_7	(*(volatile byte xdata *) 0xEED7)
#define    p_reg_p_rcc_lpf_cap_force_7	0xEED7 
#define	reg_p_rcc_lpf_cap_force_7_pos 0
#define	reg_p_rcc_lpf_cap_force_7_len 5
#define	reg_p_rcc_lpf_cap_force_7_lsb 0
#define xd_p_reg_p_rcc_lpf_cap_force_8	(*(volatile byte xdata *) 0xEED8)
#define    p_reg_p_rcc_lpf_cap_force_8	0xEED8 
#define	reg_p_rcc_lpf_cap_force_8_pos 0
#define	reg_p_rcc_lpf_cap_force_8_len 5
#define	reg_p_rcc_lpf_cap_force_8_lsb 0
#define xd_r_reg_r_rcc_lpf_cap_5	(*(volatile byte xdata *) 0xEED9)
#define    r_reg_r_rcc_lpf_cap_5	0xEED9 
#define	reg_r_rcc_lpf_cap_5_pos 0
#define	reg_r_rcc_lpf_cap_5_len 5
#define	reg_r_rcc_lpf_cap_5_lsb 0
#define xd_r_reg_r_rcc_lpf_cap_6	(*(volatile byte xdata *) 0xEEDA)
#define    r_reg_r_rcc_lpf_cap_6	0xEEDA 
#define	reg_r_rcc_lpf_cap_6_pos 0
#define	reg_r_rcc_lpf_cap_6_len 5
#define	reg_r_rcc_lpf_cap_6_lsb 0
#define xd_r_reg_r_rcc_lpf_cap_7	(*(volatile byte xdata *) 0xEEDB)
#define    r_reg_r_rcc_lpf_cap_7	0xEEDB 
#define	reg_r_rcc_lpf_cap_7_pos 0
#define	reg_r_rcc_lpf_cap_7_len 5
#define	reg_r_rcc_lpf_cap_7_lsb 0
#define xd_r_reg_r_rcc_lpf_cap_8	(*(volatile byte xdata *) 0xEEDC)
#define    r_reg_r_rcc_lpf_cap_8	0xEEDC 
#define	reg_r_rcc_lpf_cap_8_pos 0
#define	reg_r_rcc_lpf_cap_8_len 5
#define	reg_r_rcc_lpf_cap_8_lsb 0
#define xd_r_reg_r_rcc_fail	(*(volatile byte xdata *) 0xEEDD)
#define    r_reg_r_rcc_fail	0xEEDD 
#define	reg_r_rcc_fail_pos 0
#define	reg_r_rcc_fail_len 1
#define	reg_r_rcc_fail_lsb 0
#define xd_p_reg_upd_cal_count	(*(volatile byte xdata *) 0xEEDE)
#define    p_reg_upd_cal_count	0xEEDE 
#define	reg_upd_cal_count_pos 0
#define	reg_upd_cal_count_len 1
#define	reg_upd_cal_count_lsb 0
#define xd_p_reg_p_ibset_afa	(*(volatile byte xdata *) 0xEF00)
#define    p_reg_p_ibset_afa	0xEF00 
#define	reg_p_ibset_afa_pos 0
#define	reg_p_ibset_afa_len 2
#define	reg_p_ibset_afa_lsb 0
#define xd_p_reg_p_icpset_afa	(*(volatile byte xdata *) 0xEF01)
#define    p_reg_p_icpset_afa	0xEF01 
#define	reg_p_icpset_afa_pos 0
#define	reg_p_icpset_afa_len 3
#define	reg_p_icpset_afa_lsb 0
#define xd_p_reg_p_lo_cap_afa	(*(volatile byte xdata *) 0xEF02)
#define    p_reg_p_lo_cap_afa	0xEF02 
#define	reg_p_lo_cap_afa_pos 0
#define	reg_p_lo_cap_afa_len 7
#define	reg_p_lo_cap_afa_lsb 0
#define xd_p_reg_p_sw_var_afa	(*(volatile byte xdata *) 0xEF03)
#define    p_reg_p_sw_var_afa	0xEF03 
#define	reg_p_sw_var_afa_pos 0
#define	reg_p_sw_var_afa_len 3
#define	reg_p_sw_var_afa_lsb 0
#define xd_p_reg_p_ibvcoset_afa	(*(volatile byte xdata *) 0xEF04)
#define    p_reg_p_ibvcoset_afa	0xEF04 
#define	reg_p_ibvcoset_afa_pos 0
#define	reg_p_ibvcoset_afa_len 5
#define	reg_p_ibvcoset_afa_lsb 0
#define xd_p_reg_p_rst_afa	(*(volatile byte xdata *) 0xEF05)
#define    p_reg_p_rst_afa	0xEF05 
#define	reg_p_rst_afa_pos 0
#define	reg_p_rst_afa_len 1
#define	reg_p_rst_afa_lsb 0
#define xd_p_reg_p_extvh_l_afa	(*(volatile byte xdata *) 0xEF06)
#define    p_reg_p_extvh_l_afa	0xEF06 
#define	reg_p_extvh_l_afa_pos 0
#define	reg_p_extvh_l_afa_len 1
#define	reg_p_extvh_l_afa_lsb 0
#define xd_p_reg_p_winsel_afa	(*(volatile byte xdata *) 0xEF07)
#define    p_reg_p_winsel_afa	0xEF07 
#define	reg_p_winsel_afa_pos 0
#define	reg_p_winsel_afa_len 1
#define	reg_p_winsel_afa_lsb 0
#define xd_p_reg_p_lock_cycle_afa	(*(volatile byte xdata *) 0xEF08)
#define    p_reg_p_lock_cycle_afa	0xEF08 
#define	reg_p_lock_cycle_afa_pos 0
#define	reg_p_lock_cycle_afa_len 2
#define	reg_p_lock_cycle_afa_lsb 0
#define xd_p_reg_p_vreg_io_afa	(*(volatile byte xdata *) 0xEF09)
#define    p_reg_p_vreg_io_afa	0xEF09 
#define	reg_p_vreg_io_afa_pos 0
#define	reg_p_vreg_io_afa_len 2
#define	reg_p_vreg_io_afa_lsb 0
#define xd_r_reg_r_lo_cap_o_afa	(*(volatile byte xdata *) 0xEF0A)
#define    r_reg_r_lo_cap_o_afa	0xEF0A 
#define	reg_r_lo_cap_o_afa_pos 0
#define	reg_r_lo_cap_o_afa_len 7
#define	reg_r_lo_cap_o_afa_lsb 0
#define xd_r_reg_r_sw_var_o_afa	(*(volatile byte xdata *) 0xEF0B)
#define    r_reg_r_sw_var_o_afa	0xEF0B 
#define	reg_r_sw_var_o_afa_pos 0
#define	reg_r_sw_var_o_afa_len 3
#define	reg_r_sw_var_o_afa_lsb 0
#define xd_r_reg_r_ibvcoset_o_afa	(*(volatile byte xdata *) 0xEF0C)
#define    r_reg_r_ibvcoset_o_afa	0xEF0C 
#define	reg_r_ibvcoset_o_afa_pos 0
#define	reg_r_ibvcoset_o_afa_len 5
#define	reg_r_ibvcoset_o_afa_lsb 0
#define xd_r_reg_r_lockdet_afa	(*(volatile byte xdata *) 0xEF0D)
#define    r_reg_r_lockdet_afa	0xEF0D 
#define	reg_r_lockdet_afa_pos 0
#define	reg_r_lockdet_afa_len 1
#define	reg_r_lockdet_afa_lsb 0
#define xd_p_reg_p_icpset_cal_afa	(*(volatile byte xdata *) 0xEF0E)
#define    p_reg_p_icpset_cal_afa	0xEF0E 
#define	reg_p_icpset_cal_afa_pos 0
#define	reg_p_icpset_cal_afa_len 2
#define	reg_p_icpset_cal_afa_lsb 0
#define xd_p_reg_p_vco_psw_cal_afa	(*(volatile byte xdata *) 0xEF0F)
#define    p_reg_p_vco_psw_cal_afa	0xEF0F 
#define	reg_p_vco_psw_cal_afa_pos 0
#define	reg_p_vco_psw_cal_afa_len 2
#define	reg_p_vco_psw_cal_afa_lsb 0
#define xd_p_reg_p_div_pos_cal_afa	(*(volatile byte xdata *) 0xEF10)
#define    p_reg_p_div_pos_cal_afa	0xEF10 
#define	reg_p_div_pos_cal_afa_pos 0
#define	reg_p_div_pos_cal_afa_len 2
#define	reg_p_div_pos_cal_afa_lsb 0
#define xd_p_reg_p_div_fbk_cal_afa_7_0	(*(volatile byte xdata *) 0xEF11)
#define    p_reg_p_div_fbk_cal_afa_7_0	0xEF11 
#define	reg_p_div_fbk_cal_afa_7_0_pos 0
#define	reg_p_div_fbk_cal_afa_7_0_len 8
#define	reg_p_div_fbk_cal_afa_7_0_lsb 0
#define xd_p_reg_p_div_fbk_cal_afa_10_8	(*(volatile byte xdata *) 0xEF12)
#define    p_reg_p_div_fbk_cal_afa_10_8	0xEF12 
#define	reg_p_div_fbk_cal_afa_10_8_pos 0
#define	reg_p_div_fbk_cal_afa_10_8_len 3
#define	reg_p_div_fbk_cal_afa_10_8_lsb 8
#define xd_r_reg_r_lockdet_cal_afa	(*(volatile byte xdata *) 0xEF13)
#define    r_reg_r_lockdet_cal_afa	0xEF13 
#define	reg_r_lockdet_cal_afa_pos 0
#define	reg_r_lockdet_cal_afa_len 1
#define	reg_r_lockdet_cal_afa_lsb 0
#define xd_p_reg_p_aagc_log_2_acc	(*(volatile byte xdata *) 0xF000)
#define    p_reg_p_aagc_log_2_acc	0xF000 
#define	reg_p_aagc_log_2_acc_pos 0
#define	reg_p_aagc_log_2_acc_len 4
#define	reg_p_aagc_log_2_acc_lsb 0
#define xd_p_reg_p_aagc_signal_level_rdy	(*(volatile byte xdata *) 0xF001)
#define    p_reg_p_aagc_signal_level_rdy	0xF001 
#define	reg_p_aagc_signal_level_rdy_pos 0
#define	reg_p_aagc_signal_level_rdy_len 1
#define	reg_p_aagc_signal_level_rdy_lsb 0
#define xd_r_reg_r_aagc_signal_level_7_0	(*(volatile byte xdata *) 0xF002)
#define    r_reg_r_aagc_signal_level_7_0	0xF002 
#define	reg_r_aagc_signal_level_7_0_pos 0
#define	reg_r_aagc_signal_level_7_0_len 8
#define	reg_r_aagc_signal_level_7_0_lsb 0
#define xd_r_reg_r_aagc_signal_level_9_8	(*(volatile byte xdata *) 0xF003)
#define    r_reg_r_aagc_signal_level_9_8	0xF003 
#define	reg_r_aagc_signal_level_9_8_pos 0
#define	reg_r_aagc_signal_level_9_8_len 2
#define	reg_r_aagc_signal_level_9_8_lsb 8
#define xd_p_reg_aagc_int_en	(*(volatile byte xdata *) 0xF008)
#define    p_reg_aagc_int_en	0xF008 
#define	reg_aagc_int_en_pos 0
#define	reg_aagc_int_en_len 1
#define	reg_aagc_int_en_lsb 0
#define xd_p_reg_aagc_lock_change_flag	(*(volatile byte xdata *) 0xF009)
#define    p_reg_aagc_lock_change_flag	0xF009 
#define	reg_aagc_lock_change_flag_pos 0
#define	reg_aagc_lock_change_flag_len 1
#define	reg_aagc_lock_change_flag_lsb 0
#define xd_p_reg_aagc_adc_out_desired_s_7_0	(*(volatile byte xdata *) 0xF01F)
#define    p_reg_aagc_adc_out_desired_s_7_0	0xF01F 
#define	reg_aagc_adc_out_desired_s_7_0_pos 0
#define	reg_aagc_adc_out_desired_s_7_0_len 8
#define	reg_aagc_adc_out_desired_s_7_0_lsb 0
#define xd_p_reg_aagc_adc_out_desired_s_8	(*(volatile byte xdata *) 0xF020)
#define    p_reg_aagc_adc_out_desired_s_8	0xF020 
#define	reg_aagc_adc_out_desired_s_8_pos 0
#define	reg_aagc_adc_out_desired_s_8_len 1
#define	reg_aagc_adc_out_desired_s_8_lsb 8
#define xd_p_reg_aagc_adc_out_desired_m_7_0	(*(volatile byte xdata *) 0xF029)
#define    p_reg_aagc_adc_out_desired_m_7_0	0xF029 
#define	reg_aagc_adc_out_desired_m_7_0_pos 0
#define	reg_aagc_adc_out_desired_m_7_0_len 8
#define	reg_aagc_adc_out_desired_m_7_0_lsb 0
#define xd_p_reg_aagc_adc_out_desired_m_8	(*(volatile byte xdata *) 0xF02A)
#define    p_reg_aagc_adc_out_desired_m_8	0xF02A 
#define	reg_aagc_adc_out_desired_m_8_pos 0
#define	reg_aagc_adc_out_desired_m_8_len 1
#define	reg_aagc_adc_out_desired_m_8_lsb 8
#define xd_p_reg_aagc_mobile_sel	(*(volatile byte xdata *) 0xF02B)
#define    p_reg_aagc_mobile_sel	0xF02B 
#define	reg_aagc_mobile_sel_pos 0
#define	reg_aagc_mobile_sel_len 1
#define	reg_aagc_mobile_sel_lsb 0
#define xd_p_reg_p_aagc_adc_in_sel	(*(volatile byte xdata *) 0xF056)
#define    p_reg_p_aagc_adc_in_sel	0xF056 
#define	reg_p_aagc_adc_in_sel_pos 0
#define	reg_p_aagc_adc_in_sel_len 1
#define	reg_p_aagc_adc_in_sel_lsb 0
#define xd_r_reg_aagc_current_desired_level_7_0	(*(volatile byte xdata *) 0xF062)
#define    r_reg_aagc_current_desired_level_7_0	0xF062 
#define	reg_aagc_current_desired_level_7_0_pos 0
#define	reg_aagc_current_desired_level_7_0_len 8
#define	reg_aagc_current_desired_level_7_0_lsb 0
#define xd_r_reg_aagc_current_desired_level_8	(*(volatile byte xdata *) 0xF063)
#define    r_reg_aagc_current_desired_level_8	0xF063 
#define	reg_aagc_current_desired_level_8_pos 0
#define	reg_aagc_current_desired_level_8_len 1
#define	reg_aagc_current_desired_level_8_lsb 8
#define xd_p_reg_tinr_fifo_size	(*(volatile byte xdata *) 0xF064)
#define    p_reg_tinr_fifo_size	0xF064 
#define	reg_tinr_fifo_size_pos 0
#define	reg_tinr_fifo_size_len 5
#define	reg_tinr_fifo_size_lsb 0
#define xd_p_reg_tinr_saturation_th_7_0	(*(volatile byte xdata *) 0xF065)
#define    p_reg_tinr_saturation_th_7_0	0xF065 
#define	reg_tinr_saturation_th_7_0_pos 0
#define	reg_tinr_saturation_th_7_0_len 8
#define	reg_tinr_saturation_th_7_0_lsb 0
#define xd_p_reg_tinr_saturation_th_9_8	(*(volatile byte xdata *) 0xF066)
#define    p_reg_tinr_saturation_th_9_8	0xF066 
#define	reg_tinr_saturation_th_9_8_pos 0
#define	reg_tinr_saturation_th_9_8_len 2
#define	reg_tinr_saturation_th_9_8_lsb 8
#define xd_p_reg_tinr_saturation_cnt_th	(*(volatile byte xdata *) 0xF067)
#define    p_reg_tinr_saturation_cnt_th	0xF067 
#define	reg_tinr_saturation_cnt_th_pos 0
#define	reg_tinr_saturation_cnt_th_len 4
#define	reg_tinr_saturation_cnt_th_lsb 0
#define xd_r_td_ste_beacon_adv	(*(volatile byte xdata *) 0xF068)
#define    r_td_ste_beacon_adv	0xF068 
#define	td_ste_beacon_adv_pos 0
#define	td_ste_beacon_adv_len 1
#define	td_ste_beacon_adv_lsb 0
#define xd_r_reg_tinr_counter_6_0	(*(volatile byte xdata *) 0xF068)
#define    r_reg_tinr_counter_6_0	0xF068 
#define	reg_tinr_counter_6_0_pos 1
#define	reg_tinr_counter_6_0_len 7
#define	reg_tinr_counter_6_0_lsb 0
#define xd_r_reg_tinr_counter_14_7	(*(volatile byte xdata *) 0xF069)
#define    r_reg_tinr_counter_14_7	0xF069 
#define	reg_tinr_counter_14_7_pos 0
#define	reg_tinr_counter_14_7_len 8
#define	reg_tinr_counter_14_7_lsb 7
#define xd_p_reg_tinr_counter_rst	(*(volatile byte xdata *) 0xF06C)
#define    p_reg_tinr_counter_rst	0xF06C 
#define	reg_tinr_counter_rst_pos 0
#define	reg_tinr_counter_rst_len 1
#define	reg_tinr_counter_rst_lsb 0
#define xd_p_reg_tinr_ins_th_7_0	(*(volatile byte xdata *) 0xF06F)
#define    p_reg_tinr_ins_th_7_0	0xF06F 
#define	reg_tinr_ins_th_7_0_pos 0
#define	reg_tinr_ins_th_7_0_len 8
#define	reg_tinr_ins_th_7_0_lsb 0
#define xd_p_reg_tinr_ins_th_9_8	(*(volatile byte xdata *) 0xF070)
#define    p_reg_tinr_ins_th_9_8	0xF070 
#define	reg_tinr_ins_th_9_8_pos 0
#define	reg_tinr_ins_th_9_8_len 2
#define	reg_tinr_ins_th_9_8_lsb 8
#define xd_p_reg_tinr_ins_en	(*(volatile byte xdata *) 0xF071)
#define    p_reg_tinr_ins_en	0xF071 
#define	reg_tinr_ins_en_pos 0
#define	reg_tinr_ins_en_len 1
#define	reg_tinr_ins_en_lsb 0
#define xd_p_reg_tinr_ins_size	(*(volatile byte xdata *) 0xF072)
#define    p_reg_tinr_ins_size	0xF072 
#define	reg_tinr_ins_size_pos 0
#define	reg_tinr_ins_size_len 4
#define	reg_tinr_ins_size_lsb 0
#define xd_p_reg_tinr_ins_hnum	(*(volatile byte xdata *) 0xF073)
#define    p_reg_tinr_ins_hnum	0xF073 
#define	reg_tinr_ins_hnum_pos 0
#define	reg_tinr_ins_hnum_len 4
#define	reg_tinr_ins_hnum_lsb 0
#define xd_r_reg_tinr_ins_hcnt_7_0	(*(volatile byte xdata *) 0xF074)
#define    r_reg_tinr_ins_hcnt_7_0	0xF074 
#define	reg_tinr_ins_hcnt_7_0_pos 0
#define	reg_tinr_ins_hcnt_7_0_len 8
#define	reg_tinr_ins_hcnt_7_0_lsb 0
#define xd_r_reg_tinr_ins_hcnt_15_8	(*(volatile byte xdata *) 0xF075)
#define    r_reg_tinr_ins_hcnt_15_8	0xF075 
#define	reg_tinr_ins_hcnt_15_8_pos 0
#define	reg_tinr_ins_hcnt_15_8_len 8
#define	reg_tinr_ins_hcnt_15_8_lsb 8
#define xd_p_reg_tinr_in_conj	(*(volatile byte xdata *) 0xF076)
#define    p_reg_tinr_in_conj	0xF076 
#define	reg_tinr_in_conj_pos 0
#define	reg_tinr_in_conj_len 1
#define	reg_tinr_in_conj_lsb 0
#define xd_p_reg_tinr_in_zero_if	(*(volatile byte xdata *) 0xF077)
#define    p_reg_tinr_in_zero_if	0xF077 
#define	reg_tinr_in_zero_if_pos 0
#define	reg_tinr_in_zero_if_len 2
#define	reg_tinr_in_zero_if_lsb 0
#define xd_p_reg_tinr_in_shift	(*(volatile byte xdata *) 0xF078)
#define    p_reg_tinr_in_shift	0xF078 
#define	reg_tinr_in_shift_pos 0
#define	reg_tinr_in_shift_len 1
#define	reg_tinr_in_shift_lsb 0
#define xd_p_reg_tinr_in_conj_sat_counter_rst	(*(volatile byte xdata *) 0xF079)
#define    p_reg_tinr_in_conj_sat_counter_rst	0xF079 
#define	reg_tinr_in_conj_sat_counter_rst_pos 0
#define	reg_tinr_in_conj_sat_counter_rst_len 1
#define	reg_tinr_in_conj_sat_counter_rst_lsb 0
#define xd_r_reg_tinr_in_conj_sat_counter_7_0	(*(volatile byte xdata *) 0xF07A)
#define    r_reg_tinr_in_conj_sat_counter_7_0	0xF07A 
#define	reg_tinr_in_conj_sat_counter_7_0_pos 0
#define	reg_tinr_in_conj_sat_counter_7_0_len 8
#define	reg_tinr_in_conj_sat_counter_7_0_lsb 0
#define xd_r_reg_tinr_in_conj_sat_counter_14_8	(*(volatile byte xdata *) 0xF07B)
#define    r_reg_tinr_in_conj_sat_counter_14_8	0xF07B 
#define	reg_tinr_in_conj_sat_counter_14_8_pos 0
#define	reg_tinr_in_conj_sat_counter_14_8_len 7
#define	reg_tinr_in_conj_sat_counter_14_8_lsb 8
#define xd_p_reg_p_antif_en	(*(volatile byte xdata *) 0xF07C)
#define    p_reg_p_antif_en	0xF07C 
#define	reg_p_antif_en_pos 0
#define	reg_p_antif_en_len 1
#define	reg_p_antif_en_lsb 0
#define xd_p_reg_p_antif_rst	(*(volatile byte xdata *) 0xF07D)
#define    p_reg_p_antif_rst	0xF07D 
#define	reg_p_antif_rst_pos 0
#define	reg_p_antif_rst_len 1
#define	reg_p_antif_rst_lsb 0
#define xd_p_reg_p_antif_byp	(*(volatile byte xdata *) 0xF07E)
#define    p_reg_p_antif_byp	0xF07E 
#define	reg_p_antif_byp_pos 0
#define	reg_p_antif_byp_len 1
#define	reg_p_antif_byp_lsb 0
#define xd_p_reg_p_antif_mode	(*(volatile byte xdata *) 0xF07F)
#define    p_reg_p_antif_mode	0xF07F 
#define	reg_p_antif_mode_pos 0
#define	reg_p_antif_mode_len 1
#define	reg_p_antif_mode_lsb 0
#define xd_p_reg_p_ds_byp	(*(volatile byte xdata *) 0xF080)
#define    p_reg_p_ds_byp	0xF080 
#define	reg_p_ds_byp_pos 0
#define	reg_p_ds_byp_len 1
#define	reg_p_ds_byp_lsb 0
#define xd_p_reg_p_antif_dagc5_mode	(*(volatile byte xdata *) 0xF081)
#define    p_reg_p_antif_dagc5_mode	0xF081 
#define	reg_p_antif_dagc5_mode_pos 0
#define	reg_p_antif_dagc5_mode_len 2
#define	reg_p_antif_dagc5_mode_lsb 0
#define xd_p_reg_p_antif_dagc5_desired_level_7_0	(*(volatile byte xdata *) 0xF082)
#define    p_reg_p_antif_dagc5_desired_level_7_0	0xF082 
#define	reg_p_antif_dagc5_desired_level_7_0_pos 0
#define	reg_p_antif_dagc5_desired_level_7_0_len 8
#define	reg_p_antif_dagc5_desired_level_7_0_lsb 0
#define xd_p_reg_p_antif_dagc5_desired_level_8	(*(volatile byte xdata *) 0xF083)
#define    p_reg_p_antif_dagc5_desired_level_8	0xF083 
#define	reg_p_antif_dagc5_desired_level_8_pos 0
#define	reg_p_antif_dagc5_desired_level_8_len 1
#define	reg_p_antif_dagc5_desired_level_8_lsb 8
#define xd_p_reg_p_antif_dagc5_apply_delay	(*(volatile byte xdata *) 0xF084)
#define    p_reg_p_antif_dagc5_apply_delay	0xF084 
#define	reg_p_antif_dagc5_apply_delay_pos 0
#define	reg_p_antif_dagc5_apply_delay_len 7
#define	reg_p_antif_dagc5_apply_delay_lsb 0
#define xd_p_reg_p_antif_dagc5_fixed_gain_7_0	(*(volatile byte xdata *) 0xF085)
#define    p_reg_p_antif_dagc5_fixed_gain_7_0	0xF085 
#define	reg_p_antif_dagc5_fixed_gain_7_0_pos 0
#define	reg_p_antif_dagc5_fixed_gain_7_0_len 8
#define	reg_p_antif_dagc5_fixed_gain_7_0_lsb 0
#define xd_p_reg_p_antif_dagc5_fixed_gain_11_8	(*(volatile byte xdata *) 0xF086)
#define    p_reg_p_antif_dagc5_fixed_gain_11_8	0xF086 
#define	reg_p_antif_dagc5_fixed_gain_11_8_pos 0
#define	reg_p_antif_dagc5_fixed_gain_11_8_len 4
#define	reg_p_antif_dagc5_fixed_gain_11_8_lsb 8
#define xd_p_reg_p_antif_dagc5_use_despow	(*(volatile byte xdata *) 0xF087)
#define    p_reg_p_antif_dagc5_use_despow	0xF087 
#define	reg_p_antif_dagc5_use_despow_pos 0
#define	reg_p_antif_dagc5_use_despow_len 1
#define	reg_p_antif_dagc5_use_despow_lsb 0
#define xd_p_reg_p_antif_dagc5_log_2_accumulate_num	(*(volatile byte xdata *) 0xF088)
#define    p_reg_p_antif_dagc5_log_2_accumulate_num	0xF088 
#define	reg_p_antif_dagc5_log_2_accumulate_num_pos 0
#define	reg_p_antif_dagc5_log_2_accumulate_num_len 5
#define	reg_p_antif_dagc5_log_2_accumulate_num_lsb 0
#define xd_p_reg_p_antif_dagc5_in_sat_cnt_7_0	(*(volatile byte xdata *) 0xF089)
#define    p_reg_p_antif_dagc5_in_sat_cnt_7_0	0xF089 
#define	reg_p_antif_dagc5_in_sat_cnt_7_0_pos 0
#define	reg_p_antif_dagc5_in_sat_cnt_7_0_len 8
#define	reg_p_antif_dagc5_in_sat_cnt_7_0_lsb 0
#define xd_p_reg_p_antif_dagc5_in_sat_cnt_15_8	(*(volatile byte xdata *) 0xF08A)
#define    p_reg_p_antif_dagc5_in_sat_cnt_15_8	0xF08A 
#define	reg_p_antif_dagc5_in_sat_cnt_15_8_pos 0
#define	reg_p_antif_dagc5_in_sat_cnt_15_8_len 8
#define	reg_p_antif_dagc5_in_sat_cnt_15_8_lsb 8
#define xd_p_reg_p_antif_dagc5_in_sat_cnt_23_16	(*(volatile byte xdata *) 0xF08B)
#define    p_reg_p_antif_dagc5_in_sat_cnt_23_16	0xF08B 
#define	reg_p_antif_dagc5_in_sat_cnt_23_16_pos 0
#define	reg_p_antif_dagc5_in_sat_cnt_23_16_len 8
#define	reg_p_antif_dagc5_in_sat_cnt_23_16_lsb 16
#define xd_p_reg_p_antif_dagc5_in_sat_cnt_31_24	(*(volatile byte xdata *) 0xF08C)
#define    p_reg_p_antif_dagc5_in_sat_cnt_31_24	0xF08C 
#define	reg_p_antif_dagc5_in_sat_cnt_31_24_pos 0
#define	reg_p_antif_dagc5_in_sat_cnt_31_24_len 8
#define	reg_p_antif_dagc5_in_sat_cnt_31_24_lsb 24
#define xd_p_reg_p_antif_dagc5_out_sat_cnt_7_0	(*(volatile byte xdata *) 0xF08D)
#define    p_reg_p_antif_dagc5_out_sat_cnt_7_0	0xF08D 
#define	reg_p_antif_dagc5_out_sat_cnt_7_0_pos 0
#define	reg_p_antif_dagc5_out_sat_cnt_7_0_len 8
#define	reg_p_antif_dagc5_out_sat_cnt_7_0_lsb 0
#define xd_p_reg_p_antif_dagc5_out_sat_cnt_15_8	(*(volatile byte xdata *) 0xF08E)
#define    p_reg_p_antif_dagc5_out_sat_cnt_15_8	0xF08E 
#define	reg_p_antif_dagc5_out_sat_cnt_15_8_pos 0
#define	reg_p_antif_dagc5_out_sat_cnt_15_8_len 8
#define	reg_p_antif_dagc5_out_sat_cnt_15_8_lsb 8
#define xd_p_reg_p_antif_dagc5_out_sat_cnt_23_16	(*(volatile byte xdata *) 0xF08F)
#define    p_reg_p_antif_dagc5_out_sat_cnt_23_16	0xF08F 
#define	reg_p_antif_dagc5_out_sat_cnt_23_16_pos 0
#define	reg_p_antif_dagc5_out_sat_cnt_23_16_len 8
#define	reg_p_antif_dagc5_out_sat_cnt_23_16_lsb 16
#define xd_p_reg_p_antif_dagc5_out_sat_cnt_31_24	(*(volatile byte xdata *) 0xF090)
#define    p_reg_p_antif_dagc5_out_sat_cnt_31_24	0xF090 
#define	reg_p_antif_dagc5_out_sat_cnt_31_24_pos 0
#define	reg_p_antif_dagc5_out_sat_cnt_31_24_len 8
#define	reg_p_antif_dagc5_out_sat_cnt_31_24_lsb 24
#define xd_p_reg_p_antif_dagc5_rst	(*(volatile byte xdata *) 0xF091)
#define    p_reg_p_antif_dagc5_rst	0xF091 
#define	reg_p_antif_dagc5_rst_pos 0
#define	reg_p_antif_dagc5_rst_len 1
#define	reg_p_antif_dagc5_rst_lsb 0
#define xd_p_reg_p_antif_dagc5_en	(*(volatile byte xdata *) 0xF092)
#define    p_reg_p_antif_dagc5_en	0xF092 
#define	reg_p_antif_dagc5_en_pos 0
#define	reg_p_antif_dagc5_en_len 1
#define	reg_p_antif_dagc5_en_lsb 0
#define xd_p_reg_p_antif_sc_mode	(*(volatile byte xdata *) 0xF093)
#define    p_reg_p_antif_sc_mode	0xF093 
#define	reg_p_antif_sc_mode_pos 0
#define	reg_p_antif_sc_mode_len 4
#define	reg_p_antif_sc_mode_lsb 0
#define xd_p_reg_p_antif_dagc5_done	(*(volatile byte xdata *) 0xF094)
#define    p_reg_p_antif_dagc5_done	0xF094 
#define	reg_p_antif_dagc5_done_pos 0
#define	reg_p_antif_dagc5_done_len 1
#define	reg_p_antif_dagc5_done_lsb 0
#define xd_r_reg_r_antif_sc_7_0	(*(volatile byte xdata *) 0xF095)
#define    r_reg_r_antif_sc_7_0	0xF095 
#define	reg_r_antif_sc_7_0_pos 0
#define	reg_r_antif_sc_7_0_len 8
#define	reg_r_antif_sc_7_0_lsb 0
#define xd_r_reg_r_antif_sc_15_8	(*(volatile byte xdata *) 0xF096)
#define    r_reg_r_antif_sc_15_8	0xF096 
#define	reg_r_antif_sc_15_8_pos 0
#define	reg_r_antif_sc_15_8_len 8
#define	reg_r_antif_sc_15_8_lsb 8
#define xd_r_reg_r_antif_dagc5_multiplier_7_0	(*(volatile byte xdata *) 0xF097)
#define    r_reg_r_antif_dagc5_multiplier_7_0	0xF097 
#define	reg_r_antif_dagc5_multiplier_7_0_pos 0
#define	reg_r_antif_dagc5_multiplier_7_0_len 8
#define	reg_r_antif_dagc5_multiplier_7_0_lsb 0
#define xd_r_reg_r_antif_dagc5_multiplier_15_8	(*(volatile byte xdata *) 0xF098)
#define    r_reg_r_antif_dagc5_multiplier_15_8	0xF098 
#define	reg_r_antif_dagc5_multiplier_15_8_pos 0
#define	reg_r_antif_dagc5_multiplier_15_8_len 8
#define	reg_r_antif_dagc5_multiplier_15_8_lsb 8
#define xd_r_reg_r_antif_dagc5_right_shift_bits	(*(volatile byte xdata *) 0xF099)
#define    r_reg_r_antif_dagc5_right_shift_bits	0xF099 
#define	reg_r_antif_dagc5_right_shift_bits_pos 0
#define	reg_r_antif_dagc5_right_shift_bits_len 4
#define	reg_r_antif_dagc5_right_shift_bits_lsb 0
#define xd_p_reg_p_antif_dagc5_bypass_scale_ctl	(*(volatile byte xdata *) 0xF09A)
#define    p_reg_p_antif_dagc5_bypass_scale_ctl	0xF09A 
#define	reg_p_antif_dagc5_bypass_scale_ctl_pos 0
#define	reg_p_antif_dagc5_bypass_scale_ctl_len 3
#define	reg_p_antif_dagc5_bypass_scale_ctl_lsb 0
#define xd_p_reg_mccid_ccirunno_7_0	(*(volatile byte xdata *) 0xF09B)
#define    p_reg_mccid_ccirunno_7_0	0xF09B 
#define	reg_mccid_ccirunno_7_0_pos 0
#define	reg_mccid_ccirunno_7_0_len 8
#define	reg_mccid_ccirunno_7_0_lsb 0
#define xd_p_reg_mccid_ccirunno_8	(*(volatile byte xdata *) 0xF09C)
#define    p_reg_mccid_ccirunno_8	0xF09C 
#define	reg_mccid_ccirunno_8_pos 0
#define	reg_mccid_ccirunno_8_len 1
#define	reg_mccid_ccirunno_8_lsb 8
#define xd_p_reg_mccid_acirunno_7_0	(*(volatile byte xdata *) 0xF09D)
#define    p_reg_mccid_acirunno_7_0	0xF09D 
#define	reg_mccid_acirunno_7_0_pos 0
#define	reg_mccid_acirunno_7_0_len 8
#define	reg_mccid_acirunno_7_0_lsb 0
#define xd_p_reg_mccid_acirunno_8	(*(volatile byte xdata *) 0xF09E)
#define    p_reg_mccid_acirunno_8	0xF09E 
#define	reg_mccid_acirunno_8_pos 0
#define	reg_mccid_acirunno_8_len 1
#define	reg_mccid_acirunno_8_lsb 8
#define xd_p_reg_mccid_maxtonenearrange_7_0	(*(volatile byte xdata *) 0xF09F)
#define    p_reg_mccid_maxtonenearrange_7_0	0xF09F 
#define	reg_mccid_maxtonenearrange_7_0_pos 0
#define	reg_mccid_maxtonenearrange_7_0_len 8
#define	reg_mccid_maxtonenearrange_7_0_lsb 0
#define xd_p_reg_mccid_maxtonenearrange_8	(*(volatile byte xdata *) 0xF0A0)
#define    p_reg_mccid_maxtonenearrange_8	0xF0A0 
#define	reg_mccid_maxtonenearrange_8_pos 0
#define	reg_mccid_maxtonenearrange_8_len 1
#define	reg_mccid_maxtonenearrange_8_lsb 8
#define xd_r_reg_mccid_maxacipower_7_0	(*(volatile byte xdata *) 0xF0A1)
#define    r_reg_mccid_maxacipower_7_0	0xF0A1 
#define	reg_mccid_maxacipower_7_0_pos 0
#define	reg_mccid_maxacipower_7_0_len 8
#define	reg_mccid_maxacipower_7_0_lsb 0
#define xd_r_reg_mccid_maxacipower_15_8	(*(volatile byte xdata *) 0xF0A2)
#define    r_reg_mccid_maxacipower_15_8	0xF0A2 
#define	reg_mccid_maxacipower_15_8_pos 0
#define	reg_mccid_maxacipower_15_8_len 8
#define	reg_mccid_maxacipower_15_8_lsb 8
#define xd_r_reg_mccid_maxacipower_19_16	(*(volatile byte xdata *) 0xF0A3)
#define    r_reg_mccid_maxacipower_19_16	0xF0A3 
#define	reg_mccid_maxacipower_19_16_pos 0
