liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_mccid_maxacipower_19_16_len 4
#define	reg_mccid_maxacipower_19_16_lsb 16
#define xd_p_reg_p_dcoe_en	(*(volatile byte xdata *) 0xF0D5)
#define    p_reg_p_dcoe_en	0xF0D5 
#define	reg_p_dcoe_en_pos 0
#define	reg_p_dcoe_en_len 1
#define	reg_p_dcoe_en_lsb 0
#define xd_p_reg_p_dcoe_rst	(*(volatile byte xdata *) 0xF0D6)
#define    p_reg_p_dcoe_rst	0xF0D6 
#define	reg_p_dcoe_rst_pos 0
#define	reg_p_dcoe_rst_len 1
#define	reg_p_dcoe_rst_lsb 0
#define xd_p_reg_p_dcoe_clear	(*(volatile byte xdata *) 0xF0D7)
#define    p_reg_p_dcoe_clear	0xF0D7 
#define	reg_p_dcoe_clear_pos 0
#define	reg_p_dcoe_clear_len 1
#define	reg_p_dcoe_clear_lsb 0
#define xd_p_reg_p_dcoe_applyloc_7_0	(*(volatile byte xdata *) 0xF0D8)
#define    p_reg_p_dcoe_applyloc_7_0	0xF0D8 
#define	reg_p_dcoe_applyloc_7_0_pos 0
#define	reg_p_dcoe_applyloc_7_0_len 8
#define	reg_p_dcoe_applyloc_7_0_lsb 0
#define xd_p_reg_p_dcoe_applyloc_12_8	(*(volatile byte xdata *) 0xF0D9)
#define    p_reg_p_dcoe_applyloc_12_8	0xF0D9 
#define	reg_p_dcoe_applyloc_12_8_pos 0
#define	reg_p_dcoe_applyloc_12_8_len 5
#define	reg_p_dcoe_applyloc_12_8_lsb 8
#define xd_p_reg_p_dcoe_accnums	(*(volatile byte xdata *) 0xF0DA)
#define    p_reg_p_dcoe_accnums	0xF0DA 
#define	reg_p_dcoe_accnums_pos 0
#define	reg_p_dcoe_accnums_len 3
#define	reg_p_dcoe_accnums_lsb 0
#define xd_p_reg_p_dcoe_accweightsum_sh	(*(volatile byte xdata *) 0xF0DB)
#define    p_reg_p_dcoe_accweightsum_sh	0xF0DB 
#define	reg_p_dcoe_accweightsum_sh_pos 0
#define	reg_p_dcoe_accweightsum_sh_len 3
#define	reg_p_dcoe_accweightsum_sh_lsb 0
#define xd_p_reg_p_dcoe_accweightcurr	(*(volatile byte xdata *) 0xF0DC)
#define    p_reg_p_dcoe_accweightcurr	0xF0DC 
#define	reg_p_dcoe_accweightcurr_pos 0
#define	reg_p_dcoe_accweightcurr_len 8
#define	reg_p_dcoe_accweightcurr_lsb 0
#define xd_p_reg_dcoe_apply_rd	(*(volatile byte xdata *) 0xF0DF)
#define    p_reg_dcoe_apply_rd	0xF0DF 
#define	reg_dcoe_apply_rd_pos 0
#define	reg_dcoe_apply_rd_len 1
#define	reg_dcoe_apply_rd_lsb 0
#define xd_p_reg_p_dcrm_en	(*(volatile byte xdata *) 0xF0E2)
#define    p_reg_p_dcrm_en	0xF0E2 
#define	reg_p_dcrm_en_pos 0
#define	reg_p_dcrm_en_len 1
#define	reg_p_dcrm_en_lsb 0
#define xd_p_reg_p_dcrm_fir	(*(volatile byte xdata *) 0xF0E3)
#define    p_reg_p_dcrm_fir	0xF0E3 
#define	reg_p_dcrm_fir_pos 0
#define	reg_p_dcrm_fir_len 1
#define	reg_p_dcrm_fir_lsb 0
#define xd_p_reg_p_dcrm_log2_firlen	(*(volatile byte xdata *) 0xF0E4)
#define    p_reg_p_dcrm_log2_firlen	0xF0E4 
#define	reg_p_dcrm_log2_firlen_pos 0
#define	reg_p_dcrm_log2_firlen_len 3
#define	reg_p_dcrm_log2_firlen_lsb 0
#define xd_r_reg_dcoe_apply_fir_i	(*(volatile byte xdata *) 0xF0E5)
#define    r_reg_dcoe_apply_fir_i	0xF0E5 
#define	reg_dcoe_apply_fir_i_pos 0
#define	reg_dcoe_apply_fir_i_len 8
#define	reg_dcoe_apply_fir_i_lsb 0
#define xd_r_reg_dcoe_apply_fir_q	(*(volatile byte xdata *) 0xF0E6)
#define    r_reg_dcoe_apply_fir_q	0xF0E6 
#define	reg_dcoe_apply_fir_q_pos 0
#define	reg_dcoe_apply_fir_q_len 8
#define	reg_dcoe_apply_fir_q_lsb 0
#define xd_p_reg_p_dcrm_force_en	(*(volatile byte xdata *) 0xF0E7)
#define    p_reg_p_dcrm_force_en	0xF0E7 
#define	reg_p_dcrm_force_en_pos 0
#define	reg_p_dcrm_force_en_len 1
#define	reg_p_dcrm_force_en_lsb 0
#define xd_p_reg_p_dcrm_force_value_i	(*(volatile byte xdata *) 0xF0E8)
#define    p_reg_p_dcrm_force_value_i	0xF0E8 
#define	reg_p_dcrm_force_value_i_pos 0
#define	reg_p_dcrm_force_value_i_len 8
#define	reg_p_dcrm_force_value_i_lsb 0
#define xd_p_reg_p_dcrm_force_value_q	(*(volatile byte xdata *) 0xF0E9)
#define    p_reg_p_dcrm_force_value_q	0xF0E9 
#define	reg_p_dcrm_force_value_q_pos 0
#define	reg_p_dcrm_force_value_q_len 8
#define	reg_p_dcrm_force_value_q_lsb 0
#define xd_p_reg_p_iqip_en	(*(volatile byte xdata *) 0xF0EA)
#define    p_reg_p_iqip_en	0xF0EA 
#define	reg_p_iqip_en_pos 0
#define	reg_p_iqip_en_len 1
#define	reg_p_iqip_en_lsb 0
#define xd_p_reg_p_iqip_rst	(*(volatile byte xdata *) 0xF0EB)
#define    p_reg_p_iqip_rst	0xF0EB 
#define	reg_p_iqip_rst_pos 0
#define	reg_p_iqip_rst_len 1
#define	reg_p_iqip_rst_lsb 0
#define xd_p_reg_iqip_mu_ld	(*(volatile byte xdata *) 0xF0EC)
#define    p_reg_iqip_mu_ld	0xF0EC 
#define	reg_iqip_mu_ld_pos 0
#define	reg_iqip_mu_ld_len 1
#define	reg_iqip_mu_ld_lsb 0
#define xd_p_reg_p_iqip_mu_7_0	(*(volatile byte xdata *) 0xF0ED)
#define    p_reg_p_iqip_mu_7_0	0xF0ED 
#define	reg_p_iqip_mu_7_0_pos 0
#define	reg_p_iqip_mu_7_0_len 8
#define	reg_p_iqip_mu_7_0_lsb 0
#define xd_p_reg_p_iqip_mu_11_8	(*(volatile byte xdata *) 0xF0EE)
#define    p_reg_p_iqip_mu_11_8	0xF0EE 
#define	reg_p_iqip_mu_11_8_pos 0
#define	reg_p_iqip_mu_11_8_len 4
#define	reg_p_iqip_mu_11_8_lsb 8
#define xd_p_reg_iqip_gs_ld	(*(volatile byte xdata *) 0xF0EF)
#define    p_reg_iqip_gs_ld	0xF0EF 
#define	reg_iqip_gs_ld_pos 0
#define	reg_iqip_gs_ld_len 1
#define	reg_iqip_gs_ld_lsb 0
#define xd_p_reg_p_iqip_gsnums	(*(volatile byte xdata *) 0xF0F0)
#define    p_reg_p_iqip_gsnums	0xF0F0 
#define	reg_p_iqip_gsnums_pos 0
#define	reg_p_iqip_gsnums_len 4
#define	reg_p_iqip_gsnums_lsb 0
#define xd_p_reg_p_iqip_gsites_7_0	(*(volatile byte xdata *) 0xF0F1)
#define    p_reg_p_iqip_gsites_7_0	0xF0F1 
#define	reg_p_iqip_gsites_7_0_pos 0
#define	reg_p_iqip_gsites_7_0_len 8
#define	reg_p_iqip_gsites_7_0_lsb 0
#define xd_p_reg_p_iqip_gsites_15_8	(*(volatile byte xdata *) 0xF0F2)
#define    p_reg_p_iqip_gsites_15_8	0xF0F2 
#define	reg_p_iqip_gsites_15_8_pos 0
#define	reg_p_iqip_gsites_15_8_len 8
#define	reg_p_iqip_gsites_15_8_lsb 8
#define xd_p_reg_iqip_w_ld	(*(volatile byte xdata *) 0xF0F3)
#define    p_reg_iqip_w_ld	0xF0F3 
#define	reg_iqip_w_ld_pos 0
#define	reg_iqip_w_ld_len 1
#define	reg_iqip_w_ld_lsb 0
#define xd_p_reg_p_iqip_w_re_7_0	(*(volatile byte xdata *) 0xF0F4)
#define    p_reg_p_iqip_w_re_7_0	0xF0F4 
#define	reg_p_iqip_w_re_7_0_pos 0
#define	reg_p_iqip_w_re_7_0_len 8
#define	reg_p_iqip_w_re_7_0_lsb 0
#define xd_p_reg_p_iqip_w_re_15_8	(*(volatile byte xdata *) 0xF0F5)
#define    p_reg_p_iqip_w_re_15_8	0xF0F5 
#define	reg_p_iqip_w_re_15_8_pos 0
#define	reg_p_iqip_w_re_15_8_len 8
#define	reg_p_iqip_w_re_15_8_lsb 8
#define xd_p_reg_p_iqip_w_re_16	(*(volatile byte xdata *) 0xF0F6)
#define    p_reg_p_iqip_w_re_16	0xF0F6 
#define	reg_p_iqip_w_re_16_pos 0
#define	reg_p_iqip_w_re_16_len 1
#define	reg_p_iqip_w_re_16_lsb 16
#define xd_p_reg_p_iqip_w_im_7_0	(*(volatile byte xdata *) 0xF0F7)
#define    p_reg_p_iqip_w_im_7_0	0xF0F7 
#define	reg_p_iqip_w_im_7_0_pos 0
#define	reg_p_iqip_w_im_7_0_len 8
#define	reg_p_iqip_w_im_7_0_lsb 0
#define xd_p_reg_p_iqip_w_im_15_8	(*(volatile byte xdata *) 0xF0F8)
#define    p_reg_p_iqip_w_im_15_8	0xF0F8 
#define	reg_p_iqip_w_im_15_8_pos 0
#define	reg_p_iqip_w_im_15_8_len 8
#define	reg_p_iqip_w_im_15_8_lsb 8
#define xd_p_reg_p_iqip_w_im_16	(*(volatile byte xdata *) 0xF0F9)
#define    p_reg_p_iqip_w_im_16	0xF0F9 
#define	reg_p_iqip_w_im_16_pos 0
#define	reg_p_iqip_w_im_16_len 1
#define	reg_p_iqip_w_im_16_lsb 16
#define xd_p_reg_iqip_accnums_rd	(*(volatile byte xdata *) 0xF0FA)
#define    p_reg_iqip_accnums_rd	0xF0FA 
#define	reg_iqip_accnums_rd_pos 0
#define	reg_iqip_accnums_rd_len 1
#define	reg_iqip_accnums_rd_lsb 0
#define xd_p_reg_p_iqip_accnums	(*(volatile byte xdata *) 0xF0FB)
#define    p_reg_p_iqip_accnums	0xF0FB 
#define	reg_p_iqip_accnums_pos 0
#define	reg_p_iqip_accnums_len 2
#define	reg_p_iqip_accnums_lsb 0
#define xd_p_reg_iqip_accnums_rdy	(*(volatile byte xdata *) 0xF0FC)
#define    p_reg_iqip_accnums_rdy	0xF0FC 
#define	reg_iqip_accnums_rdy_pos 0
#define	reg_iqip_accnums_rdy_len 1
#define	reg_iqip_accnums_rdy_lsb 0
#define xd_r_reg_r_iqip_wacc_re_7_0	(*(volatile byte xdata *) 0xF0FD)
#define    r_reg_r_iqip_wacc_re_7_0	0xF0FD 
#define	reg_r_iqip_wacc_re_7_0_pos 0
#define	reg_r_iqip_wacc_re_7_0_len 8
#define	reg_r_iqip_wacc_re_7_0_lsb 0
#define xd_r_reg_r_iqip_wacc_re_15_8	(*(volatile byte xdata *) 0xF0FE)
#define    r_reg_r_iqip_wacc_re_15_8	0xF0FE 
#define	reg_r_iqip_wacc_re_15_8_pos 0
#define	reg_r_iqip_wacc_re_15_8_len 8
#define	reg_r_iqip_wacc_re_15_8_lsb 8
#define xd_r_reg_r_iqip_wacc_re_16	(*(volatile byte xdata *) 0xF0FF)
#define    r_reg_r_iqip_wacc_re_16	0xF0FF 
#define	reg_r_iqip_wacc_re_16_pos 0
#define	reg_r_iqip_wacc_re_16_len 1
#define	reg_r_iqip_wacc_re_16_lsb 16
#define xd_r_reg_r_iqip_wacc_im_7_0	(*(volatile byte xdata *) 0xF100)
#define    r_reg_r_iqip_wacc_im_7_0	0xF100 
#define	reg_r_iqip_wacc_im_7_0_pos 0
#define	reg_r_iqip_wacc_im_7_0_len 8
#define	reg_r_iqip_wacc_im_7_0_lsb 0
#define xd_r_reg_r_iqip_wacc_im_15_8	(*(volatile byte xdata *) 0xF101)
#define    r_reg_r_iqip_wacc_im_15_8	0xF101 
#define	reg_r_iqip_wacc_im_15_8_pos 0
#define	reg_r_iqip_wacc_im_15_8_len 8
#define	reg_r_iqip_wacc_im_15_8_lsb 8
#define xd_r_reg_r_iqip_wacc_im_16	(*(volatile byte xdata *) 0xF102)
#define    r_reg_r_iqip_wacc_im_16	0xF102 
#define	reg_r_iqip_wacc_im_16_pos 0
#define	reg_r_iqip_wacc_im_16_len 1
#define	reg_r_iqip_wacc_im_16_lsb 16
#define xd_r_reg_r_iqip_out2cacc_re_7_0	(*(volatile byte xdata *) 0xF103)
#define    r_reg_r_iqip_out2cacc_re_7_0	0xF103 
#define	reg_r_iqip_out2cacc_re_7_0_pos 0
#define	reg_r_iqip_out2cacc_re_7_0_len 8
#define	reg_r_iqip_out2cacc_re_7_0_lsb 0
#define xd_r_reg_r_iqip_out2cacc_re_15_8	(*(volatile byte xdata *) 0xF104)
#define    r_reg_r_iqip_out2cacc_re_15_8	0xF104 
#define	reg_r_iqip_out2cacc_re_15_8_pos 0
#define	reg_r_iqip_out2cacc_re_15_8_len 8
#define	reg_r_iqip_out2cacc_re_15_8_lsb 8
#define xd_r_reg_r_iqip_out2cacc_re_21_16	(*(volatile byte xdata *) 0xF105)
#define    r_reg_r_iqip_out2cacc_re_21_16	0xF105 
#define	reg_r_iqip_out2cacc_re_21_16_pos 0
#define	reg_r_iqip_out2cacc_re_21_16_len 6
#define	reg_r_iqip_out2cacc_re_21_16_lsb 16
#define xd_r_reg_r_iqip_out2cacc_im_7_0	(*(volatile byte xdata *) 0xF106)
#define    r_reg_r_iqip_out2cacc_im_7_0	0xF106 
#define	reg_r_iqip_out2cacc_im_7_0_pos 0
#define	reg_r_iqip_out2cacc_im_7_0_len 8
#define	reg_r_iqip_out2cacc_im_7_0_lsb 0
#define xd_r_reg_r_iqip_out2cacc_im_15_8	(*(volatile byte xdata *) 0xF107)
#define    r_reg_r_iqip_out2cacc_im_15_8	0xF107 
#define	reg_r_iqip_out2cacc_im_15_8_pos 0
#define	reg_r_iqip_out2cacc_im_15_8_len 8
#define	reg_r_iqip_out2cacc_im_15_8_lsb 8
#define xd_r_reg_r_iqip_out2cacc_im_21_16	(*(volatile byte xdata *) 0xF108)
#define    r_reg_r_iqip_out2cacc_im_21_16	0xF108 
#define	reg_r_iqip_out2cacc_im_21_16_pos 0
#define	reg_r_iqip_out2cacc_im_21_16_len 6
#define	reg_r_iqip_out2cacc_im_21_16_lsb 16
#define xd_p_reg_mccid_ccif0_scstrobe	(*(volatile byte xdata *) 0xF109)
#define    p_reg_mccid_ccif0_scstrobe	0xF109 
#define	reg_mccid_ccif0_scstrobe_pos 0
#define	reg_mccid_ccif0_scstrobe_len 7
#define	reg_mccid_ccif0_scstrobe_lsb 0
#define xd_p_reg_mccid_cciftrigger	(*(volatile byte xdata *) 0xF10A)
#define    p_reg_mccid_cciftrigger	0xF10A 
#define	reg_mccid_cciftrigger_pos 0
#define	reg_mccid_cciftrigger_len 1
#define	reg_mccid_cciftrigger_lsb 0
#define xd_p_reg_mccid_ccif1_scstrobe	(*(volatile byte xdata *) 0xF10B)
#define    p_reg_mccid_ccif1_scstrobe	0xF10B 
#define	reg_mccid_ccif1_scstrobe_pos 0
#define	reg_mccid_ccif1_scstrobe_len 7
#define	reg_mccid_ccif1_scstrobe_lsb 0
#define xd_p_reg_mccid_signalpowershift	(*(volatile byte xdata *) 0xF10C)
#define    p_reg_mccid_signalpowershift	0xF10C 
#define	reg_mccid_signalpowershift_pos 0
#define	reg_mccid_signalpowershift_len 2
#define	reg_mccid_signalpowershift_lsb 0
#define xd_r_reg_mccid_ccif0_false_trigger	(*(volatile byte xdata *) 0xF10D)
#define    r_reg_mccid_ccif0_false_trigger	0xF10D 
#define	reg_mccid_ccif0_false_trigger_pos 0
#define	reg_mccid_ccif0_false_trigger_len 1
#define	reg_mccid_ccif0_false_trigger_lsb 0
#define xd_p_reg_mccid_ccif0_fcwccif_7_0	(*(volatile byte xdata *) 0xF10E)
#define    p_reg_mccid_ccif0_fcwccif_7_0	0xF10E 
#define	reg_mccid_ccif0_fcwccif_7_0_pos 0
#define	reg_mccid_ccif0_fcwccif_7_0_len 8
#define	reg_mccid_ccif0_fcwccif_7_0_lsb 0
#define xd_p_reg_mccid_ccif0_fcwccif_13_8	(*(volatile byte xdata *) 0xF10F)
#define    p_reg_mccid_ccif0_fcwccif_13_8	0xF10F 
#define	reg_mccid_ccif0_fcwccif_13_8_pos 0
#define	reg_mccid_ccif0_fcwccif_13_8_len 6
#define	reg_mccid_ccif0_fcwccif_13_8_lsb 8
#define xd_p_reg_mccid_ccif0_state	(*(volatile byte xdata *) 0xF110)
#define    p_reg_mccid_ccif0_state	0xF110 
#define	reg_mccid_ccif0_state_pos 0
#define	reg_mccid_ccif0_state_len 1
#define	reg_mccid_ccif0_state_lsb 0
#define xd_p_reg_mccid_ccif0_acistate	(*(volatile byte xdata *) 0xF111)
#define    p_reg_mccid_ccif0_acistate	0xF111 
#define	reg_mccid_ccif0_acistate_pos 0
#define	reg_mccid_ccif0_acistate_len 1
#define	reg_mccid_ccif0_acistate_lsb 0
#define xd_p_reg_mccid_ccif1_fcwccif_7_0	(*(volatile byte xdata *) 0xF112)
#define    p_reg_mccid_ccif1_fcwccif_7_0	0xF112 
#define	reg_mccid_ccif1_fcwccif_7_0_pos 0
#define	reg_mccid_ccif1_fcwccif_7_0_len 8
#define	reg_mccid_ccif1_fcwccif_7_0_lsb 0
#define xd_p_reg_mccid_ccif1_fcwccif_13_8	(*(volatile byte xdata *) 0xF113)
#define    p_reg_mccid_ccif1_fcwccif_13_8	0xF113 
#define	reg_mccid_ccif1_fcwccif_13_8_pos 0
#define	reg_mccid_ccif1_fcwccif_13_8_len 6
#define	reg_mccid_ccif1_fcwccif_13_8_lsb 8
#define xd_p_reg_mccid_ccif1_state	(*(volatile byte xdata *) 0xF114)
#define    p_reg_mccid_ccif1_state	0xF114 
#define	reg_mccid_ccif1_state_pos 0
#define	reg_mccid_ccif1_state_len 1
#define	reg_mccid_ccif1_state_lsb 0
#define xd_p_reg_mccid_ccif1_acistate	(*(volatile byte xdata *) 0xF115)
#define    p_reg_mccid_ccif1_acistate	0xF115 
#define	reg_mccid_ccif1_acistate_pos 0
#define	reg_mccid_ccif1_acistate_len 1
#define	reg_mccid_ccif1_acistate_lsb 0
#define xd_r_reg_mccid_ccif1_false_trigger	(*(volatile byte xdata *) 0xF116)
#define    r_reg_mccid_ccif1_false_trigger	0xF116 
#define	reg_mccid_ccif1_false_trigger_pos 0
#define	reg_mccid_ccif1_false_trigger_len 1
#define	reg_mccid_ccif1_false_trigger_lsb 0
#define xd_r_reg_r_acif_saturate	(*(volatile byte xdata *) 0xF117)
#define    r_reg_r_acif_saturate	0xF117 
#define	reg_r_acif_saturate_pos 0
#define	reg_r_acif_saturate_len 8
#define	reg_r_acif_saturate_lsb 0
#define xd_p_reg_tmr_timer0_threshold_7_0	(*(volatile byte xdata *) 0xF118)
#define    p_reg_tmr_timer0_threshold_7_0	0xF118 
#define	reg_tmr_timer0_threshold_7_0_pos 0
#define	reg_tmr_timer0_threshold_7_0_len 8
#define	reg_tmr_timer0_threshold_7_0_lsb 0
#define xd_p_reg_tmr_timer0_threshold_15_8	(*(volatile byte xdata *) 0xF119)
#define    p_reg_tmr_timer0_threshold_15_8	0xF119 
#define	reg_tmr_timer0_threshold_15_8_pos 0
#define	reg_tmr_timer0_threshold_15_8_len 8
#define	reg_tmr_timer0_threshold_15_8_lsb 8
#define xd_p_reg_tmr_timer0_enable	(*(volatile byte xdata *) 0xF11A)
#define    p_reg_tmr_timer0_enable	0xF11A 
#define	reg_tmr_timer0_enable_pos 0
#define	reg_tmr_timer0_enable_len 1
#define	reg_tmr_timer0_enable_lsb 0
#define xd_p_reg_tmr_timer0_clk_sel	(*(volatile byte xdata *) 0xF11B)
#define    p_reg_tmr_timer0_clk_sel	0xF11B 
#define	reg_tmr_timer0_clk_sel_pos 0
#define	reg_tmr_timer0_clk_sel_len 1
#define	reg_tmr_timer0_clk_sel_lsb 0
#define xd_p_reg_tmr_timer0_int	(*(volatile byte xdata *) 0xF11C)
#define    p_reg_tmr_timer0_int	0xF11C 
#define	reg_tmr_timer0_int_pos 0
#define	reg_tmr_timer0_int_len 1
#define	reg_tmr_timer0_int_lsb 0
#define xd_p_reg_tmr_timer0_rst	(*(volatile byte xdata *) 0xF11D)
#define    p_reg_tmr_timer0_rst	0xF11D 
#define	reg_tmr_timer0_rst_pos 0
#define	reg_tmr_timer0_rst_len 1
#define	reg_tmr_timer0_rst_lsb 0
#define xd_r_reg_tmr_timer0_count_7_0	(*(volatile byte xdata *) 0xF11E)
#define    r_reg_tmr_timer0_count_7_0	0xF11E 
#define	reg_tmr_timer0_count_7_0_pos 0
#define	reg_tmr_timer0_count_7_0_len 8
#define	reg_tmr_timer0_count_7_0_lsb 0
#define xd_r_reg_tmr_timer0_count_15_8	(*(volatile byte xdata *) 0xF11F)
#define    r_reg_tmr_timer0_count_15_8	0xF11F 
#define	reg_tmr_timer0_count_15_8_pos 0
#define	reg_tmr_timer0_count_15_8_len 8
#define	reg_tmr_timer0_count_15_8_lsb 8
#define xd_p_reg_suspend	(*(volatile byte xdata *) 0xF120)
#define    p_reg_suspend	0xF120 
#define	reg_suspend_pos 0
#define	reg_suspend_len 1
#define	reg_suspend_lsb 0
#define xd_p_reg_suspend_rdy	(*(volatile byte xdata *) 0xF121)
#define    p_reg_suspend_rdy	0xF121 
#define	reg_suspend_rdy_pos 0
#define	reg_suspend_rdy_len 1
#define	reg_suspend_rdy_lsb 0
#define xd_p_reg_resume	(*(volatile byte xdata *) 0xF122)
#define    p_reg_resume	0xF122 
#define	reg_resume_pos 0
#define	reg_resume_len 1
#define	reg_resume_lsb 0
#define xd_p_reg_resume_rdy	(*(volatile byte xdata *) 0xF123)
#define    p_reg_resume_rdy	0xF123 
#define	reg_resume_rdy_pos 0
#define	reg_resume_rdy_len 1
#define	reg_resume_rdy_lsb 0
#define xd_p_reg_gp_trigger	(*(volatile byte xdata *) 0xF124)
#define    p_reg_gp_trigger	0xF124 
#define	reg_gp_trigger_pos 0
#define	reg_gp_trigger_len 1
#define	reg_gp_trigger_lsb 0
#define xd_p_reg_trigger_sel	(*(volatile byte xdata *) 0xF125)
#define    p_reg_trigger_sel	0xF125 
#define	reg_trigger_sel_pos 0
#define	reg_trigger_sel_len 2
#define	reg_trigger_sel_lsb 0
#define xd_p_reg_debug_ofdm	(*(volatile byte xdata *) 0xF126)
#define    p_reg_debug_ofdm	0xF126 
#define	reg_debug_ofdm_pos 0
#define	reg_debug_ofdm_len 2
#define	reg_debug_ofdm_lsb 0
#define xd_p_reg_trigger_module_sel	(*(volatile byte xdata *) 0xF127)
#define    p_reg_trigger_module_sel	0xF127 
#define	reg_trigger_module_sel_pos 0
#define	reg_trigger_module_sel_len 6
#define	reg_trigger_module_sel_lsb 0
#define xd_p_reg_trigger_set_sel	(*(volatile byte xdata *) 0xF128)
#define    p_reg_trigger_set_sel	0xF128 
#define	reg_trigger_set_sel_pos 0
#define	reg_trigger_set_sel_len 6
#define	reg_trigger_set_sel_lsb 0
#define xd_p_reg_fw_int_mask_n	(*(volatile byte xdata *) 0xF129)
#define    p_reg_fw_int_mask_n	0xF129 
#define	reg_fw_int_mask_n_pos 0
#define	reg_fw_int_mask_n_len 1
#define	reg_fw_int_mask_n_lsb 0
#define xd_p_reg_debug_group	(*(volatile byte xdata *) 0xF12B)
#define    p_reg_debug_group	0xF12B 
#define	reg_debug_group_pos 0
#define	reg_debug_group_len 4
#define	reg_debug_group_lsb 0
#define xd_p_reg_odbg_clk_sel	(*(volatile byte xdata *) 0xF12C)
#define    p_reg_odbg_clk_sel	0xF12C 
#define	reg_odbg_clk_sel_pos 0
#define	reg_odbg_clk_sel_len 3
#define	reg_odbg_clk_sel_lsb 0
#define xd_r_reg_mccid_ccif0_rel_ind	(*(volatile byte xdata *) 0xF12D)
#define    r_reg_mccid_ccif0_rel_ind	0xF12D 
#define	reg_mccid_ccif0_rel_ind_pos 0
#define	reg_mccid_ccif0_rel_ind_len 1
#define	reg_mccid_ccif0_rel_ind_lsb 0
#define xd_r_reg_mccid_ccif1_rel_ind	(*(volatile byte xdata *) 0xF12E)
#define    r_reg_mccid_ccif1_rel_ind	0xF12E 
#define	reg_mccid_ccif1_rel_ind_pos 0
#define	reg_mccid_ccif1_rel_ind_len 1
#define	reg_mccid_ccif1_rel_ind_lsb 0
#define xd_p_reg_p_ccif_shift_fre	(*(volatile byte xdata *) 0xF12F)
#define    p_reg_p_ccif_shift_fre	0xF12F 
#define	reg_p_ccif_shift_fre_pos 0
#define	reg_p_ccif_shift_fre_len 1
#define	reg_p_ccif_shift_fre_lsb 0
#define xd_p_reg_p_ccif_bandwidth_factor	(*(volatile byte xdata *) 0xF130)
#define    p_reg_p_ccif_bandwidth_factor	0xF130 
#define	reg_p_ccif_bandwidth_factor_pos 0
#define	reg_p_ccif_bandwidth_factor_len 3
#define	reg_p_ccif_bandwidth_factor_lsb 0
#define xd_p_reg_ccif_rst	(*(volatile byte xdata *) 0xF131)
#define    p_reg_ccif_rst	0xF131 
#define	reg_ccif_rst_pos 0
#define	reg_ccif_rst_len 1
#define	reg_ccif_rst_lsb 0
#define xd_p_reg_p_ccif_min_bandwidth	(*(volatile byte xdata *) 0xF132)
#define    p_reg_p_ccif_min_bandwidth	0xF132 
#define	reg_p_ccif_min_bandwidth_pos 0
#define	reg_p_ccif_min_bandwidth_len 7
#define	reg_p_ccif_min_bandwidth_lsb 0
#define xd_p_reg_ccif_bq0_state	(*(volatile byte xdata *) 0xF133)
#define    p_reg_ccif_bq0_state	0xF133 
#define	reg_ccif_bq0_state_pos 0
#define	reg_ccif_bq0_state_len 1
#define	reg_ccif_bq0_state_lsb 0
#define xd_p_reg_ccif_bq0_outputscaling	(*(volatile byte xdata *) 0xF134)
#define    p_reg_ccif_bq0_outputscaling	0xF134 
#define	reg_ccif_bq0_outputscaling_pos 0
#define	reg_ccif_bq0_outputscaling_len 5
#define	reg_ccif_bq0_outputscaling_lsb 0
#define xd_p_reg_ccif_bq1_state	(*(volatile byte xdata *) 0xF135)
#define    p_reg_ccif_bq1_state	0xF135 
#define	reg_ccif_bq1_state_pos 0
#define	reg_ccif_bq1_state_len 1
#define	reg_ccif_bq1_state_lsb 0
#define xd_p_reg_ccif_bq1_outputscaling	(*(volatile byte xdata *) 0xF136)
#define    p_reg_ccif_bq1_outputscaling	0xF136 
#define	reg_ccif_bq1_outputscaling_pos 0
#define	reg_ccif_bq1_outputscaling_len 5
#define	reg_ccif_bq1_outputscaling_lsb 0
#define xd_p_reg_ccif_bq0_a1_7_0	(*(volatile byte xdata *) 0xF137)
#define    p_reg_ccif_bq0_a1_7_0	0xF137 
#define	reg_ccif_bq0_a1_7_0_pos 0
#define	reg_ccif_bq0_a1_7_0_len 8
#define	reg_ccif_bq0_a1_7_0_lsb 0
#define xd_p_reg_ccif_bq0_a1_13_8	(*(volatile byte xdata *) 0xF138)
#define    p_reg_ccif_bq0_a1_13_8	0xF138 
#define	reg_ccif_bq0_a1_13_8_pos 0
#define	reg_ccif_bq0_a1_13_8_len 6
#define	reg_ccif_bq0_a1_13_8_lsb 8
#define xd_p_reg_ccif_bq1_a1_7_0	(*(volatile byte xdata *) 0xF139)
#define    p_reg_ccif_bq1_a1_7_0	0xF139 
#define	reg_ccif_bq1_a1_7_0_pos 0
#define	reg_ccif_bq1_a1_7_0_len 8
#define	reg_ccif_bq1_a1_7_0_lsb 0
#define xd_p_reg_ccif_bq1_a1_13_8	(*(volatile byte xdata *) 0xF13A)
#define    p_reg_ccif_bq1_a1_13_8	0xF13A 
#define	reg_ccif_bq1_a1_13_8_pos 0
#define	reg_ccif_bq1_a1_13_8_len 6
#define	reg_ccif_bq1_a1_13_8_lsb 8
#define xd_p_reg_ccif_bq0_b1_7_0	(*(volatile byte xdata *) 0xF13B)
#define    p_reg_ccif_bq0_b1_7_0	0xF13B 
#define	reg_ccif_bq0_b1_7_0_pos 0
#define	reg_ccif_bq0_b1_7_0_len 8
#define	reg_ccif_bq0_b1_7_0_lsb 0
#define xd_p_reg_ccif_bq0_b1_13_8	(*(volatile byte xdata *) 0xF13C)
#define    p_reg_ccif_bq0_b1_13_8	0xF13C 
#define	reg_ccif_bq0_b1_13_8_pos 0
#define	reg_ccif_bq0_b1_13_8_len 6
#define	reg_ccif_bq0_b1_13_8_lsb 8
#define xd_p_reg_ccif_bq1_b1_7_0	(*(volatile byte xdata *) 0xF13D)
#define    p_reg_ccif_bq1_b1_7_0	0xF13D 
#define	reg_ccif_bq1_b1_7_0_pos 0
#define	reg_ccif_bq1_b1_7_0_len 8
#define	reg_ccif_bq1_b1_7_0_lsb 0
#define xd_p_reg_ccif_bq1_b1_13_8	(*(volatile byte xdata *) 0xF13E)
#define    p_reg_ccif_bq1_b1_13_8	0xF13E 
#define	reg_ccif_bq1_b1_13_8_pos 0
#define	reg_ccif_bq1_b1_13_8_len 6
#define	reg_ccif_bq1_b1_13_8_lsb 8
#define xd_p_reg_ccif_bq0_b2_7_0	(*(volatile byte xdata *) 0xF13F)
#define    p_reg_ccif_bq0_b2_7_0	0xF13F 
#define	reg_ccif_bq0_b2_7_0_pos 0
#define	reg_ccif_bq0_b2_7_0_len 8
#define	reg_ccif_bq0_b2_7_0_lsb 0
#define xd_p_reg_ccif_bq0_b2_13_8	(*(volatile byte xdata *) 0xF140)
#define    p_reg_ccif_bq0_b2_13_8	0xF140 
#define	reg_ccif_bq0_b2_13_8_pos 0
#define	reg_ccif_bq0_b2_13_8_len 6
#define	reg_ccif_bq0_b2_13_8_lsb 8
#define xd_p_reg_ccif_bq1_b2_7_0	(*(volatile byte xdata *) 0xF141)
#define    p_reg_ccif_bq1_b2_7_0	0xF141 
#define	reg_ccif_bq1_b2_7_0_pos 0
#define	reg_ccif_bq1_b2_7_0_len 8
#define	reg_ccif_bq1_b2_7_0_lsb 0
#define xd_p_reg_ccif_bq1_b2_13_8	(*(volatile byte xdata *) 0xF142)
#define    p_reg_ccif_bq1_b2_13_8	0xF142 
#define	reg_ccif_bq1_b2_13_8_pos 0
#define	reg_ccif_bq1_b2_13_8_len 6
#define	reg_ccif_bq1_b2_13_8_lsb 8
#define xd_p_reg_ccif_debug_rst	(*(volatile byte xdata *) 0xF143)
#define    p_reg_ccif_debug_rst	0xF143 
#define	reg_ccif_debug_rst_pos 0
#define	reg_ccif_debug_rst_len 1
#define	reg_ccif_debug_rst_lsb 0
#define xd_p_reg_mccid_defaultccifscstrobe	(*(volatile byte xdata *) 0xF144)
#define    p_reg_mccid_defaultccifscstrobe	0xF144 
#define	reg_mccid_defaultccifscstrobe_pos 0
#define	reg_mccid_defaultccifscstrobe_len 7
#define	reg_mccid_defaultccifscstrobe_lsb 0
#define xd_p_reg_mccid_monitoringaci	(*(volatile byte xdata *) 0xF145)
#define    p_reg_mccid_monitoringaci	0xF145 
#define	reg_mccid_monitoringaci_pos 0
#define	reg_mccid_monitoringaci_len 1
#define	reg_mccid_monitoringaci_lsb 0
#define xd_p_reg_mccid_ispassmode	(*(volatile byte xdata *) 0xF146)
#define    p_reg_mccid_ispassmode	0xF146 
#define	reg_mccid_ispassmode_pos 0
#define	reg_mccid_ispassmode_len 1
#define	reg_mccid_ispassmode_lsb 0
#define xd_p_reg_mccid_issteadystatemode	(*(volatile byte xdata *) 0xF147)
#define    p_reg_mccid_issteadystatemode	0xF147 
#define	reg_mccid_issteadystatemode_pos 0
