liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_mccid_issteadystatemode_len 1
#define	reg_mccid_issteadystatemode_lsb 0
#define xd_p_reg_mccid_fixedgaincmp	(*(volatile byte xdata *) 0xF148)
#define    p_reg_mccid_fixedgaincmp	0xF148 
#define	reg_mccid_fixedgaincmp_pos 0
#define	reg_mccid_fixedgaincmp_len 1
#define	reg_mccid_fixedgaincmp_lsb 0
#define xd_p_reg_mccid_misscounter_reset	(*(volatile byte xdata *) 0xF149)
#define    p_reg_mccid_misscounter_reset	0xF149 
#define	reg_mccid_misscounter_reset_pos 0
#define	reg_mccid_misscounter_reset_len 1
#define	reg_mccid_misscounter_reset_lsb 0
#define xd_p_reg_mccid_acwgcheckcciexist	(*(volatile byte xdata *) 0xF14A)
#define    p_reg_mccid_acwgcheckcciexist	0xF14A 
#define	reg_mccid_acwgcheckcciexist_pos 0
#define	reg_mccid_acwgcheckcciexist_len 1
#define	reg_mccid_acwgcheckcciexist_lsb 0
#define xd_p_reg_mccid_acidone	(*(volatile byte xdata *) 0xF14B)
#define    p_reg_mccid_acidone	0xF14B 
#define	reg_mccid_acidone_pos 0
#define	reg_mccid_acidone_len 1
#define	reg_mccid_acidone_lsb 0
#define xd_p_reg_mccid_sxdesiredpower_7_0	(*(volatile byte xdata *) 0xF14C)
#define    p_reg_mccid_sxdesiredpower_7_0	0xF14C 
#define	reg_mccid_sxdesiredpower_7_0_pos 0
#define	reg_mccid_sxdesiredpower_7_0_len 8
#define	reg_mccid_sxdesiredpower_7_0_lsb 0
#define xd_p_reg_mccid_sxdesiredpower_9_8	(*(volatile byte xdata *) 0xF14D)
#define    p_reg_mccid_sxdesiredpower_9_8	0xF14D 
#define	reg_mccid_sxdesiredpower_9_8_pos 0
#define	reg_mccid_sxdesiredpower_9_8_len 2
#define	reg_mccid_sxdesiredpower_9_8_lsb 8
#define xd_p_reg_mccid_defaultccitimertriggerno	(*(volatile byte xdata *) 0xF14E)
#define    p_reg_mccid_defaultccitimertriggerno	0xF14E 
#define	reg_mccid_defaultccitimertriggerno_pos 0
#define	reg_mccid_defaultccitimertriggerno_len 8
#define	reg_mccid_defaultccitimertriggerno_lsb 0
#define xd_p_reg_mccid_detectedmaxtonecountshift	(*(volatile byte xdata *) 0xF14F)
#define    p_reg_mccid_detectedmaxtonecountshift	0xF14F 
#define	reg_mccid_detectedmaxtonecountshift_pos 0
#define	reg_mccid_detectedmaxtonecountshift_len 3
#define	reg_mccid_detectedmaxtonecountshift_lsb 0
#define xd_p_reg_mccid_moveffttoccif_en	(*(volatile byte xdata *) 0xF151)
#define    p_reg_mccid_moveffttoccif_en	0xF151 
#define	reg_mccid_moveffttoccif_en_pos 0
#define	reg_mccid_moveffttoccif_en_len 1
#define	reg_mccid_moveffttoccif_en_lsb 0
#define xd_p_reg_mccid_fftindextobfsfcwfactor_7_0	(*(volatile byte xdata *) 0xF152)
#define    p_reg_mccid_fftindextobfsfcwfactor_7_0	0xF152 
#define	reg_mccid_fftindextobfsfcwfactor_7_0_pos 0
#define	reg_mccid_fftindextobfsfcwfactor_7_0_len 8
#define	reg_mccid_fftindextobfsfcwfactor_7_0_lsb 0
#define xd_p_reg_mccid_fftindextobfsfcwfactor_9_8	(*(volatile byte xdata *) 0xF153)
#define    p_reg_mccid_fftindextobfsfcwfactor_9_8	0xF153 
#define	reg_mccid_fftindextobfsfcwfactor_9_8_pos 0
#define	reg_mccid_fftindextobfsfcwfactor_9_8_len 2
#define	reg_mccid_fftindextobfsfcwfactor_9_8_lsb 8
#define xd_p_reg_mccid_bfsfcwffttoindexfactor_7_0	(*(volatile byte xdata *) 0xF154)
#define    p_reg_mccid_bfsfcwffttoindexfactor_7_0	0xF154 
#define	reg_mccid_bfsfcwffttoindexfactor_7_0_pos 0
#define	reg_mccid_bfsfcwffttoindexfactor_7_0_len 8
#define	reg_mccid_bfsfcwffttoindexfactor_7_0_lsb 0
#define xd_p_reg_mccid_bfsfcwffttoindexfactor_10_8	(*(volatile byte xdata *) 0xF155)
#define    p_reg_mccid_bfsfcwffttoindexfactor_10_8	0xF155 
#define	reg_mccid_bfsfcwffttoindexfactor_10_8_pos 0
#define	reg_mccid_bfsfcwffttoindexfactor_10_8_len 3
#define	reg_mccid_bfsfcwffttoindexfactor_10_8_lsb 8
#define xd_p_reg_mccid_detectedaci	(*(volatile byte xdata *) 0xF156)
#define    p_reg_mccid_detectedaci	0xF156 
#define	reg_mccid_detectedaci_pos 0
#define	reg_mccid_detectedaci_len 1
#define	reg_mccid_detectedaci_lsb 0
#define xd_r_reg_mccid_filter_enable	(*(volatile byte xdata *) 0xF157)
#define    r_reg_mccid_filter_enable	0xF157 
#define	reg_mccid_filter_enable_pos 0
#define	reg_mccid_filter_enable_len 1
#define	reg_mccid_filter_enable_lsb 0
#define xd_p_reg_mccid_aciscstrobe	(*(volatile byte xdata *) 0xF158)
#define    p_reg_mccid_aciscstrobe	0xF158 
#define	reg_mccid_aciscstrobe_pos 0
#define	reg_mccid_aciscstrobe_len 7
#define	reg_mccid_aciscstrobe_lsb 0
#define xd_p_reg_mccid_scanningaci	(*(volatile byte xdata *) 0xF159)
#define    p_reg_mccid_scanningaci	0xF159 
#define	reg_mccid_scanningaci_pos 0
#define	reg_mccid_scanningaci_len 1
#define	reg_mccid_scanningaci_lsb 0
#define xd_p_reg_mccid_windowsizeacciwdcount_7_0	(*(volatile byte xdata *) 0xF15A)
#define    p_reg_mccid_windowsizeacciwdcount_7_0	0xF15A 
#define	reg_mccid_windowsizeacciwdcount_7_0_pos 0
#define	reg_mccid_windowsizeacciwdcount_7_0_len 8
#define	reg_mccid_windowsizeacciwdcount_7_0_lsb 0
#define xd_p_reg_mccid_windowsizeacciwdcount_12_8	(*(volatile byte xdata *) 0xF15B)
#define    p_reg_mccid_windowsizeacciwdcount_12_8	0xF15B 
#define	reg_mccid_windowsizeacciwdcount_12_8_pos 0
#define	reg_mccid_windowsizeacciwdcount_12_8_len 5
#define	reg_mccid_windowsizeacciwdcount_12_8_lsb 8
#define xd_p_reg_mccid_scannedacionly	(*(volatile byte xdata *) 0xF15C)
#define    p_reg_mccid_scannedacionly	0xF15C 
#define	reg_mccid_scannedacionly_pos 0
#define	reg_mccid_scannedacionly_len 1
#define	reg_mccid_scannedacionly_lsb 0
#define xd_p_reg_mccid_scfactor	(*(volatile byte xdata *) 0xF15D)
#define    p_reg_mccid_scfactor	0xF15D 
#define	reg_mccid_scfactor_pos 0
#define	reg_mccid_scfactor_len 5
#define	reg_mccid_scfactor_lsb 0
#define xd_p_reg_mccid_defaultevaluatingbandwidthfactor	(*(volatile byte xdata *) 0xF15E)
#define    p_reg_mccid_defaultevaluatingbandwidthfactor	0xF15E 
#define	reg_mccid_defaultevaluatingbandwidthfactor_pos 0
#define	reg_mccid_defaultevaluatingbandwidthfactor_len 3
#define	reg_mccid_defaultevaluatingbandwidthfactor_lsb 0
#define xd_p_reg_mccid_defaultacipowerlevel	(*(volatile byte xdata *) 0xF15F)
#define    p_reg_mccid_defaultacipowerlevel	0xF15F 
#define	reg_mccid_defaultacipowerlevel_pos 0
#define	reg_mccid_defaultacipowerlevel_len 3
#define	reg_mccid_defaultacipowerlevel_lsb 0
#define xd_r_reg_mccid_outputdagc1gain_7_0	(*(volatile byte xdata *) 0xF160)
#define    r_reg_mccid_outputdagc1gain_7_0	0xF160 
#define	reg_mccid_outputdagc1gain_7_0_pos 0
#define	reg_mccid_outputdagc1gain_7_0_len 8
#define	reg_mccid_outputdagc1gain_7_0_lsb 0
#define xd_r_reg_mccid_outputdagc1gain_9_8	(*(volatile byte xdata *) 0xF161)
#define    r_reg_mccid_outputdagc1gain_9_8	0xF161 
#define	reg_mccid_outputdagc1gain_9_8_pos 0
#define	reg_mccid_outputdagc1gain_9_8_len 2
#define	reg_mccid_outputdagc1gain_9_8_lsb 8
#define xd_r_reg_mccid_outputdagc1gainshift	(*(volatile byte xdata *) 0xF162)
#define    r_reg_mccid_outputdagc1gainshift	0xF162 
#define	reg_mccid_outputdagc1gainshift_pos 0
#define	reg_mccid_outputdagc1gainshift_len 4
#define	reg_mccid_outputdagc1gainshift_lsb 0
#define xd_p_reg_mccid_defaultacwgcheckccipowerlevel	(*(volatile byte xdata *) 0xF163)
#define    p_reg_mccid_defaultacwgcheckccipowerlevel	0xF163 
#define	reg_mccid_defaultacwgcheckccipowerlevel_pos 0
#define	reg_mccid_defaultacwgcheckccipowerlevel_len 3
#define	reg_mccid_defaultacwgcheckccipowerlevel_lsb 0
#define xd_p_reg_mccid_ccipowerlevelfactor	(*(volatile byte xdata *) 0xF166)
#define    p_reg_mccid_ccipowerlevelfactor	0xF166 
#define	reg_mccid_ccipowerlevelfactor_pos 0
#define	reg_mccid_ccipowerlevelfactor_len 3
#define	reg_mccid_ccipowerlevelfactor_lsb 0
#define xd_p_reg_mccid_scstrobesearchingrange	(*(volatile byte xdata *) 0xF167)
#define    p_reg_mccid_scstrobesearchingrange	0xF167 
#define	reg_mccid_scstrobesearchingrange_pos 0
#define	reg_mccid_scstrobesearchingrange_len 8
#define	reg_mccid_scstrobesearchingrange_lsb 0
#define xd_p_reg_mccid_searchingno	(*(volatile byte xdata *) 0xF168)
#define    p_reg_mccid_searchingno	0xF168 
#define	reg_mccid_searchingno_pos 0
#define	reg_mccid_searchingno_len 6
#define	reg_mccid_searchingno_lsb 0
#define xd_p_reg_mccid_scannedacifrequencyresolution	(*(volatile byte xdata *) 0xF169)
#define    p_reg_mccid_scannedacifrequencyresolution	0xF169 
#define	reg_mccid_scannedacifrequencyresolution_pos 0
#define	reg_mccid_scannedacifrequencyresolution_len 4
#define	reg_mccid_scannedacifrequencyresolution_lsb 0
#define xd_p_reg_mccid_fft0_maskmaxtoneindex_7_0	(*(volatile byte xdata *) 0xF16A)
#define    p_reg_mccid_fft0_maskmaxtoneindex_7_0	0xF16A 
#define	reg_mccid_fft0_maskmaxtoneindex_7_0_pos 0
#define	reg_mccid_fft0_maskmaxtoneindex_7_0_len 8
#define	reg_mccid_fft0_maskmaxtoneindex_7_0_lsb 0
#define xd_p_reg_mccid_fft0_maskmaxtoneindex_12_8	(*(volatile byte xdata *) 0xF16B)
#define    p_reg_mccid_fft0_maskmaxtoneindex_12_8	0xF16B 
#define	reg_mccid_fft0_maskmaxtoneindex_12_8_pos 0
#define	reg_mccid_fft0_maskmaxtoneindex_12_8_len 5
#define	reg_mccid_fft0_maskmaxtoneindex_12_8_lsb 8
#define xd_p_reg_mccid_fft0_state	(*(volatile byte xdata *) 0xF16C)
#define    p_reg_mccid_fft0_state	0xF16C 
#define	reg_mccid_fft0_state_pos 0
#define	reg_mccid_fft0_state_len 1
#define	reg_mccid_fft0_state_lsb 0
#define xd_p_reg_mccid_fft1_state	(*(volatile byte xdata *) 0xF16D)
#define    p_reg_mccid_fft1_state	0xF16D 
#define	reg_mccid_fft1_state_pos 0
#define	reg_mccid_fft1_state_len 1
#define	reg_mccid_fft1_state_lsb 0
#define xd_p_reg_mccid_fft0_maskmintoneindex_7_0	(*(volatile byte xdata *) 0xF16E)
#define    p_reg_mccid_fft0_maskmintoneindex_7_0	0xF16E 
#define	reg_mccid_fft0_maskmintoneindex_7_0_pos 0
#define	reg_mccid_fft0_maskmintoneindex_7_0_len 8
#define	reg_mccid_fft0_maskmintoneindex_7_0_lsb 0
#define xd_p_reg_mccid_fft0_maskmintoneindex_12_8	(*(volatile byte xdata *) 0xF16F)
#define    p_reg_mccid_fft0_maskmintoneindex_12_8	0xF16F 
#define	reg_mccid_fft0_maskmintoneindex_12_8_pos 0
#define	reg_mccid_fft0_maskmintoneindex_12_8_len 5
#define	reg_mccid_fft0_maskmintoneindex_12_8_lsb 8
#define xd_p_reg_mccid_acipowerlevelfactor	(*(volatile byte xdata *) 0xF170)
#define    p_reg_mccid_acipowerlevelfactor	0xF170 
#define	reg_mccid_acipowerlevelfactor_pos 0
#define	reg_mccid_acipowerlevelfactor_len 3
#define	reg_mccid_acipowerlevelfactor_lsb 0
#define xd_p_reg_mccid_fft1_maskmaxtoneindex_7_0	(*(volatile byte xdata *) 0xF171)
#define    p_reg_mccid_fft1_maskmaxtoneindex_7_0	0xF171 
#define	reg_mccid_fft1_maskmaxtoneindex_7_0_pos 0
#define	reg_mccid_fft1_maskmaxtoneindex_7_0_len 8
#define	reg_mccid_fft1_maskmaxtoneindex_7_0_lsb 0
#define xd_p_reg_mccid_fft1_maskmaxtoneindex_12_8	(*(volatile byte xdata *) 0xF172)
#define    p_reg_mccid_fft1_maskmaxtoneindex_12_8	0xF172 
#define	reg_mccid_fft1_maskmaxtoneindex_12_8_pos 0
#define	reg_mccid_fft1_maskmaxtoneindex_12_8_len 5
#define	reg_mccid_fft1_maskmaxtoneindex_12_8_lsb 8
#define xd_p_reg_mccid_fft1_maskmintoneindex_7_0	(*(volatile byte xdata *) 0xF173)
#define    p_reg_mccid_fft1_maskmintoneindex_7_0	0xF173 
#define	reg_mccid_fft1_maskmintoneindex_7_0_pos 0
#define	reg_mccid_fft1_maskmintoneindex_7_0_len 8
#define	reg_mccid_fft1_maskmintoneindex_7_0_lsb 0
#define xd_p_reg_mccid_fft1_maskmintoneindex_12_8	(*(volatile byte xdata *) 0xF174)
#define    p_reg_mccid_fft1_maskmintoneindex_12_8	0xF174 
#define	reg_mccid_fft1_maskmintoneindex_12_8_pos 0
#define	reg_mccid_fft1_maskmintoneindex_12_8_len 5
#define	reg_mccid_fft1_maskmintoneindex_12_8_lsb 8
#define xd_p_reg_mccid_reset	(*(volatile byte xdata *) 0xF175)
#define    p_reg_mccid_reset	0xF175 
#define	reg_mccid_reset_pos 0
#define	reg_mccid_reset_len 1
#define	reg_mccid_reset_lsb 0
#define xd_p_reg_mccid_gaincmpreset	(*(volatile byte xdata *) 0xF176)
#define    p_reg_mccid_gaincmpreset	0xF176 
#define	reg_mccid_gaincmpreset_pos 0
#define	reg_mccid_gaincmpreset_len 1
#define	reg_mccid_gaincmpreset_lsb 0
#define xd_p_reg_mccid_acwgreset	(*(volatile byte xdata *) 0xF177)
#define    p_reg_mccid_acwgreset	0xF177 
#define	reg_mccid_acwgreset_pos 0
#define	reg_mccid_acwgreset_len 1
#define	reg_mccid_acwgreset_lsb 0
#define xd_p_reg_mccid_ccif0_ofsmstateenable	(*(volatile byte xdata *) 0xF178)
#define    p_reg_mccid_ccif0_ofsmstateenable	0xF178 
#define	reg_mccid_ccif0_ofsmstateenable_pos 0
#define	reg_mccid_ccif0_ofsmstateenable_len 1
#define	reg_mccid_ccif0_ofsmstateenable_lsb 0
#define xd_p_reg_mccid_ccif1_ofsmstateenable	(*(volatile byte xdata *) 0xF179)
#define    p_reg_mccid_ccif1_ofsmstateenable	0xF179 
#define	reg_mccid_ccif1_ofsmstateenable_pos 0
#define	reg_mccid_ccif1_ofsmstateenable_len 1
#define	reg_mccid_ccif1_ofsmstateenable_lsb 0
#define xd_p_reg_mccid_fft0_ofsmstateenable	(*(volatile byte xdata *) 0xF17A)
#define    p_reg_mccid_fft0_ofsmstateenable	0xF17A 
#define	reg_mccid_fft0_ofsmstateenable_pos 0
#define	reg_mccid_fft0_ofsmstateenable_len 1
#define	reg_mccid_fft0_ofsmstateenable_lsb 0
#define xd_p_reg_mccid_fft1_ofsmstateenable	(*(volatile byte xdata *) 0xF17B)
#define    p_reg_mccid_fft1_ofsmstateenable	0xF17B 
#define	reg_mccid_fft1_ofsmstateenable_pos 0
#define	reg_mccid_fft1_ofsmstateenable_len 1
#define	reg_mccid_fft1_ofsmstateenable_lsb 0
#define xd_p_reg_mccid_fftfiltermaskchange	(*(volatile byte xdata *) 0xF17C)
#define    p_reg_mccid_fftfiltermaskchange	0xF17C 
#define	reg_mccid_fftfiltermaskchange_pos 0
#define	reg_mccid_fftfiltermaskchange_len 1
#define	reg_mccid_fftfiltermaskchange_lsb 0
#define xd_r_reg_mccid_maxacipowertone_7_0	(*(volatile byte xdata *) 0xF17D)
#define    r_reg_mccid_maxacipowertone_7_0	0xF17D 
#define	reg_mccid_maxacipowertone_7_0_pos 0
#define	reg_mccid_maxacipowertone_7_0_len 8
#define	reg_mccid_maxacipowertone_7_0_lsb 0
#define xd_r_reg_mccid_maxacipowertone_12_8	(*(volatile byte xdata *) 0xF17E)
#define    r_reg_mccid_maxacipowertone_12_8	0xF17E 
#define	reg_mccid_maxacipowertone_12_8_pos 0
#define	reg_mccid_maxacipowertone_12_8_len 5
#define	reg_mccid_maxacipowertone_12_8_lsb 8
#define xd_r_reg_mccid_ccidisappear	(*(volatile byte xdata *) 0xF17F)
#define    r_reg_mccid_ccidisappear	0xF17F 
#define	reg_mccid_ccidisappear_pos 0
#define	reg_mccid_ccidisappear_len 1
#define	reg_mccid_ccidisappear_lsb 0
#define xd_r_reg_mccid_ccilocatordone	(*(volatile byte xdata *) 0xF182)
#define    r_reg_mccid_ccilocatordone	0xF182 
#define	reg_mccid_ccilocatordone_pos 0
#define	reg_mccid_ccilocatordone_len 1
#define	reg_mccid_ccilocatordone_lsb 0
#define xd_p_reg_mccid_enablecciftrigger	(*(volatile byte xdata *) 0xF183)
#define    p_reg_mccid_enablecciftrigger	0xF183 
#define	reg_mccid_enablecciftrigger_pos 0
#define	reg_mccid_enablecciftrigger_len 1
#define	reg_mccid_enablecciftrigger_lsb 0
#define xd_p_reg_mccid_disableacwglaunchevaluationbandwidthtrigger	(*(volatile byte xdata *) 0xF184)
#define    p_reg_mccid_disableacwglaunchevaluationbandwidthtrigger	0xF184 
#define	reg_mccid_disableacwglaunchevaluationbandwidthtrigger_pos 0
#define	reg_mccid_disableacwglaunchevaluationbandwidthtrigger_len 1
#define	reg_mccid_disableacwglaunchevaluationbandwidthtrigger_lsb 0
#define xd_p_reg_mccid_control_by_ofsm	(*(volatile byte xdata *) 0xF185)
#define    p_reg_mccid_control_by_ofsm	0xF185 
#define	reg_mccid_control_by_ofsm_pos 0
#define	reg_mccid_control_by_ofsm_len 1
#define	reg_mccid_control_by_ofsm_lsb 0
#define xd_p_reg_mccid_ofsmcontrolccilocator	(*(volatile byte xdata *) 0xF186)
#define    p_reg_mccid_ofsmcontrolccilocator	0xF186 
#define	reg_mccid_ofsmcontrolccilocator_pos 0
#define	reg_mccid_ofsmcontrolccilocator_len 1
#define	reg_mccid_ofsmcontrolccilocator_lsb 0
#define xd_p_reg_mccid_disablepotentialccitriggerccilocator	(*(volatile byte xdata *) 0xF187)
#define    p_reg_mccid_disablepotentialccitriggerccilocator	0xF187 
#define	reg_mccid_disablepotentialccitriggerccilocator_pos 0
#define	reg_mccid_disablepotentialccitriggerccilocator_len 1
#define	reg_mccid_disablepotentialccitriggerccilocator_lsb 0
#define xd_p_reg_mccid_ofsmcontrolccitesting	(*(volatile byte xdata *) 0xF188)
#define    p_reg_mccid_ofsmcontrolccitesting	0xF188 
#define	reg_mccid_ofsmcontrolccitesting_pos 0
#define	reg_mccid_ofsmcontrolccitesting_len 1
#define	reg_mccid_ofsmcontrolccitesting_lsb 0
#define xd_p_reg_mccid_disableccitestingtriggercheckcci	(*(volatile byte xdata *) 0xF189)
#define    p_reg_mccid_disableccitestingtriggercheckcci	0xF189 
#define	reg_mccid_disableccitestingtriggercheckcci_pos 0
#define	reg_mccid_disableccitestingtriggercheckcci_len 1
#define	reg_mccid_disableccitestingtriggercheckcci_lsb 0
#define xd_p_reg_mccid_disableacwgevaluatingbandwidthtrigger	(*(volatile byte xdata *) 0xF18B)
#define    p_reg_mccid_disableacwgevaluatingbandwidthtrigger	0xF18B 
#define	reg_mccid_disableacwgevaluatingbandwidthtrigger_pos 0
#define	reg_mccid_disableacwgevaluatingbandwidthtrigger_len 1
#define	reg_mccid_disableacwgevaluatingbandwidthtrigger_lsb 0
#define xd_p_reg_mccid_ofsmcontrolscanningaci	(*(volatile byte xdata *) 0xF18D)
#define    p_reg_mccid_ofsmcontrolscanningaci	0xF18D 
#define	reg_mccid_ofsmcontrolscanningaci_pos 0
#define	reg_mccid_ofsmcontrolscanningaci_len 1
#define	reg_mccid_ofsmcontrolscanningaci_lsb 0
#define xd_p_reg_mccid_disablescanningaci	(*(volatile byte xdata *) 0xF18E)
#define    p_reg_mccid_disablescanningaci	0xF18E 
#define	reg_mccid_disablescanningaci_pos 0
#define	reg_mccid_disablescanningaci_len 1
#define	reg_mccid_disablescanningaci_lsb 0
#define xd_p_reg_mccid_disableacwgccidetecting	(*(volatile byte xdata *) 0xF18F)
#define    p_reg_mccid_disableacwgccidetecting	0xF18F 
#define	reg_mccid_disableacwgccidetecting_pos 0
#define	reg_mccid_disableacwgccidetecting_len 1
#define	reg_mccid_disableacwgccidetecting_lsb 0
#define xd_p_reg_mccid_ofsmcontrolccitimertrigger	(*(volatile byte xdata *) 0xF190)
#define    p_reg_mccid_ofsmcontrolccitimertrigger	0xF190 
#define	reg_mccid_ofsmcontrolccitimertrigger_pos 0
#define	reg_mccid_ofsmcontrolccitimertrigger_len 1
#define	reg_mccid_ofsmcontrolccitimertrigger_lsb 0
#define xd_p_reg_mccid_disableccitimertrigger	(*(volatile byte xdata *) 0xF191)
#define    p_reg_mccid_disableccitimertrigger	0xF191 
#define	reg_mccid_disableccitimertrigger_pos 0
#define	reg_mccid_disableccitimertrigger_len 1
#define	reg_mccid_disableccitimertrigger_lsb 0
#define xd_p_reg_mccid_ofsmdisableccitriggercounting	(*(volatile byte xdata *) 0xF192)
#define    p_reg_mccid_ofsmdisableccitriggercounting	0xF192 
#define	reg_mccid_ofsmdisableccitriggercounting_pos 0
#define	reg_mccid_ofsmdisableccitriggercounting_len 1
#define	reg_mccid_ofsmdisableccitriggercounting_lsb 0
#define xd_p_reg_mccid_enableccifilteraci	(*(volatile byte xdata *) 0xF193)
#define    p_reg_mccid_enableccifilteraci	0xF193 
#define	reg_mccid_enableccifilteraci_pos 0
#define	reg_mccid_enableccifilteraci_len 1
#define	reg_mccid_enableccifilteraci_lsb 0
#define xd_p_reg_mccid_scannedfcwbfs_7_0	(*(volatile byte xdata *) 0xF194)
#define    p_reg_mccid_scannedfcwbfs_7_0	0xF194 
#define	reg_mccid_scannedfcwbfs_7_0_pos 0
#define	reg_mccid_scannedfcwbfs_7_0_len 8
#define	reg_mccid_scannedfcwbfs_7_0_lsb 0
#define xd_p_reg_mccid_scannedfcwbfs_13_8	(*(volatile byte xdata *) 0xF195)
#define    p_reg_mccid_scannedfcwbfs_13_8	0xF195 
#define	reg_mccid_scannedfcwbfs_13_8_pos 0
#define	reg_mccid_scannedfcwbfs_13_8_len 6
#define	reg_mccid_scannedfcwbfs_13_8_lsb 8
#define xd_p_reg_mccid_acwgevaluatingbandwidth	(*(volatile byte xdata *) 0xF196)
#define    p_reg_mccid_acwgevaluatingbandwidth	0xF196 
#define	reg_mccid_acwgevaluatingbandwidth_pos 0
#define	reg_mccid_acwgevaluatingbandwidth_len 1
#define	reg_mccid_acwgevaluatingbandwidth_lsb 0
#define xd_p_reg_mccid_acwglaunchevaluationbandwidth	(*(volatile byte xdata *) 0xF197)
#define    p_reg_mccid_acwglaunchevaluationbandwidth	0xF197 
#define	reg_mccid_acwglaunchevaluationbandwidth_pos 0
#define	reg_mccid_acwglaunchevaluationbandwidth_len 1
#define	reg_mccid_acwglaunchevaluationbandwidth_lsb 0
#define xd_p_reg_mccid_scannedcandidate	(*(volatile byte xdata *) 0xF198)
#define    p_reg_mccid_scannedcandidate	0xF198 
#define	reg_mccid_scannedcandidate_pos 0
#define	reg_mccid_scannedcandidate_len 3
#define	reg_mccid_scannedcandidate_lsb 0
#define xd_p_reg_mccid_scstrobesearchingcandidate	(*(volatile byte xdata *) 0xF199)
#define    p_reg_mccid_scstrobesearchingcandidate	0xF199 
#define	reg_mccid_scstrobesearchingcandidate_pos 0
#define	reg_mccid_scstrobesearchingcandidate_len 2
#define	reg_mccid_scstrobesearchingcandidate_lsb 0
#define xd_p_reg_mccid_potentialcci	(*(volatile byte xdata *) 0xF19A)
#define    p_reg_mccid_potentialcci	0xF19A 
#define	reg_mccid_potentialcci_pos 0
#define	reg_mccid_potentialcci_len 1
#define	reg_mccid_potentialcci_lsb 0
#define xd_p_reg_mccid_cciftimertrigger	(*(volatile byte xdata *) 0xF19B)
#define    p_reg_mccid_cciftimertrigger	0xF19B 
#define	reg_mccid_cciftimertrigger_pos 0
#define	reg_mccid_cciftimertrigger_len 1
#define	reg_mccid_cciftimertrigger_lsb 0
#define xd_p_reg_mccid_ccitesting	(*(volatile byte xdata *) 0xF19C)
#define    p_reg_mccid_ccitesting	0xF19C 
#define	reg_mccid_ccitesting_pos 0
#define	reg_mccid_ccitesting_len 1
#define	reg_mccid_ccitesting_lsb 0
#define xd_p_reg_mccid_defaultccilocatormissno	(*(volatile byte xdata *) 0xF19D)
#define    p_reg_mccid_defaultccilocatormissno	0xF19D 
#define	reg_mccid_defaultccilocatormissno_pos 0
#define	reg_mccid_defaultccilocatormissno_len 8
#define	reg_mccid_defaultccilocatormissno_lsb 0
#define xd_p_reg_mccid_dagc1_use_despow	(*(volatile byte xdata *) 0xF19E)
#define    p_reg_mccid_dagc1_use_despow	0xF19E 
#define	reg_mccid_dagc1_use_despow_pos 0
#define	reg_mccid_dagc1_use_despow_len 1
#define	reg_mccid_dagc1_use_despow_lsb 0
#define xd_p_reg_mccid_scannedacifrequencybegin_7_0	(*(volatile byte xdata *) 0xF19F)
#define    p_reg_mccid_scannedacifrequencybegin_7_0	0xF19F 
#define	reg_mccid_scannedacifrequencybegin_7_0_pos 0
#define	reg_mccid_scannedacifrequencybegin_7_0_len 8
#define	reg_mccid_scannedacifrequencybegin_7_0_lsb 0
#define xd_p_reg_mccid_scannedacifrequencybegin_13_8	(*(volatile byte xdata *) 0xF1A0)
#define    p_reg_mccid_scannedacifrequencybegin_13_8	0xF1A0 
#define	reg_mccid_scannedacifrequencybegin_13_8_pos 0
#define	reg_mccid_scannedacifrequencybegin_13_8_len 6
#define	reg_mccid_scannedacifrequencybegin_13_8_lsb 8
#define xd_p_reg_mccid_scannedacifrequencyend_7_0	(*(volatile byte xdata *) 0xF1A1)
#define    p_reg_mccid_scannedacifrequencyend_7_0	0xF1A1 
#define	reg_mccid_scannedacifrequencyend_7_0_pos 0
#define	reg_mccid_scannedacifrequencyend_7_0_len 8
#define	reg_mccid_scannedacifrequencyend_7_0_lsb 0
#define xd_p_reg_mccid_scannedacifrequencyend_13_8	(*(volatile byte xdata *) 0xF1A2)
#define    p_reg_mccid_scannedacifrequencyend_13_8	0xF1A2 
#define	reg_mccid_scannedacifrequencyend_13_8_pos 0
#define	reg_mccid_scannedacifrequencyend_13_8_len 6
#define	reg_mccid_scannedacifrequencyend_13_8_lsb 8
#define xd_p_reg_bfs_fcw_7_0	(*(volatile byte xdata *) 0xF1A3)
#define    p_reg_bfs_fcw_7_0	0xF1A3 
#define	reg_bfs_fcw_7_0_pos 0
#define	reg_bfs_fcw_7_0_len 8
#define	reg_bfs_fcw_7_0_lsb 0
#define xd_p_reg_bfs_fcw_15_8	(*(volatile byte xdata *) 0xF1A4)
#define    p_reg_bfs_fcw_15_8	0xF1A4 
#define	reg_bfs_fcw_15_8_pos 0
#define	reg_bfs_fcw_15_8_len 8
#define	reg_bfs_fcw_15_8_lsb 8
#define xd_p_reg_bfs_fcw_22_16	(*(volatile byte xdata *) 0xF1A5)
#define    p_reg_bfs_fcw_22_16	0xF1A5 
#define	reg_bfs_fcw_22_16_pos 0
#define	reg_bfs_fcw_22_16_len 7
#define	reg_bfs_fcw_22_16_lsb 16
#define xd_p_reg_cfoe_fcw_inv	(*(volatile byte xdata *) 0xF1A6)
#define    p_reg_cfoe_fcw_inv	0xF1A6 
#define	reg_cfoe_fcw_inv_pos 0
#define	reg_cfoe_fcw_inv_len 1
#define	reg_cfoe_fcw_inv_lsb 0
#define xd_p_reg_bfs_0if	(*(volatile byte xdata *) 0xF1A7)
#define    p_reg_bfs_0if	0xF1A7 
#define	reg_bfs_0if_pos 0
#define	reg_bfs_0if_len 1
#define	reg_bfs_0if_lsb 0
#define xd_p_reg_sadc_clk	(*(volatile byte xdata *) 0xF1A9)
#define    p_reg_sadc_clk	0xF1A9 
#define	reg_sadc_clk_pos 0
#define	reg_sadc_clk_len 1
#define	reg_sadc_clk_lsb 0
#define xd_p_reg_sadc_tx	(*(volatile byte xdata *) 0xF1AA)
#define    p_reg_sadc_tx	0xF1AA 
#define	reg_sadc_tx_pos 0
#define	reg_sadc_tx_len 1
#define	reg_sadc_tx_lsb 0
#define xd_p_reg_sadc_rx	(*(volatile byte xdata *) 0xF1AB)
#define    p_reg_sadc_rx	0xF1AB 
