liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_sadc_rx_pos 0
#define	reg_sadc_rx_len 1
#define	reg_sadc_rx_lsb 0
#define xd_p_reg_sadc_cs	(*(volatile byte xdata *) 0xF1AC)
#define    p_reg_sadc_cs	0xF1AC 
#define	reg_sadc_cs_pos 0
#define	reg_sadc_cs_len 1
#define	reg_sadc_cs_lsb 0
#define xd_p_reg_fix_fcw_7_0	(*(volatile byte xdata *) 0xF1AD)
#define    p_reg_fix_fcw_7_0	0xF1AD 
#define	reg_fix_fcw_7_0_pos 0
#define	reg_fix_fcw_7_0_len 8
#define	reg_fix_fcw_7_0_lsb 0
#define xd_p_reg_fix_fcw_15_8	(*(volatile byte xdata *) 0xF1AE)
#define    p_reg_fix_fcw_15_8	0xF1AE 
#define	reg_fix_fcw_15_8_pos 0
#define	reg_fix_fcw_15_8_len 8
#define	reg_fix_fcw_15_8_lsb 8
#define xd_p_reg_fix_fcw_22_16	(*(volatile byte xdata *) 0xF1AF)
#define    p_reg_fix_fcw_22_16	0xF1AF 
#define	reg_fix_fcw_22_16_pos 0
#define	reg_fix_fcw_22_16_len 7
#define	reg_fix_fcw_22_16_lsb 16
#define xd_r_reg_bfs_fcw_offset_7_0	(*(volatile byte xdata *) 0xF1B0)
#define    r_reg_bfs_fcw_offset_7_0	0xF1B0 
#define	reg_bfs_fcw_offset_7_0_pos 0
#define	reg_bfs_fcw_offset_7_0_len 8
#define	reg_bfs_fcw_offset_7_0_lsb 0
#define xd_r_reg_bfs_fcw_offset_15_8	(*(volatile byte xdata *) 0xF1B1)
#define    r_reg_bfs_fcw_offset_15_8	0xF1B1 
#define	reg_bfs_fcw_offset_15_8_pos 0
#define	reg_bfs_fcw_offset_15_8_len 8
#define	reg_bfs_fcw_offset_15_8_lsb 8
#define xd_r_reg_bfs_fcw_offset_22_16	(*(volatile byte xdata *) 0xF1B2)
#define    r_reg_bfs_fcw_offset_22_16	0xF1B2 
#define	reg_bfs_fcw_offset_22_16_pos 0
#define	reg_bfs_fcw_offset_22_16_len 7
#define	reg_bfs_fcw_offset_22_16_lsb 16
#define xd_r_bfs_fcw_q_7_0	(*(volatile byte xdata *) 0xF1B3)
#define    r_bfs_fcw_q_7_0	0xF1B3 
#define	bfs_fcw_q_7_0_pos 0
#define	bfs_fcw_q_7_0_len 8
#define	bfs_fcw_q_7_0_lsb 0
#define xd_r_bfs_fcw_q_15_8	(*(volatile byte xdata *) 0xF1B4)
#define    r_bfs_fcw_q_15_8	0xF1B4 
#define	bfs_fcw_q_15_8_pos 0
#define	bfs_fcw_q_15_8_len 8
#define	bfs_fcw_q_15_8_lsb 8
#define xd_r_bfs_fcw_q_22_16	(*(volatile byte xdata *) 0xF1B5)
#define    r_bfs_fcw_q_22_16	0xF1B5 
#define	bfs_fcw_q_22_16_pos 0
#define	bfs_fcw_q_22_16_len 7
#define	bfs_fcw_q_22_16_lsb 16
#define xd_p_reg_dagc3_use_despow	(*(volatile byte xdata *) 0xF1B6)
#define    p_reg_dagc3_use_despow	0xF1B6 
#define	reg_dagc3_use_despow_pos 0
#define	reg_dagc3_use_despow_len 1
#define	reg_dagc3_use_despow_lsb 0
#define xd_p_reg_dagc3_log_2_accumulate	(*(volatile byte xdata *) 0xF1B7)
#define    p_reg_dagc3_log_2_accumulate	0xF1B7 
#define	reg_dagc3_log_2_accumulate_pos 0
#define	reg_dagc3_log_2_accumulate_len 5
#define	reg_dagc3_log_2_accumulate_lsb 0
#define xd_p_reg_dagc3_desired_level_7_0	(*(volatile byte xdata *) 0xF1BC)
#define    p_reg_dagc3_desired_level_7_0	0xF1BC 
#define	reg_dagc3_desired_level_7_0_pos 0
#define	reg_dagc3_desired_level_7_0_len 8
#define	reg_dagc3_desired_level_7_0_lsb 0
#define xd_p_reg_dagc3_desired_level_8	(*(volatile byte xdata *) 0xF1BD)
#define    p_reg_dagc3_desired_level_8	0xF1BD 
#define	reg_dagc3_desired_level_8_pos 0
#define	reg_dagc3_desired_level_8_len 1
#define	reg_dagc3_desired_level_8_lsb 8
#define xd_p_reg_dagc3_apply_delay	(*(volatile byte xdata *) 0xF1BE)
#define    p_reg_dagc3_apply_delay	0xF1BE 
#define	reg_dagc3_apply_delay_pos 0
#define	reg_dagc3_apply_delay_len 7
#define	reg_dagc3_apply_delay_lsb 0
#define xd_p_reg_dagc3_bp_scale	(*(volatile byte xdata *) 0xF1BF)
#define    p_reg_dagc3_bp_scale	0xF1BF 
#define	reg_dagc3_bp_scale_pos 0
#define	reg_dagc3_bp_scale_len 3
#define	reg_dagc3_bp_scale_lsb 0
#define xd_p_reg_dagc3_in_sat_cnt_7_0	(*(volatile byte xdata *) 0xF1C0)
#define    p_reg_dagc3_in_sat_cnt_7_0	0xF1C0 
#define	reg_dagc3_in_sat_cnt_7_0_pos 0
#define	reg_dagc3_in_sat_cnt_7_0_len 8
#define	reg_dagc3_in_sat_cnt_7_0_lsb 0
#define xd_p_reg_dagc3_in_sat_cnt_15_8	(*(volatile byte xdata *) 0xF1C1)
#define    p_reg_dagc3_in_sat_cnt_15_8	0xF1C1 
#define	reg_dagc3_in_sat_cnt_15_8_pos 0
#define	reg_dagc3_in_sat_cnt_15_8_len 8
#define	reg_dagc3_in_sat_cnt_15_8_lsb 8
#define xd_p_reg_dagc3_in_sat_cnt_23_16	(*(volatile byte xdata *) 0xF1C2)
#define    p_reg_dagc3_in_sat_cnt_23_16	0xF1C2 
#define	reg_dagc3_in_sat_cnt_23_16_pos 0
#define	reg_dagc3_in_sat_cnt_23_16_len 8
#define	reg_dagc3_in_sat_cnt_23_16_lsb 16
#define xd_p_reg_dagc3_in_sat_cnt_31_24	(*(volatile byte xdata *) 0xF1C3)
#define    p_reg_dagc3_in_sat_cnt_31_24	0xF1C3 
#define	reg_dagc3_in_sat_cnt_31_24_pos 0
#define	reg_dagc3_in_sat_cnt_31_24_len 8
#define	reg_dagc3_in_sat_cnt_31_24_lsb 24
#define xd_p_reg_dagc3_out_sat_cnt_7_0	(*(volatile byte xdata *) 0xF1C4)
#define    p_reg_dagc3_out_sat_cnt_7_0	0xF1C4 
#define	reg_dagc3_out_sat_cnt_7_0_pos 0
#define	reg_dagc3_out_sat_cnt_7_0_len 8
#define	reg_dagc3_out_sat_cnt_7_0_lsb 0
#define xd_p_reg_dagc3_out_sat_cnt_15_8	(*(volatile byte xdata *) 0xF1C5)
#define    p_reg_dagc3_out_sat_cnt_15_8	0xF1C5 
#define	reg_dagc3_out_sat_cnt_15_8_pos 0
#define	reg_dagc3_out_sat_cnt_15_8_len 8
#define	reg_dagc3_out_sat_cnt_15_8_lsb 8
#define xd_p_reg_dagc3_out_sat_cnt_23_16	(*(volatile byte xdata *) 0xF1C6)
#define    p_reg_dagc3_out_sat_cnt_23_16	0xF1C6 
#define	reg_dagc3_out_sat_cnt_23_16_pos 0
#define	reg_dagc3_out_sat_cnt_23_16_len 8
#define	reg_dagc3_out_sat_cnt_23_16_lsb 16
#define xd_p_reg_dagc3_out_sat_cnt_31_24	(*(volatile byte xdata *) 0xF1C7)
#define    p_reg_dagc3_out_sat_cnt_31_24	0xF1C7 
#define	reg_dagc3_out_sat_cnt_31_24_pos 0
#define	reg_dagc3_out_sat_cnt_31_24_len 8
#define	reg_dagc3_out_sat_cnt_31_24_lsb 24
#define xd_r_bfs_dagc3_multiplier_7_0	(*(volatile byte xdata *) 0xF1C8)
#define    r_bfs_dagc3_multiplier_7_0	0xF1C8 
#define	bfs_dagc3_multiplier_7_0_pos 0
#define	bfs_dagc3_multiplier_7_0_len 8
#define	bfs_dagc3_multiplier_7_0_lsb 0
#define xd_r_bfs_dagc3_multiplier_15_8	(*(volatile byte xdata *) 0xF1C9)
#define    r_bfs_dagc3_multiplier_15_8	0xF1C9 
#define	bfs_dagc3_multiplier_15_8_pos 0
#define	bfs_dagc3_multiplier_15_8_len 8
#define	bfs_dagc3_multiplier_15_8_lsb 8
#define xd_r_bfs_dagc3_right_shift_bits	(*(volatile byte xdata *) 0xF1CA)
#define    r_bfs_dagc3_right_shift_bits	0xF1CA 
#define	bfs_dagc3_right_shift_bits_pos 0
#define	bfs_dagc3_right_shift_bits_len 4
#define	bfs_dagc3_right_shift_bits_lsb 0
#define xd_p_reg_dagc3_fixed_gain_7_0	(*(volatile byte xdata *) 0xF1CB)
#define    p_reg_dagc3_fixed_gain_7_0	0xF1CB 
#define	reg_dagc3_fixed_gain_7_0_pos 0
#define	reg_dagc3_fixed_gain_7_0_len 8
#define	reg_dagc3_fixed_gain_7_0_lsb 0
#define xd_p_reg_dagc3_fixed_gain_11_8	(*(volatile byte xdata *) 0xF1CC)
#define    p_reg_dagc3_fixed_gain_11_8	0xF1CC 
#define	reg_dagc3_fixed_gain_11_8_pos 0
#define	reg_dagc3_fixed_gain_11_8_len 4
#define	reg_dagc3_fixed_gain_11_8_lsb 8
#define xd_p_reg_f_adc_7_0	(*(volatile byte xdata *) 0xF1CD)
#define    p_reg_f_adc_7_0	0xF1CD 
#define	reg_f_adc_7_0_pos 0
#define	reg_f_adc_7_0_len 8
#define	reg_f_adc_7_0_lsb 0
#define xd_p_reg_f_adc_15_8	(*(volatile byte xdata *) 0xF1CE)
#define    p_reg_f_adc_15_8	0xF1CE 
#define	reg_f_adc_15_8_pos 0
#define	reg_f_adc_15_8_len 8
#define	reg_f_adc_15_8_lsb 8
#define xd_p_reg_f_adc_23_16	(*(volatile byte xdata *) 0xF1CF)
#define    p_reg_f_adc_23_16	0xF1CF 
#define	reg_f_adc_23_16_pos 0
#define	reg_f_adc_23_16_len 8
#define	reg_f_adc_23_16_lsb 16
#define xd_p_reg_fste_frac_step_size_7_0	(*(volatile byte xdata *) 0xF1D0)
#define    p_reg_fste_frac_step_size_7_0	0xF1D0 
#define	reg_fste_frac_step_size_7_0_pos 0
#define	reg_fste_frac_step_size_7_0_len 8
#define	reg_fste_frac_step_size_7_0_lsb 0
#define xd_p_reg_fste_frac_step_size_15_8	(*(volatile byte xdata *) 0xF1D1)
#define    p_reg_fste_frac_step_size_15_8	0xF1D1 
#define	reg_fste_frac_step_size_15_8_pos 0
#define	reg_fste_frac_step_size_15_8_len 8
#define	reg_fste_frac_step_size_15_8_lsb 8
#define xd_p_reg_fste_frac_step_size_19_16	(*(volatile byte xdata *) 0xF1D2)
#define    p_reg_fste_frac_step_size_19_16	0xF1D2 
#define	reg_fste_frac_step_size_19_16_pos 0
#define	reg_fste_frac_step_size_19_16_len 4
#define	reg_fste_frac_step_size_19_16_lsb 16
#define xd_r_intp_mu_7_0	(*(volatile byte xdata *) 0xF1D3)
#define    r_intp_mu_7_0	0xF1D3 
#define	intp_mu_7_0_pos 0
#define	intp_mu_7_0_len 8
#define	intp_mu_7_0_lsb 0
#define xd_r_intp_mu_15_8	(*(volatile byte xdata *) 0xF1D4)
#define    r_intp_mu_15_8	0xF1D4 
#define	intp_mu_15_8_pos 0
#define	intp_mu_15_8_len 8
#define	intp_mu_15_8_lsb 8
#define xd_r_intp_mu_23_16	(*(volatile byte xdata *) 0xF1D5)
#define    r_intp_mu_23_16	0xF1D5 
#define	intp_mu_23_16_pos 0
#define	intp_mu_23_16_len 8
#define	intp_mu_23_16_lsb 16
#define xd_r_intp_mu_25_24	(*(volatile byte xdata *) 0xF1D6)
#define    r_intp_mu_25_24	0xF1D6 
#define	intp_mu_25_24_pos 0
#define	intp_mu_25_24_len 2
#define	intp_mu_25_24_lsb 24
#define xd_p_intp_muq_7_0	(*(volatile byte xdata *) 0xF1D7)
#define    p_intp_muq_7_0	0xF1D7 
#define	intp_muq_7_0_pos 0
#define	intp_muq_7_0_len 8
#define	intp_muq_7_0_lsb 0
#define xd_p_intp_muq_15_8	(*(volatile byte xdata *) 0xF1D8)
#define    p_intp_muq_15_8	0xF1D8 
#define	intp_muq_15_8_pos 0
#define	intp_muq_15_8_len 8
#define	intp_muq_15_8_lsb 8
#define xd_p_intp_muq_23_16	(*(volatile byte xdata *) 0xF1D9)
#define    p_intp_muq_23_16	0xF1D9 
#define	intp_muq_23_16_pos 0
#define	intp_muq_23_16_len 8
#define	intp_muq_23_16_lsb 16
#define xd_p_reg_sfoe_inv	(*(volatile byte xdata *) 0xF1DA)
#define    p_reg_sfoe_inv	0xF1DA 
#define	reg_sfoe_inv_pos 0
#define	reg_sfoe_inv_len 1
#define	reg_sfoe_inv_lsb 0
#define xd_p_intp_ext_en	(*(volatile byte xdata *) 0xF1DB)
#define    p_intp_ext_en	0xF1DB 
#define	intp_ext_en_pos 0
#define	intp_ext_en_len 1
#define	intp_ext_en_lsb 0
#define xd_r_intp_ext_done	(*(volatile byte xdata *) 0xF1DC)
#define    r_intp_ext_done	0xF1DC 
#define	intp_ext_done_pos 0
#define	intp_ext_done_len 1
#define	intp_ext_done_lsb 0
#define xd_p_intp_ext_in_7_0	(*(volatile byte xdata *) 0xF1DD)
#define    p_intp_ext_in_7_0	0xF1DD 
#define	intp_ext_in_7_0_pos 0
#define	intp_ext_in_7_0_len 8
#define	intp_ext_in_7_0_lsb 0
#define xd_p_intp_ext_in_15_8	(*(volatile byte xdata *) 0xF1DE)
#define    p_intp_ext_in_15_8	0xF1DE 
#define	intp_ext_in_15_8_pos 0
#define	intp_ext_in_15_8_len 8
#define	intp_ext_in_15_8_lsb 8
#define xd_p_intp_ext_in_23_16	(*(volatile byte xdata *) 0xF1DF)
#define    p_intp_ext_in_23_16	0xF1DF 
#define	intp_ext_in_23_16_pos 0
#define	intp_ext_in_23_16_len 8
#define	intp_ext_in_23_16_lsb 16
#define xd_p_intp_ext_in_25_24	(*(volatile byte xdata *) 0xF1E0)
#define    p_intp_ext_in_25_24	0xF1E0 
#define	intp_ext_in_25_24_pos 0
#define	intp_ext_in_25_24_len 2
#define	intp_ext_in_25_24_lsb 24
#define xd_r_intp_ext_out_7_0	(*(volatile byte xdata *) 0xF1E1)
#define    r_intp_ext_out_7_0	0xF1E1 
#define	intp_ext_out_7_0_pos 0
#define	intp_ext_out_7_0_len 8
#define	intp_ext_out_7_0_lsb 0
#define xd_r_intp_ext_out_15_8	(*(volatile byte xdata *) 0xF1E2)
#define    r_intp_ext_out_15_8	0xF1E2 
#define	intp_ext_out_15_8_pos 0
#define	intp_ext_out_15_8_len 8
#define	intp_ext_out_15_8_lsb 8
#define xd_r_intp_ext_out_23_16	(*(volatile byte xdata *) 0xF1E3)
#define    r_intp_ext_out_23_16	0xF1E3 
#define	intp_ext_out_23_16_pos 0
#define	intp_ext_out_23_16_len 8
#define	intp_ext_out_23_16_lsb 16
#define xd_r_intp_ext_out_28_24	(*(volatile byte xdata *) 0xF1E4)
#define    r_intp_ext_out_28_24	0xF1E4 
#define	intp_ext_out_28_24_pos 0
#define	intp_ext_out_28_24_len 5
#define	intp_ext_out_28_24_lsb 24
#define xd_p_reg_agc_rst	(*(volatile byte xdata *) 0xF1E5)
#define    p_reg_agc_rst	0xF1E5 
#define	reg_agc_rst_pos 0
#define	reg_agc_rst_len 1
#define	reg_agc_rst_lsb 0
#define xd_p_agc_lock	(*(volatile byte xdata *) 0xF1E7)
#define    p_agc_lock	0xF1E7 
#define	agc_lock_pos 0
#define	agc_lock_len 1
#define	agc_lock_lsb 0
#define xd_p_reg_tinr_rst	(*(volatile byte xdata *) 0xF1E8)
#define    p_reg_tinr_rst	0xF1E8 
#define	reg_tinr_rst_pos 0
#define	reg_tinr_rst_len 1
#define	reg_tinr_rst_lsb 0
#define xd_p_reg_tinr_en	(*(volatile byte xdata *) 0xF1E9)
#define    p_reg_tinr_en	0xF1E9 
#define	reg_tinr_en_pos 0
#define	reg_tinr_en_len 1
#define	reg_tinr_en_lsb 0
#define xd_p_reg_bfs_en	(*(volatile byte xdata *) 0xF1EA)
#define    p_reg_bfs_en	0xF1EA 
#define	reg_bfs_en_pos 0
#define	reg_bfs_en_len 1
#define	reg_bfs_en_lsb 0
#define xd_p_reg_bfs_rst	(*(volatile byte xdata *) 0xF1EB)
#define    p_reg_bfs_rst	0xF1EB 
#define	reg_bfs_rst_pos 0
#define	reg_bfs_rst_len 1
#define	reg_bfs_rst_lsb 0
#define xd_p_reg_bfs_byp	(*(volatile byte xdata *) 0xF1EC)
#define    p_reg_bfs_byp	0xF1EC 
#define	reg_bfs_byp_pos 0
#define	reg_bfs_byp_len 1
#define	reg_bfs_byp_lsb 0
#define xd_p_intp_en	(*(volatile byte xdata *) 0xF1EF)
#define    p_intp_en	0xF1EF 
#define	intp_en_pos 0
#define	intp_en_len 1
#define	intp_en_lsb 0
#define xd_p_intp_rst	(*(volatile byte xdata *) 0xF1F0)
#define    p_intp_rst	0xF1F0 
#define	intp_rst_pos 0
#define	intp_rst_len 1
#define	intp_rst_lsb 0
#define xd_p_reg_p_acif_en	(*(volatile byte xdata *) 0xF1F2)
#define    p_reg_p_acif_en	0xF1F2 
#define	reg_p_acif_en_pos 0
#define	reg_p_acif_en_len 1
#define	reg_p_acif_en_lsb 0
#define xd_p_reg_p_acif_rst	(*(volatile byte xdata *) 0xF1F3)
#define    p_reg_p_acif_rst	0xF1F3 
#define	reg_p_acif_rst_pos 0
#define	reg_p_acif_rst_len 1
#define	reg_p_acif_rst_lsb 0
#define xd_p_reg_p_acif_byp	(*(volatile byte xdata *) 0xF1F4)
#define    p_reg_p_acif_byp	0xF1F4 
#define	reg_p_acif_byp_pos 0
#define	reg_p_acif_byp_len 1
#define	reg_p_acif_byp_lsb 0
#define xd_p_dagc2_rst	(*(volatile byte xdata *) 0xF1F6)
#define    p_dagc2_rst	0xF1F6 
#define	dagc2_rst_pos 0
#define	dagc2_rst_len 1
#define	dagc2_rst_lsb 0
#define xd_p_dagc2_en	(*(volatile byte xdata *) 0xF1F7)
#define    p_dagc2_en	0xF1F7 
#define	dagc2_en_pos 0
#define	dagc2_en_len 1
#define	dagc2_en_lsb 0
#define xd_p_dagc2_mode	(*(volatile byte xdata *) 0xF1F8)
#define    p_dagc2_mode	0xF1F8 
#define	dagc2_mode_pos 0
#define	dagc2_mode_len 2
#define	dagc2_mode_lsb 0
#define xd_p_dagc2_done	(*(volatile byte xdata *) 0xF1F9)
#define    p_dagc2_done	0xF1F9 
#define	dagc2_done_pos 0
#define	dagc2_done_len 1
#define	dagc2_done_lsb 0
#define xd_p_dagc3_rst	(*(volatile byte xdata *) 0xF1FA)
#define    p_dagc3_rst	0xF1FA 
#define	dagc3_rst_pos 0
#define	dagc3_rst_len 1
#define	dagc3_rst_lsb 0
#define xd_p_dagc3_en	(*(volatile byte xdata *) 0xF1FB)
#define    p_dagc3_en	0xF1FB 
#define	dagc3_en_pos 0
#define	dagc3_en_len 1
#define	dagc3_en_lsb 0
#define xd_p_dagc3_mode	(*(volatile byte xdata *) 0xF1FC)
#define    p_dagc3_mode	0xF1FC 
#define	dagc3_mode_pos 0
#define	dagc3_mode_len 2
#define	dagc3_mode_lsb 0
#define xd_p_dagc3_done	(*(volatile byte xdata *) 0xF1FD)
#define    p_dagc3_done	0xF1FD 
#define	dagc3_done_pos 0
#define	dagc3_done_len 1
#define	dagc3_done_lsb 0
#define xd_p_reg_dagc2_desired_level_7_0	(*(volatile byte xdata *) 0xF202)
#define    p_reg_dagc2_desired_level_7_0	0xF202 
#define	reg_dagc2_desired_level_7_0_pos 0
#define	reg_dagc2_desired_level_7_0_len 8
#define	reg_dagc2_desired_level_7_0_lsb 0
#define xd_p_reg_dagc2_desired_level_8	(*(volatile byte xdata *) 0xF203)
#define    p_reg_dagc2_desired_level_8	0xF203 
#define	reg_dagc2_desired_level_8_pos 0
#define	reg_dagc2_desired_level_8_len 1
#define	reg_dagc2_desired_level_8_lsb 8
#define xd_p_reg_dagc2_apply_delay	(*(volatile byte xdata *) 0xF204)
#define    p_reg_dagc2_apply_delay	0xF204 
#define	reg_dagc2_apply_delay_pos 0
#define	reg_dagc2_apply_delay_len 7
#define	reg_dagc2_apply_delay_lsb 0
#define xd_p_reg_dagc2_bypass_scale_ctl	(*(volatile byte xdata *) 0xF205)
#define    p_reg_dagc2_bypass_scale_ctl	0xF205 
#define	reg_dagc2_bypass_scale_ctl_pos 0
#define	reg_dagc2_bypass_scale_ctl_len 3
#define	reg_dagc2_bypass_scale_ctl_lsb 0
#define xd_p_reg_dagc2_programmable_shift2	(*(volatile byte xdata *) 0xF206)
#define    p_reg_dagc2_programmable_shift2	0xF206 
#define	reg_dagc2_programmable_shift2_pos 0
#define	reg_dagc2_programmable_shift2_len 8
#define	reg_dagc2_programmable_shift2_lsb 0
#define xd_p_reg_dagc2_in_sat_cnt_7_0	(*(volatile byte xdata *) 0xF207)
#define    p_reg_dagc2_in_sat_cnt_7_0	0xF207 
#define	reg_dagc2_in_sat_cnt_7_0_pos 0
#define	reg_dagc2_in_sat_cnt_7_0_len 8
#define	reg_dagc2_in_sat_cnt_7_0_lsb 0
#define xd_p_reg_dagc2_in_sat_cnt_15_8	(*(volatile byte xdata *) 0xF208)
#define    p_reg_dagc2_in_sat_cnt_15_8	0xF208 
#define	reg_dagc2_in_sat_cnt_15_8_pos 0
#define	reg_dagc2_in_sat_cnt_15_8_len 8
#define	reg_dagc2_in_sat_cnt_15_8_lsb 8
#define xd_p_reg_dagc2_in_sat_cnt_23_16	(*(volatile byte xdata *) 0xF209)
#define    p_reg_dagc2_in_sat_cnt_23_16	0xF209 
#define	reg_dagc2_in_sat_cnt_23_16_pos 0
#define	reg_dagc2_in_sat_cnt_23_16_len 8
#define	reg_dagc2_in_sat_cnt_23_16_lsb 16
#define xd_p_reg_dagc2_in_sat_cnt_31_24	(*(volatile byte xdata *) 0xF20A)
#define    p_reg_dagc2_in_sat_cnt_31_24	0xF20A 
#define	reg_dagc2_in_sat_cnt_31_24_pos 0
#define	reg_dagc2_in_sat_cnt_31_24_len 8
#define	reg_dagc2_in_sat_cnt_31_24_lsb 24
#define xd_p_reg_dagc2_out_sat_cnt_7_0	(*(volatile byte xdata *) 0xF20B)
#define    p_reg_dagc2_out_sat_cnt_7_0	0xF20B 
#define	reg_dagc2_out_sat_cnt_7_0_pos 0
#define	reg_dagc2_out_sat_cnt_7_0_len 8
#define	reg_dagc2_out_sat_cnt_7_0_lsb 0
#define xd_p_reg_dagc2_out_sat_cnt_15_8	(*(volatile byte xdata *) 0xF20C)
#define    p_reg_dagc2_out_sat_cnt_15_8	0xF20C 
#define	reg_dagc2_out_sat_cnt_15_8_pos 0
#define	reg_dagc2_out_sat_cnt_15_8_len 8
#define	reg_dagc2_out_sat_cnt_15_8_lsb 8
#define xd_p_reg_dagc2_out_sat_cnt_23_16	(*(volatile byte xdata *) 0xF20D)
#define    p_reg_dagc2_out_sat_cnt_23_16	0xF20D 
#define	reg_dagc2_out_sat_cnt_23_16_pos 0
#define	reg_dagc2_out_sat_cnt_23_16_len 8
#define	reg_dagc2_out_sat_cnt_23_16_lsb 16
#define xd_p_reg_dagc2_out_sat_cnt_31_24	(*(volatile byte xdata *) 0xF20E)
#define    p_reg_dagc2_out_sat_cnt_31_24	0xF20E 
#define	reg_dagc2_out_sat_cnt_31_24_pos 0
#define	reg_dagc2_out_sat_cnt_31_24_len 8
#define	reg_dagc2_out_sat_cnt_31_24_lsb 24
#define xd_r_reg_dagc2_multiplier_7_0	(*(volatile byte xdata *) 0xF20F)
#define    r_reg_dagc2_multiplier_7_0	0xF20F 
#define	reg_dagc2_multiplier_7_0_pos 0
#define	reg_dagc2_multiplier_7_0_len 8
#define	reg_dagc2_multiplier_7_0_lsb 0
#define xd_r_reg_dagc2_multiplier_15_8	(*(volatile byte xdata *) 0xF210)
#define    r_reg_dagc2_multiplier_15_8	0xF210 
#define	reg_dagc2_multiplier_15_8_pos 0
#define	reg_dagc2_multiplier_15_8_len 8
#define	reg_dagc2_multiplier_15_8_lsb 8
#define xd_r_reg_dagc2_right_shift_bits	(*(volatile byte xdata *) 0xF211)
#define    r_reg_dagc2_right_shift_bits	0xF211 
#define	reg_dagc2_right_shift_bits_pos 0
#define	reg_dagc2_right_shift_bits_len 4
#define	reg_dagc2_right_shift_bits_lsb 0
#define xd_p_reg_dagc2_smbuf_err	(*(volatile byte xdata *) 0xF212)
#define    p_reg_dagc2_smbuf_err	0xF212 
#define	reg_dagc2_smbuf_err_pos 0
#define	reg_dagc2_smbuf_err_len 1
#define	reg_dagc2_smbuf_err_lsb 0
#define xd_p_reg_dagc2_cplxconj	(*(volatile byte xdata *) 0xF213)
#define    p_reg_dagc2_cplxconj	0xF213 
#define	reg_dagc2_cplxconj_pos 0
#define	reg_dagc2_cplxconj_len 1
#define	reg_dagc2_cplxconj_lsb 0
#define xd_p_reg_dagc2_use_despow	(*(volatile byte xdata *) 0xF214)
#define    p_reg_dagc2_use_despow	0xF214 
#define	reg_dagc2_use_despow_pos 0
#define	reg_dagc2_use_despow_len 1
#define	reg_dagc2_use_despow_lsb 0
#define xd_p_reg_dagc2_log_2_accumulate	(*(volatile byte xdata *) 0xF215)
#define    p_reg_dagc2_log_2_accumulate	0xF215 
#define	reg_dagc2_log_2_accumulate_pos 0
#define	reg_dagc2_log_2_accumulate_len 5
#define	reg_dagc2_log_2_accumulate_lsb 0
#define xd_r_dagc2_dca_gain	(*(volatile byte xdata *) 0xF216)
#define    r_dagc2_dca_gain	0xF216 
#define	dagc2_dca_gain_pos 0
#define	dagc2_dca_gain_len 8
#define	dagc2_dca_gain_lsb 0
#define xd_p_reg_dca_gain_offset	(*(volatile byte xdata *) 0xF217)
#define    p_reg_dca_gain_offset	0xF217 
#define	reg_dca_gain_offset_pos 0
#define	reg_dca_gain_offset_len 8
#define	reg_dca_gain_offset_lsb 0
#define xd_p_reg_dagc2_FG_mode	(*(volatile byte xdata *) 0xF218)
#define    p_reg_dagc2_FG_mode	0xF218 
#define	reg_dagc2_FG_mode_pos 0
#define	reg_dagc2_FG_mode_len 1
#define	reg_dagc2_FG_mode_lsb 0
#define xd_p_reg_dagc2_fixed_gain_7_0	(*(volatile byte xdata *) 0xF219)
#define    p_reg_dagc2_fixed_gain_7_0	0xF219 
#define	reg_dagc2_fixed_gain_7_0_pos 0
#define	reg_dagc2_fixed_gain_7_0_len 8
#define	reg_dagc2_fixed_gain_7_0_lsb 0
#define xd_p_reg_dagc2_fixed_gain_11_8	(*(volatile byte xdata *) 0xF21A)
#define    p_reg_dagc2_fixed_gain_11_8	0xF21A 
#define	reg_dagc2_fixed_gain_11_8_pos 0
#define	reg_dagc2_fixed_gain_11_8_len 4
#define	reg_dagc2_fixed_gain_11_8_lsb 8
#define xd_p_reg_td_debug_7_0	(*(volatile byte xdata *) 0xF21B)
#define    p_reg_td_debug_7_0	0xF21B 
#define	reg_td_debug_7_0_pos 0
#define	reg_td_debug_7_0_len 8
#define	reg_td_debug_7_0_lsb 0
#define xd_p_reg_td_debug_15_8	(*(volatile byte xdata *) 0xF21C)
#define    p_reg_td_debug_15_8	0xF21C 
#define	reg_td_debug_15_8_pos 0
#define	reg_td_debug_15_8_len 8
#define	reg_td_debug_15_8_lsb 8
#define xd_p_reg_td_debug_23_16	(*(volatile byte xdata *) 0xF21D)
#define    p_reg_td_debug_23_16	0xF21D 
#define	reg_td_debug_23_16_pos 0
#define	reg_td_debug_23_16_len 8
#define	reg_td_debug_23_16_lsb 16
#define xd_p_reg_td_debug_30_24	(*(volatile byte xdata *) 0xF21E)
#define    p_reg_td_debug_30_24	0xF21E 
#define	reg_td_debug_30_24_pos 0
#define	reg_td_debug_30_24_len 7
#define	reg_td_debug_30_24_lsb 24
#define xd_p_reg_dagc2_finish	(*(volatile byte xdata *) 0xF220)
#define    p_reg_dagc2_finish	0xF220 
#define	reg_dagc2_finish_pos 0
#define	reg_dagc2_finish_len 1
#define	reg_dagc2_finish_lsb 0
#define xd_r_reg_dagc2_Sx_7_0	(*(volatile byte xdata *) 0xF221)
#define    r_reg_dagc2_Sx_7_0	0xF221 
#define	reg_dagc2_Sx_7_0_pos 0
#define	reg_dagc2_Sx_7_0_len 8
#define	reg_dagc2_Sx_7_0_lsb 0
#define xd_r_reg_dagc2_Sx_15_8	(*(volatile byte xdata *) 0xF222)
#define    r_reg_dagc2_Sx_15_8	0xF222 
#define	reg_dagc2_Sx_15_8_pos 0
#define	reg_dagc2_Sx_15_8_len 8
#define	reg_dagc2_Sx_15_8_lsb 8
#define xd_r_reg_dagc2_Sx_22_16	(*(volatile byte xdata *) 0xF223)
#define    r_reg_dagc2_Sx_22_16	0xF223 
#define	reg_dagc2_Sx_22_16_pos 0
#define	reg_dagc2_Sx_22_16_len 7
#define	reg_dagc2_Sx_22_16_lsb 16
#define xd_r_reg_dagc2_Sy_7_0	(*(volatile byte xdata *) 0xF224)
#define    r_reg_dagc2_Sy_7_0	0xF224 
#define	reg_dagc2_Sy_7_0_pos 0
#define	reg_dagc2_Sy_7_0_len 8
#define	reg_dagc2_Sy_7_0_lsb 0
#define xd_r_reg_dagc2_Sy_15_8	(*(volatile byte xdata *) 0xF225)
#define    r_reg_dagc2_Sy_15_8	0xF225 
#define	reg_dagc2_Sy_15_8_pos 0
#define	reg_dagc2_Sy_15_8_len 8
#define	reg_dagc2_Sy_15_8_lsb 8
#define xd_r_reg_dagc2_Sy_23_16	(*(volatile byte xdata *) 0xF226)
#define    r_reg_dagc2_Sy_23_16	0xF226 
#define	reg_dagc2_Sy_23_16_pos 0
#define	reg_dagc2_Sy_23_16_len 8
#define	reg_dagc2_Sy_23_16_lsb 16
#define xd_r_reg_dagc2_Sy_25_24	(*(volatile byte xdata *) 0xF227)
#define    r_reg_dagc2_Sy_25_24	0xF227 
#define	reg_dagc2_Sy_25_24_pos 0
#define	reg_dagc2_Sy_25_24_len 2
#define	reg_dagc2_Sy_25_24_lsb 24
#define xd_p_reg_p_channel_env	(*(volatile byte xdata *) 0xF242)
#define    p_reg_p_channel_env	0xF242 
#define	reg_p_channel_env_pos 0
#define	reg_p_channel_env_len 3
#define	reg_p_channel_env_lsb 0
#define xd_p_reg_p_rssi_ka	(*(volatile byte xdata *) 0xF243)
#define    p_reg_p_rssi_ka	0xF243 
#define	reg_p_rssi_ka_pos 0
#define	reg_p_rssi_ka_len 6
#define	reg_p_rssi_ka_lsb 0
#define xd_p_reg_p_rssi_kb	(*(volatile byte xdata *) 0xF244)
#define    p_reg_p_rssi_kb	0xF244 
#define	reg_p_rssi_kb_pos 0
#define	reg_p_rssi_kb_len 8
#define	reg_p_rssi_kb_lsb 0
#define xd_p_reg_p_rssi_par_correction	(*(volatile byte xdata *) 0xF245)
#define    p_reg_p_rssi_par_correction	0xF245 
#define	reg_p_rssi_par_correction_pos 0
#define	reg_p_rssi_par_correction_len 8
#define	reg_p_rssi_par_correction_lsb 0
#define xd_p_reg_p_rssi_msb_inv	(*(volatile byte xdata *) 0xF246)
#define    p_reg_p_rssi_msb_inv	0xF246 
#define	reg_p_rssi_msb_inv_pos 0
#define	reg_p_rssi_msb_inv_len 1
#define	reg_p_rssi_msb_inv_lsb 0
#define xd_p_reg_p_rssi_log_2_accu	(*(volatile byte xdata *) 0xF247)
#define    p_reg_p_rssi_log_2_accu	0xF247 
