liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_p_rssi_log_2_accu_pos 0
#define	reg_p_rssi_log_2_accu_len 2
#define	reg_p_rssi_log_2_accu_lsb 0
#define xd_p_reg_p_rssi_median_length	(*(volatile byte xdata *) 0xF248)
#define    p_reg_p_rssi_median_length	0xF248 
#define	reg_p_rssi_median_length_pos 0
#define	reg_p_rssi_median_length_len 3
#define	reg_p_rssi_median_length_lsb 0
#define xd_p_reg_p_rf_agc_mode	(*(volatile byte xdata *) 0xF249)
#define    p_reg_p_rf_agc_mode	0xF249 
#define	reg_p_rf_agc_mode_pos 0
#define	reg_p_rf_agc_mode_len 2
#define	reg_p_rf_agc_mode_lsb 0
#define xd_p_reg_p_rf_agc_run	(*(volatile byte xdata *) 0xF24A)
#define    p_reg_p_rf_agc_run	0xF24A 
#define	reg_p_rf_agc_run_pos 0
#define	reg_p_rf_agc_run_len 1
#define	reg_p_rf_agc_run_lsb 0
#define xd_p_reg_p_rf_agc_run_times	(*(volatile byte xdata *) 0xF24B)
#define    p_reg_p_rf_agc_run_times	0xF24B 
#define	reg_p_rf_agc_run_times_pos 0
#define	reg_p_rf_agc_run_times_len 6
#define	reg_p_rf_agc_run_times_lsb 0
#define xd_p_reg_p_rssi_target_env0	(*(volatile byte xdata *) 0xF24C)
#define    p_reg_p_rssi_target_env0	0xF24C 
#define	reg_p_rssi_target_env0_pos 0
#define	reg_p_rssi_target_env0_len 8
#define	reg_p_rssi_target_env0_lsb 0
#define xd_p_reg_p_rssi_target_env1	(*(volatile byte xdata *) 0xF24D)
#define    p_reg_p_rssi_target_env1	0xF24D 
#define	reg_p_rssi_target_env1_pos 0
#define	reg_p_rssi_target_env1_len 8
#define	reg_p_rssi_target_env1_lsb 0
#define xd_p_reg_p_rssi_target_env2	(*(volatile byte xdata *) 0xF24E)
#define    p_reg_p_rssi_target_env2	0xF24E 
#define	reg_p_rssi_target_env2_pos 0
#define	reg_p_rssi_target_env2_len 8
#define	reg_p_rssi_target_env2_lsb 0
#define xd_p_reg_p_rssi_target_env3	(*(volatile byte xdata *) 0xF24F)
#define    p_reg_p_rssi_target_env3	0xF24F 
#define	reg_p_rssi_target_env3_pos 0
#define	reg_p_rssi_target_env3_len 8
#define	reg_p_rssi_target_env3_lsb 0
#define xd_p_reg_p_rf_pow_lockwin_width	(*(volatile byte xdata *) 0xF250)
#define    p_reg_p_rf_pow_lockwin_width	0xF250 
#define	reg_p_rf_pow_lockwin_width_pos 0
#define	reg_p_rf_pow_lockwin_width_len 6
#define	reg_p_rf_pow_lockwin_width_lsb 0
#define xd_p_reg_p_rf_agc_lock_th	(*(volatile byte xdata *) 0xF251)
#define    p_reg_p_rf_agc_lock_th	0xF251 
#define	reg_p_rf_agc_lock_th_pos 0
#define	reg_p_rf_agc_lock_th_len 6
#define	reg_p_rf_agc_lock_th_lsb 0
#define xd_p_reg_p_rf_lna_gain	(*(volatile byte xdata *) 0xF252)
#define    p_reg_p_rf_lna_gain	0xF252 
#define	reg_p_rf_lna_gain_pos 0
#define	reg_p_rf_lna_gain_len 3
#define	reg_p_rf_lna_gain_lsb 0
#define xd_p_reg_p_rf_pgc_gain	(*(volatile byte xdata *) 0xF253)
#define    p_reg_p_rf_pgc_gain	0xF253 
#define	reg_p_rf_pgc_gain_pos 0
#define	reg_p_rf_pgc_gain_len 3
#define	reg_p_rf_pgc_gain_lsb 0
#define xd_p_reg_p_rf_skip_vld_num	(*(volatile byte xdata *) 0xF254)
#define    p_reg_p_rf_skip_vld_num	0xF254 
#define	reg_p_rf_skip_vld_num_pos 0
#define	reg_p_rf_skip_vld_num_len 8
#define	reg_p_rf_skip_vld_num_lsb 0
#define xd_p_reg_p_aaci_detect1_run	(*(volatile byte xdata *) 0xF255)
#define    p_reg_p_aaci_detect1_run	0xF255 
#define	reg_p_aaci_detect1_run_pos 0
#define	reg_p_aaci_detect1_run_len 1
#define	reg_p_aaci_detect1_run_lsb 0
#define xd_p_reg_p_aaci_detect1_upper_th_7_0	(*(volatile byte xdata *) 0xF256)
#define    p_reg_p_aaci_detect1_upper_th_7_0	0xF256 
#define	reg_p_aaci_detect1_upper_th_7_0_pos 0
#define	reg_p_aaci_detect1_upper_th_7_0_len 8
#define	reg_p_aaci_detect1_upper_th_7_0_lsb 0
#define xd_p_reg_p_aaci_detect1_upper_th_9_8	(*(volatile byte xdata *) 0xF257)
#define    p_reg_p_aaci_detect1_upper_th_9_8	0xF257 
#define	reg_p_aaci_detect1_upper_th_9_8_pos 0
#define	reg_p_aaci_detect1_upper_th_9_8_len 2
#define	reg_p_aaci_detect1_upper_th_9_8_lsb 8
#define xd_p_reg_p_aaci_detect1_lower_th_7_0	(*(volatile byte xdata *) 0xF258)
#define    p_reg_p_aaci_detect1_lower_th_7_0	0xF258 
#define	reg_p_aaci_detect1_lower_th_7_0_pos 0
#define	reg_p_aaci_detect1_lower_th_7_0_len 8
#define	reg_p_aaci_detect1_lower_th_7_0_lsb 0
#define xd_p_reg_p_aaci_detect1_lower_th_9_8	(*(volatile byte xdata *) 0xF259)
#define    p_reg_p_aaci_detect1_lower_th_9_8	0xF259 
#define	reg_p_aaci_detect1_lower_th_9_8_pos 0
#define	reg_p_aaci_detect1_lower_th_9_8_len 2
#define	reg_p_aaci_detect1_lower_th_9_8_lsb 8
#define xd_p_reg_p_aaci_detect1_log_2_len	(*(volatile byte xdata *) 0xF25A)
#define    p_reg_p_aaci_detect1_log_2_len	0xF25A 
#define	reg_p_aaci_detect1_log_2_len_pos 0
#define	reg_p_aaci_detect1_log_2_len_len 3
#define	reg_p_aaci_detect1_log_2_len_lsb 0
#define xd_p_reg_p_aaci_detect1_upper_width_7_0	(*(volatile byte xdata *) 0xF25B)
#define    p_reg_p_aaci_detect1_upper_width_7_0	0xF25B 
#define	reg_p_aaci_detect1_upper_width_7_0_pos 0
#define	reg_p_aaci_detect1_upper_width_7_0_len 8
#define	reg_p_aaci_detect1_upper_width_7_0_lsb 0
#define xd_p_reg_p_aaci_detect1_upper_width_11_8	(*(volatile byte xdata *) 0xF25C)
#define    p_reg_p_aaci_detect1_upper_width_11_8	0xF25C 
#define	reg_p_aaci_detect1_upper_width_11_8_pos 0
#define	reg_p_aaci_detect1_upper_width_11_8_len 4
#define	reg_p_aaci_detect1_upper_width_11_8_lsb 8
#define xd_p_reg_p_aaci_detect1_lower_width_7_0	(*(volatile byte xdata *) 0xF25D)
#define    p_reg_p_aaci_detect1_lower_width_7_0	0xF25D 
#define	reg_p_aaci_detect1_lower_width_7_0_pos 0
#define	reg_p_aaci_detect1_lower_width_7_0_len 8
#define	reg_p_aaci_detect1_lower_width_7_0_lsb 0
#define xd_p_reg_p_aaci_detect1_lower_width_11_8	(*(volatile byte xdata *) 0xF25E)
#define    p_reg_p_aaci_detect1_lower_width_11_8	0xF25E 
#define	reg_p_aaci_detect1_lower_width_11_8_pos 0
#define	reg_p_aaci_detect1_lower_width_11_8_len 4
#define	reg_p_aaci_detect1_lower_width_11_8_lsb 8
#define xd_p_reg_p_aaci_detect2_run	(*(volatile byte xdata *) 0xF25F)
#define    p_reg_p_aaci_detect2_run	0xF25F 
#define	reg_p_aaci_detect2_run_pos 0
#define	reg_p_aaci_detect2_run_len 1
#define	reg_p_aaci_detect2_run_lsb 0
#define xd_p_reg_p_aaci_detect2_length	(*(volatile byte xdata *) 0xF260)
#define    p_reg_p_aaci_detect2_length	0xF260 
#define	reg_p_aaci_detect2_length_pos 0
#define	reg_p_aaci_detect2_length_len 8
#define	reg_p_aaci_detect2_length_lsb 0
#define xd_p_reg_p_bb_agc_mode	(*(volatile byte xdata *) 0xF261)
#define    p_reg_p_bb_agc_mode	0xF261 
#define	reg_p_bb_agc_mode_pos 0
#define	reg_p_bb_agc_mode_len 2
#define	reg_p_bb_agc_mode_lsb 0
#define xd_p_reg_p_bb_agc_gain_tu_hold	(*(volatile byte xdata *) 0xF262)
#define    p_reg_p_bb_agc_gain_tu_hold	0xF262 
#define	reg_p_bb_agc_gain_tu_hold_pos 0
#define	reg_p_bb_agc_gain_tu_hold_len 1
#define	reg_p_bb_agc_gain_tu_hold_lsb 0
#define xd_r_reg_r_aaci_detect2_max	(*(volatile byte xdata *) 0xF264)
#define    r_reg_r_aaci_detect2_max	0xF264 
#define	reg_r_aaci_detect2_max_pos 0
#define	reg_r_aaci_detect2_max_len 8
#define	reg_r_aaci_detect2_max_lsb 0
#define xd_r_reg_r_aaci_detect2_min	(*(volatile byte xdata *) 0xF265)
#define    r_reg_r_aaci_detect2_min	0xF265 
#define	reg_r_aaci_detect2_min_pos 0
#define	reg_r_aaci_detect2_min_len 8
#define	reg_r_aaci_detect2_min_lsb 0
#define xd_r_reg_r_bb_agc_lock	(*(volatile byte xdata *) 0xF266)
#define    r_reg_r_bb_agc_lock	0xF266 
#define	reg_r_bb_agc_lock_pos 0
#define	reg_r_bb_agc_lock_len 1
#define	reg_r_bb_agc_lock_lsb 0
#define xd_r_reg_r_rf_agc_lock	(*(volatile byte xdata *) 0xF267)
#define    r_reg_r_rf_agc_lock	0xF267 
#define	reg_r_rf_agc_lock_pos 0
#define	reg_r_rf_agc_lock_len 1
#define	reg_r_rf_agc_lock_lsb 0
#define xd_p_reg_p_bb_log_2_acc	(*(volatile byte xdata *) 0xF269)
#define    p_reg_p_bb_log_2_acc	0xF269 
#define	reg_p_bb_log_2_acc_pos 0
#define	reg_p_bb_log_2_acc_len 3
#define	reg_p_bb_log_2_acc_lsb 0
#define xd_p_reg_p_bb_delay_after_apply	(*(volatile byte xdata *) 0xF26A)
#define    p_reg_p_bb_delay_after_apply	0xF26A 
#define	reg_p_bb_delay_after_apply_pos 0
#define	reg_p_bb_delay_after_apply_len 5
#define	reg_p_bb_delay_after_apply_lsb 0
#define xd_p_reg_p_bb_accu_err_mode	(*(volatile byte xdata *) 0xF26B)
#define    p_reg_p_bb_accu_err_mode	0xF26B 
#define	reg_p_bb_accu_err_mode_pos 0
#define	reg_p_bb_accu_err_mode_len 2
#define	reg_p_bb_accu_err_mode_lsb 0
#define xd_p_reg_p_bb_increase_second_th	(*(volatile byte xdata *) 0xF26C)
#define    p_reg_p_bb_increase_second_th	0xF26C 
#define	reg_p_bb_increase_second_th_pos 0
#define	reg_p_bb_increase_second_th_len 6
#define	reg_p_bb_increase_second_th_lsb 0
#define xd_p_reg_p_bb_increase_first_th	(*(volatile byte xdata *) 0xF26D)
#define    p_reg_p_bb_increase_first_th	0xF26D 
#define	reg_p_bb_increase_first_th_pos 0
#define	reg_p_bb_increase_first_th_len 6
#define	reg_p_bb_increase_first_th_lsb 0
#define xd_p_reg_p_bb_decrease_second_th	(*(volatile byte xdata *) 0xF26E)
#define    p_reg_p_bb_decrease_second_th	0xF26E 
#define	reg_p_bb_decrease_second_th_pos 0
#define	reg_p_bb_decrease_second_th_len 6
#define	reg_p_bb_decrease_second_th_lsb 0
#define xd_p_reg_p_bb_decrease_first_th	(*(volatile byte xdata *) 0xF26F)
#define    p_reg_p_bb_decrease_first_th	0xF26F 
#define	reg_p_bb_decrease_first_th_pos 0
#define	reg_p_bb_decrease_first_th_len 6
#define	reg_p_bb_decrease_first_th_lsb 0
#define xd_p_reg_p_bb_increase_first_value	(*(volatile byte xdata *) 0xF270)
#define    p_reg_p_bb_increase_first_value	0xF270 
#define	reg_p_bb_increase_first_value_pos 0
#define	reg_p_bb_increase_first_value_len 6
#define	reg_p_bb_increase_first_value_lsb 0
#define xd_p_reg_p_bb_increase_second_value	(*(volatile byte xdata *) 0xF271)
#define    p_reg_p_bb_increase_second_value	0xF271 
#define	reg_p_bb_increase_second_value_pos 0
#define	reg_p_bb_increase_second_value_len 6
#define	reg_p_bb_increase_second_value_lsb 0
#define xd_p_reg_p_bb_decrease_first_value	(*(volatile byte xdata *) 0xF272)
#define    p_reg_p_bb_decrease_first_value	0xF272 
#define	reg_p_bb_decrease_first_value_pos 0
#define	reg_p_bb_decrease_first_value_len 6
#define	reg_p_bb_decrease_first_value_lsb 0
#define xd_p_reg_p_bb_decrease_second_value	(*(volatile byte xdata *) 0xF273)
#define    p_reg_p_bb_decrease_second_value	0xF273 
#define	reg_p_bb_decrease_second_value_pos 0
#define	reg_p_bb_decrease_second_value_len 6
#define	reg_p_bb_decrease_second_value_lsb 0
#define xd_p_reg_p_bb_lock_th	(*(volatile byte xdata *) 0xF274)
#define    p_reg_p_bb_lock_th	0xF274 
#define	reg_p_bb_lock_th_pos 0
#define	reg_p_bb_lock_th_len 8
#define	reg_p_bb_lock_th_lsb 0
#define xd_r_reg_r_rssi_ori_7_0	(*(volatile byte xdata *) 0xF275)
#define    r_reg_r_rssi_ori_7_0	0xF275 
#define	reg_r_rssi_ori_7_0_pos 0
#define	reg_r_rssi_ori_7_0_len 8
#define	reg_r_rssi_ori_7_0_lsb 0
#define xd_r_reg_r_rssi_ori_9_8	(*(volatile byte xdata *) 0xF276)
#define    r_reg_r_rssi_ori_9_8	0xF276 
#define	reg_r_rssi_ori_9_8_pos 0
#define	reg_r_rssi_ori_9_8_len 2
#define	reg_r_rssi_ori_9_8_lsb 8
#define xd_r_reg_r_rssi_avg	(*(volatile byte xdata *) 0xF277)
#define    r_reg_r_rssi_avg	0xF277 
#define	reg_r_rssi_avg_pos 0
#define	reg_r_rssi_avg_len 8
#define	reg_r_rssi_avg_lsb 0
#define xd_r_reg_r_rssi_median	(*(volatile byte xdata *) 0xF278)
#define    r_reg_r_rssi_median	0xF278 
#define	reg_r_rssi_median_pos 0
#define	reg_r_rssi_median_len 8
#define	reg_r_rssi_median_lsb 0
#define xd_r_reg_r_rssi_power	(*(volatile byte xdata *) 0xF279)
#define    r_reg_r_rssi_power	0xF279 
#define	reg_r_rssi_power_pos 0
#define	reg_r_rssi_power_len 8
#define	reg_r_rssi_power_lsb 0
#define xd_r_reg_r_aaci_detect1_upper_cnt	(*(volatile byte xdata *) 0xF27A)
#define    r_reg_r_aaci_detect1_upper_cnt	0xF27A 
#define	reg_r_aaci_detect1_upper_cnt_pos 0
#define	reg_r_aaci_detect1_upper_cnt_len 8
#define	reg_r_aaci_detect1_upper_cnt_lsb 0
#define xd_r_reg_r_aaci_detect1_lower_cnt	(*(volatile byte xdata *) 0xF27B)
#define    r_reg_r_aaci_detect1_lower_cnt	0xF27B 
#define	reg_r_aaci_detect1_lower_cnt_pos 0
#define	reg_r_aaci_detect1_lower_cnt_len 8
#define	reg_r_aaci_detect1_lower_cnt_lsb 0
#define xd_r_reg_r_rf_lna_gain	(*(volatile byte xdata *) 0xF27C)
#define    r_reg_r_rf_lna_gain	0xF27C 
#define	reg_r_rf_lna_gain_pos 0
#define	reg_r_rf_lna_gain_len 3
#define	reg_r_rf_lna_gain_lsb 0
#define xd_r_reg_r_rf_pgc_gain	(*(volatile byte xdata *) 0xF27D)
#define    r_reg_r_rf_pgc_gain	0xF27D 
#define	reg_r_rf_pgc_gain_pos 0
#define	reg_r_rf_pgc_gain_len 3
#define	reg_r_rf_pgc_gain_lsb 0
#define xd_p_reg_p_rssi_target_env4	(*(volatile byte xdata *) 0xF27E)
#define    p_reg_p_rssi_target_env4	0xF27E 
#define	reg_p_rssi_target_env4_pos 0
#define	reg_p_rssi_target_env4_len 8
#define	reg_p_rssi_target_env4_lsb 0
#define xd_p_reg_p_rf_agc_gain_tu_hold	(*(volatile byte xdata *) 0xF27F)
#define    p_reg_p_rf_agc_gain_tu_hold	0xF27F 
#define	reg_p_rf_agc_gain_tu_hold_pos 0
#define	reg_p_rf_agc_gain_tu_hold_len 1
#define	reg_p_rf_agc_gain_tu_hold_lsb 0
#define xd_p_rf_gain_diff_0	(*(volatile byte xdata *) 0xF280)
#define    p_rf_gain_diff_0	0xF280 
#define	rf_gain_diff_0_pos 0
#define	rf_gain_diff_0_len 4
#define	rf_gain_diff_0_lsb 0
#define xd_p_rf_gain_lna_0	(*(volatile byte xdata *) 0xF280)
#define    p_rf_gain_lna_0	0xF280 
#define	rf_gain_lna_0_pos 4
#define	rf_gain_lna_0_len 3
#define	rf_gain_lna_0_lsb 0
#define xd_p_rf_gain_pgc_0	(*(volatile byte xdata *) 0xF281)
#define    p_rf_gain_pgc_0	0xF281 
#define	rf_gain_pgc_0_pos 0
#define	rf_gain_pgc_0_len 3
#define	rf_gain_pgc_0_lsb 0
#define xd_p_rf_gain_diff_1	(*(volatile byte xdata *) 0xF282)
#define    p_rf_gain_diff_1	0xF282 
#define	rf_gain_diff_1_pos 0
#define	rf_gain_diff_1_len 4
#define	rf_gain_diff_1_lsb 0
#define xd_p_rf_gain_lna_1	(*(volatile byte xdata *) 0xF282)
#define    p_rf_gain_lna_1	0xF282 
#define	rf_gain_lna_1_pos 4
#define	rf_gain_lna_1_len 3
#define	rf_gain_lna_1_lsb 0
#define xd_p_rf_gain_pgc_1	(*(volatile byte xdata *) 0xF283)
#define    p_rf_gain_pgc_1	0xF283 
#define	rf_gain_pgc_1_pos 0
#define	rf_gain_pgc_1_len 3
#define	rf_gain_pgc_1_lsb 0
#define xd_p_rf_gain_diff_2	(*(volatile byte xdata *) 0xF284)
#define    p_rf_gain_diff_2	0xF284 
#define	rf_gain_diff_2_pos 0
#define	rf_gain_diff_2_len 4
#define	rf_gain_diff_2_lsb 0
#define xd_p_rf_gain_lna_2	(*(volatile byte xdata *) 0xF284)
#define    p_rf_gain_lna_2	0xF284 
#define	rf_gain_lna_2_pos 4
#define	rf_gain_lna_2_len 3
#define	rf_gain_lna_2_lsb 0
#define xd_p_rf_gain_pgc_2	(*(volatile byte xdata *) 0xF285)
#define    p_rf_gain_pgc_2	0xF285 
#define	rf_gain_pgc_2_pos 0
#define	rf_gain_pgc_2_len 3
#define	rf_gain_pgc_2_lsb 0
#define xd_p_rf_gain_diff_3	(*(volatile byte xdata *) 0xF286)
#define    p_rf_gain_diff_3	0xF286 
#define	rf_gain_diff_3_pos 0
#define	rf_gain_diff_3_len 4
#define	rf_gain_diff_3_lsb 0
#define xd_p_rf_gain_lna_3	(*(volatile byte xdata *) 0xF286)
#define    p_rf_gain_lna_3	0xF286 
#define	rf_gain_lna_3_pos 4
#define	rf_gain_lna_3_len 3
#define	rf_gain_lna_3_lsb 0
#define xd_p_rf_gain_pgc_3	(*(volatile byte xdata *) 0xF287)
#define    p_rf_gain_pgc_3	0xF287 
#define	rf_gain_pgc_3_pos 0
#define	rf_gain_pgc_3_len 3
#define	rf_gain_pgc_3_lsb 0
#define xd_p_rf_gain_diff_4	(*(volatile byte xdata *) 0xF288)
#define    p_rf_gain_diff_4	0xF288 
#define	rf_gain_diff_4_pos 0
#define	rf_gain_diff_4_len 4
#define	rf_gain_diff_4_lsb 0
#define xd_p_rf_gain_lna_4	(*(volatile byte xdata *) 0xF288)
#define    p_rf_gain_lna_4	0xF288 
#define	rf_gain_lna_4_pos 4
#define	rf_gain_lna_4_len 3
#define	rf_gain_lna_4_lsb 0
#define xd_p_rf_gain_pgc_4	(*(volatile byte xdata *) 0xF289)
#define    p_rf_gain_pgc_4	0xF289 
#define	rf_gain_pgc_4_pos 0
#define	rf_gain_pgc_4_len 3
#define	rf_gain_pgc_4_lsb 0
#define xd_p_rf_gain_diff_5	(*(volatile byte xdata *) 0xF28A)
#define    p_rf_gain_diff_5	0xF28A 
#define	rf_gain_diff_5_pos 0
#define	rf_gain_diff_5_len 4
#define	rf_gain_diff_5_lsb 0
#define xd_p_rf_gain_lna_5	(*(volatile byte xdata *) 0xF28A)
#define    p_rf_gain_lna_5	0xF28A 
#define	rf_gain_lna_5_pos 4
#define	rf_gain_lna_5_len 3
#define	rf_gain_lna_5_lsb 0
#define xd_p_rf_gain_pgc_5	(*(volatile byte xdata *) 0xF28B)
#define    p_rf_gain_pgc_5	0xF28B 
#define	rf_gain_pgc_5_pos 0
#define	rf_gain_pgc_5_len 3
#define	rf_gain_pgc_5_lsb 0
#define xd_p_rf_gain_diff_6	(*(volatile byte xdata *) 0xF28C)
#define    p_rf_gain_diff_6	0xF28C 
#define	rf_gain_diff_6_pos 0
#define	rf_gain_diff_6_len 4
#define	rf_gain_diff_6_lsb 0
#define xd_p_rf_gain_lna_6	(*(volatile byte xdata *) 0xF28C)
#define    p_rf_gain_lna_6	0xF28C 
#define	rf_gain_lna_6_pos 4
#define	rf_gain_lna_6_len 3
#define	rf_gain_lna_6_lsb 0
#define xd_p_rf_gain_pgc_6	(*(volatile byte xdata *) 0xF28D)
#define    p_rf_gain_pgc_6	0xF28D 
#define	rf_gain_pgc_6_pos 0
#define	rf_gain_pgc_6_len 3
#define	rf_gain_pgc_6_lsb 0
#define xd_p_rf_gain_diff_7	(*(volatile byte xdata *) 0xF28E)
#define    p_rf_gain_diff_7	0xF28E 
#define	rf_gain_diff_7_pos 0
#define	rf_gain_diff_7_len 4
#define	rf_gain_diff_7_lsb 0
#define xd_p_rf_gain_lna_7	(*(volatile byte xdata *) 0xF28E)
#define    p_rf_gain_lna_7	0xF28E 
#define	rf_gain_lna_7_pos 4
#define	rf_gain_lna_7_len 3
#define	rf_gain_lna_7_lsb 0
#define xd_p_rf_gain_pgc_7	(*(volatile byte xdata *) 0xF28F)
#define    p_rf_gain_pgc_7	0xF28F 
#define	rf_gain_pgc_7_pos 0
#define	rf_gain_pgc_7_len 3
#define	rf_gain_pgc_7_lsb 0
#define xd_p_rf_gain_diff_8	(*(volatile byte xdata *) 0xF290)
#define    p_rf_gain_diff_8	0xF290 
#define	rf_gain_diff_8_pos 0
#define	rf_gain_diff_8_len 4
#define	rf_gain_diff_8_lsb 0
#define xd_p_rf_gain_lna_8	(*(volatile byte xdata *) 0xF290)
#define    p_rf_gain_lna_8	0xF290 
#define	rf_gain_lna_8_pos 4
#define	rf_gain_lna_8_len 3
#define	rf_gain_lna_8_lsb 0
#define xd_p_rf_gain_pgc_8	(*(volatile byte xdata *) 0xF291)
#define    p_rf_gain_pgc_8	0xF291 
#define	rf_gain_pgc_8_pos 0
#define	rf_gain_pgc_8_len 3
#define	rf_gain_pgc_8_lsb 0
#define xd_p_rf_gain_diff_9	(*(volatile byte xdata *) 0xF292)
#define    p_rf_gain_diff_9	0xF292 
#define	rf_gain_diff_9_pos 0
#define	rf_gain_diff_9_len 4
#define	rf_gain_diff_9_lsb 0
#define xd_p_rf_gain_lna_9	(*(volatile byte xdata *) 0xF292)
#define    p_rf_gain_lna_9	0xF292 
#define	rf_gain_lna_9_pos 4
#define	rf_gain_lna_9_len 3
#define	rf_gain_lna_9_lsb 0
#define xd_p_rf_gain_pgc_9	(*(volatile byte xdata *) 0xF293)
#define    p_rf_gain_pgc_9	0xF293 
#define	rf_gain_pgc_9_pos 0
#define	rf_gain_pgc_9_len 3
#define	rf_gain_pgc_9_lsb 0
#define xd_p_rf_gain_diff_10	(*(volatile byte xdata *) 0xF294)
#define    p_rf_gain_diff_10	0xF294 
#define	rf_gain_diff_10_pos 0
#define	rf_gain_diff_10_len 4
#define	rf_gain_diff_10_lsb 0
#define xd_p_rf_gain_lna_10	(*(volatile byte xdata *) 0xF294)
#define    p_rf_gain_lna_10	0xF294 
#define	rf_gain_lna_10_pos 4
#define	rf_gain_lna_10_len 3
#define	rf_gain_lna_10_lsb 0
#define xd_p_rf_gain_pgc_10	(*(volatile byte xdata *) 0xF295)
#define    p_rf_gain_pgc_10	0xF295 
#define	rf_gain_pgc_10_pos 0
#define	rf_gain_pgc_10_len 3
#define	rf_gain_pgc_10_lsb 0
#define xd_p_rf_gain_diff_11	(*(volatile byte xdata *) 0xF296)
#define    p_rf_gain_diff_11	0xF296 
#define	rf_gain_diff_11_pos 0
#define	rf_gain_diff_11_len 4
#define	rf_gain_diff_11_lsb 0
#define xd_p_rf_gain_lna_11	(*(volatile byte xdata *) 0xF296)
#define    p_rf_gain_lna_11	0xF296 
#define	rf_gain_lna_11_pos 4
#define	rf_gain_lna_11_len 3
#define	rf_gain_lna_11_lsb 0
#define xd_p_rf_gain_pgc_11	(*(volatile byte xdata *) 0xF297)
#define    p_rf_gain_pgc_11	0xF297 
#define	rf_gain_pgc_11_pos 0
#define	rf_gain_pgc_11_len 3
#define	rf_gain_pgc_11_lsb 0
#define xd_p_rf_gain_diff_12	(*(volatile byte xdata *) 0xF298)
#define    p_rf_gain_diff_12	0xF298 
#define	rf_gain_diff_12_pos 0
#define	rf_gain_diff_12_len 4
#define	rf_gain_diff_12_lsb 0
#define xd_p_rf_gain_lna_12	(*(volatile byte xdata *) 0xF298)
#define    p_rf_gain_lna_12	0xF298 
#define	rf_gain_lna_12_pos 4
#define	rf_gain_lna_12_len 3
#define	rf_gain_lna_12_lsb 0
#define xd_p_rf_gain_pgc_12	(*(volatile byte xdata *) 0xF299)
#define    p_rf_gain_pgc_12	0xF299 
#define	rf_gain_pgc_12_pos 0
#define	rf_gain_pgc_12_len 3
#define	rf_gain_pgc_12_lsb 0
#define xd_p_rf_gain_diff_13	(*(volatile byte xdata *) 0xF29A)
#define    p_rf_gain_diff_13	0xF29A 
#define	rf_gain_diff_13_pos 0
#define	rf_gain_diff_13_len 4
#define	rf_gain_diff_13_lsb 0
#define xd_p_rf_gain_lna_13	(*(volatile byte xdata *) 0xF29A)
#define    p_rf_gain_lna_13	0xF29A 
#define	rf_gain_lna_13_pos 4
#define	rf_gain_lna_13_len 3
#define	rf_gain_lna_13_lsb 0
#define xd_p_rf_gain_pgc_13	(*(volatile byte xdata *) 0xF29B)
#define    p_rf_gain_pgc_13	0xF29B 
#define	rf_gain_pgc_13_pos 0
#define	rf_gain_pgc_13_len 3
#define	rf_gain_pgc_13_lsb 0
#define xd_p_rf_gain_diff_14	(*(volatile byte xdata *) 0xF29C)
#define    p_rf_gain_diff_14	0xF29C 
#define	rf_gain_diff_14_pos 0
#define	rf_gain_diff_14_len 4
#define	rf_gain_diff_14_lsb 0
#define xd_p_rf_gain_lna_14	(*(volatile byte xdata *) 0xF29C)
#define    p_rf_gain_lna_14	0xF29C 
#define	rf_gain_lna_14_pos 4
#define	rf_gain_lna_14_len 3
#define	rf_gain_lna_14_lsb 0
#define xd_p_rf_gain_pgc_14	(*(volatile byte xdata *) 0xF29D)
#define    p_rf_gain_pgc_14	0xF29D 
#define	rf_gain_pgc_14_pos 0
#define	rf_gain_pgc_14_len 3
#define	rf_gain_pgc_14_lsb 0
#define xd_p_rf_gain_diff_15	(*(volatile byte xdata *) 0xF29E)
#define    p_rf_gain_diff_15	0xF29E 
#define	rf_gain_diff_15_pos 0
#define	rf_gain_diff_15_len 4
#define	rf_gain_diff_15_lsb 0
#define xd_p_rf_gain_lna_15	(*(volatile byte xdata *) 0xF29E)
#define    p_rf_gain_lna_15	0xF29E 
#define	rf_gain_lna_15_pos 4
#define	rf_gain_lna_15_len 3
#define	rf_gain_lna_15_lsb 0
#define xd_p_rf_gain_pgc_15	(*(volatile byte xdata *) 0xF29F)
#define    p_rf_gain_pgc_15	0xF29F 
#define	rf_gain_pgc_15_pos 0
#define	rf_gain_pgc_15_len 3
#define	rf_gain_pgc_15_lsb 0
#define xd_p_reg_p_rssi_avg_done	(*(volatile byte xdata *) 0xF2A0)
#define    p_reg_p_rssi_avg_done	0xF2A0 
#define	reg_p_rssi_avg_done_pos 0
#define	reg_p_rssi_avg_done_len 1
#define	reg_p_rssi_avg_done_lsb 0
#define xd_p_reg_p_rssi_pow_done	(*(volatile byte xdata *) 0xF2A1)
#define    p_reg_p_rssi_pow_done	0xF2A1 
#define	reg_p_rssi_pow_done_pos 0
#define	reg_p_rssi_pow_done_len 1
#define	reg_p_rssi_pow_done_lsb 0
#define xd_r_reg_r_rssi_msb	(*(volatile byte xdata *) 0xF2A2)
#define    r_reg_r_rssi_msb	0xF2A2 
#define	reg_r_rssi_msb_pos 0
#define	reg_r_rssi_msb_len 8
#define	reg_r_rssi_msb_lsb 0
#define xd_p_reg_p_pga_1_gain_max	(*(volatile byte xdata *) 0xF2A3)
#define    p_reg_p_pga_1_gain_max	0xF2A3 
#define	reg_p_pga_1_gain_max_pos 0
#define	reg_p_pga_1_gain_max_len 2
#define	reg_p_pga_1_gain_max_lsb 0
#define xd_p_reg_p_bb_pga1_gain	(*(volatile byte xdata *) 0xF2A4)
#define    p_reg_p_bb_pga1_gain	0xF2A4 
#define	reg_p_bb_pga1_gain_pos 0
#define	reg_p_bb_pga1_gain_len 2
#define	reg_p_bb_pga1_gain_lsb 0
#define xd_p_reg_p_bb_pga2_gain	(*(volatile byte xdata *) 0xF2A5)
#define    p_reg_p_bb_pga2_gain	0xF2A5 
#define	reg_p_bb_pga2_gain_pos 0
#define	reg_p_bb_pga2_gain_len 4
#define	reg_p_bb_pga2_gain_lsb 0
#define xd_r_reg_r_aagc_pga1_gain	(*(volatile byte xdata *) 0xF2A6)
#define    r_reg_r_aagc_pga1_gain	0xF2A6 
#define	reg_r_aagc_pga1_gain_pos 0
#define	reg_r_aagc_pga1_gain_len 2
#define	reg_r_aagc_pga1_gain_lsb 0
#define xd_r_reg_r_aagc_pga2_gain	(*(volatile byte xdata *) 0xF2A7)
#define    r_reg_r_aagc_pga2_gain	0xF2A7 
#define	reg_r_aagc_pga2_gain_pos 0
#define	reg_r_aagc_pga2_gain_len 4
#define	reg_r_aagc_pga2_gain_lsb 0
#define xd_p_reg_p_mccid_new_ccilocator	(*(volatile byte xdata *) 0xF2A8)
#define    p_reg_p_mccid_new_ccilocator	0xF2A8 
#define	reg_p_mccid_new_ccilocator_pos 0
#define	reg_p_mccid_new_ccilocator_len 1
#define	reg_p_mccid_new_ccilocator_lsb 0
#define xd_p_reg_p_mccid_controlledbyfw	(*(volatile byte xdata *) 0xF2A9)
#define    p_reg_p_mccid_controlledbyfw	0xF2A9 
#define	reg_p_mccid_controlledbyfw_pos 0
#define	reg_p_mccid_controlledbyfw_len 1
#define	reg_p_mccid_controlledbyfw_lsb 0
#define xd_p_reg_p_mccid_filtertoneindexfromfw	(*(volatile byte xdata *) 0xF2AA)
#define    p_reg_p_mccid_filtertoneindexfromfw	0xF2AA 
#define	reg_p_mccid_filtertoneindexfromfw_pos 0
#define	reg_p_mccid_filtertoneindexfromfw_len 8
#define	reg_p_mccid_filtertoneindexfromfw_lsb 0
#define xd_p_reg_p_mccid_firmwaretrigger	(*(volatile byte xdata *) 0xF2AB)
