liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define    p_reg_p_mccid_firmwaretrigger	0xF2AB 
#define	reg_p_mccid_firmwaretrigger_pos 0
#define	reg_p_mccid_firmwaretrigger_len 1
#define	reg_p_mccid_firmwaretrigger_lsb 0
#define xd_p_reg_p_mccid_csi_detect_aci_en	(*(volatile byte xdata *) 0xF2AC)
#define    p_reg_p_mccid_csi_detect_aci_en	0xF2AC 
#define	reg_p_mccid_csi_detect_aci_en_pos 0
#define	reg_p_mccid_csi_detect_aci_en_len 1
#define	reg_p_mccid_csi_detect_aci_en_lsb 0
#define xd_g_reg_tpsd_txmod	(*(volatile byte xdata *) 0xF900)
#define    g_reg_tpsd_txmod	0xF900 
#define	reg_tpsd_txmod_pos 0
#define	reg_tpsd_txmod_len 2
#define	reg_tpsd_txmod_lsb 0
#define xd_g_reg_tpsd_gi	(*(volatile byte xdata *) 0xF901)
#define    g_reg_tpsd_gi	0xF901 
#define	reg_tpsd_gi_pos 0
#define	reg_tpsd_gi_len 2
#define	reg_tpsd_gi_lsb 0
#define xd_g_reg_tpsd_hier	(*(volatile byte xdata *) 0xF902)
#define    g_reg_tpsd_hier	0xF902 
#define	reg_tpsd_hier_pos 0
#define	reg_tpsd_hier_len 3
#define	reg_tpsd_hier_lsb 0
#define xd_g_reg_tpsd_const	(*(volatile byte xdata *) 0xF903)
#define    g_reg_tpsd_const	0xF903 
#define	reg_tpsd_const_pos 0
#define	reg_tpsd_const_len 2
#define	reg_tpsd_const_lsb 0
#define xd_g_reg_bw	(*(volatile byte xdata *) 0xF904)
#define    g_reg_bw	0xF904 
#define	reg_bw_pos 0
#define	reg_bw_len 2
#define	reg_bw_lsb 0
#define xd_g_reg_dec_pri	(*(volatile byte xdata *) 0xF905)
#define    g_reg_dec_pri	0xF905 
#define	reg_dec_pri_pos 0
#define	reg_dec_pri_len 1
#define	reg_dec_pri_lsb 0
#define xd_g_reg_tpsd_hpcr	(*(volatile byte xdata *) 0xF906)
#define    g_reg_tpsd_hpcr	0xF906 
#define	reg_tpsd_hpcr_pos 0
#define	reg_tpsd_hpcr_len 3
#define	reg_tpsd_hpcr_lsb 0
#define xd_g_reg_tpsd_lpcr	(*(volatile byte xdata *) 0xF907)
#define    g_reg_tpsd_lpcr	0xF907 
#define	reg_tpsd_lpcr_pos 0
#define	reg_tpsd_lpcr_len 3
#define	reg_tpsd_lpcr_lsb 0
#define xd_g_reg_tpsd_indep	(*(volatile byte xdata *) 0xF908)
#define    g_reg_tpsd_indep	0xF908 
#define	reg_tpsd_indep_pos 0
#define	reg_tpsd_indep_len 1
#define	reg_tpsd_indep_lsb 0
#define xd_g_reg_sntc_en	(*(volatile byte xdata *) 0xF90B)
#define    g_reg_sntc_en	0xF90B 
#define	reg_sntc_en_pos 0
#define	reg_sntc_en_len 1
#define	reg_sntc_en_lsb 0
#define xd_g_reg_clk_sntc_sel	(*(volatile byte xdata *) 0xF90D)
#define    g_reg_clk_sntc_sel	0xF90D 
#define	reg_clk_sntc_sel_pos 0
#define	reg_clk_sntc_sel_len 3
#define	reg_clk_sntc_sel_lsb 0
#define xd_g_reg_clk_sys40	(*(volatile byte xdata *) 0xF90E)
#define    g_reg_clk_sys40	0xF90E 
#define	reg_clk_sys40_pos 0
#define	reg_clk_sys40_len 1
#define	reg_clk_sys40_lsb 0
#define xd_g_reg_intp_sys_polarity	(*(volatile byte xdata *) 0xF90F)
#define    g_reg_intp_sys_polarity	0xF90F 
#define	reg_intp_sys_polarity_pos 0
#define	reg_intp_sys_polarity_len 1
#define	reg_intp_sys_polarity_lsb 0
#define xd_g_reg_intp_sys_sc_7_0	(*(volatile byte xdata *) 0xF910)
#define    g_reg_intp_sys_sc_7_0	0xF910 
#define	reg_intp_sys_sc_7_0_pos 0
#define	reg_intp_sys_sc_7_0_len 8
#define	reg_intp_sys_sc_7_0_lsb 0
#define xd_g_reg_intp_sys_sc_15_8	(*(volatile byte xdata *) 0xF911)
#define    g_reg_intp_sys_sc_15_8	0xF911 
#define	reg_intp_sys_sc_15_8_pos 0
#define	reg_intp_sys_sc_15_8_len 8
#define	reg_intp_sys_sc_15_8_lsb 8
#define xd_g_reg_intp_sys_sc_23_16	(*(volatile byte xdata *) 0xF912)
#define    g_reg_intp_sys_sc_23_16	0xF912 
#define	reg_intp_sys_sc_23_16_pos 0
#define	reg_intp_sys_sc_23_16_len 8
#define	reg_intp_sys_sc_23_16_lsb 16
#define xd_g_reg_intp_sys_sc_26_24	(*(volatile byte xdata *) 0xF913)
#define    g_reg_intp_sys_sc_26_24	0xF913 
#define	reg_intp_sys_sc_26_24_pos 0
#define	reg_intp_sys_sc_26_24_len 3
#define	reg_intp_sys_sc_26_24_lsb 24
#define xd_g_reg_ofsm_clk	(*(volatile byte xdata *) 0xF914)
#define    g_reg_ofsm_clk	0xF914 
#define	reg_ofsm_clk_pos 0
#define	reg_ofsm_clk_len 3
#define	reg_ofsm_clk_lsb 0
#define xd_g_reg_fclk_cfg	(*(volatile byte xdata *) 0xF915)
#define    g_reg_fclk_cfg	0xF915 
#define	reg_fclk_cfg_pos 0
#define	reg_fclk_cfg_len 1
#define	reg_fclk_cfg_lsb 0
#define xd_g_reg_fclk_vtb	(*(volatile byte xdata *) 0xF919)
#define    g_reg_fclk_vtb	0xF919 
#define	reg_fclk_vtb_pos 0
#define	reg_fclk_vtb_len 1
#define	reg_fclk_vtb_lsb 0
#define xd_g_reg_fclk_cste	(*(volatile byte xdata *) 0xF91A)
#define    g_reg_fclk_cste	0xF91A 
#define	reg_fclk_cste_pos 0
#define	reg_fclk_cste_len 1
#define	reg_fclk_cste_lsb 0
#define xd_g_reg_fclk_mp2if	(*(volatile byte xdata *) 0xF91B)
#define    g_reg_fclk_mp2if	0xF91B 
#define	reg_fclk_mp2if_pos 0
#define	reg_fclk_mp2if_len 1
#define	reg_fclk_mp2if_lsb 0
#define xd_p_reg_adcout_sync	(*(volatile byte xdata *) 0xFA00)
#define    p_reg_adcout_sync	0xFA00 
#define	reg_adcout_sync_pos 0
#define	reg_adcout_sync_len 1
#define	reg_adcout_sync_lsb 0
#define xd_p_reg_dagc2o_edge1	(*(volatile byte xdata *) 0xFA01)
#define    p_reg_dagc2o_edge1	0xFA01 
#define	reg_dagc2o_edge1_pos 0
#define	reg_dagc2o_edge1_len 1
#define	reg_dagc2o_edge1_lsb 0
#define xd_p_reg_dagc2o_edge0	(*(volatile byte xdata *) 0xFA02)
#define    p_reg_dagc2o_edge0	0xFA02 
#define	reg_dagc2o_edge0_pos 0
#define	reg_dagc2o_edge0_len 1
#define	reg_dagc2o_edge0_lsb 0
#define xd_p_reg_second_rom_on	(*(volatile byte xdata *) 0xFA03)
#define    p_reg_second_rom_on	0xFA03 
#define	reg_second_rom_on_pos 0
#define	reg_second_rom_on_len 1
#define	reg_second_rom_on_lsb 0
#define xd_p_reg_bypass_host2tuner	(*(volatile byte xdata *) 0xFA04)
#define    p_reg_bypass_host2tuner	0xFA04 
#define	reg_bypass_host2tuner_pos 0
#define	reg_bypass_host2tuner_len 1
#define	reg_bypass_host2tuner_lsb 0
#define xd_p_cfoe_NS_coeff1_7_0	(*(volatile byte xdata *) 0xF400)
#define    p_cfoe_NS_coeff1_7_0	0xF400 
#define	cfoe_NS_coeff1_7_0_pos 0
#define	cfoe_NS_coeff1_7_0_len 8
#define	cfoe_NS_coeff1_7_0_lsb 0
#define xd_p_cfoe_NS_coeff1_15_8	(*(volatile byte xdata *) 0xF401)
#define    p_cfoe_NS_coeff1_15_8	0xF401 
#define	cfoe_NS_coeff1_15_8_pos 0
#define	cfoe_NS_coeff1_15_8_len 8
#define	cfoe_NS_coeff1_15_8_lsb 8
#define xd_p_cfoe_NS_coeff1_23_16	(*(volatile byte xdata *) 0xF402)
#define    p_cfoe_NS_coeff1_23_16	0xF402 
#define	cfoe_NS_coeff1_23_16_pos 0
#define	cfoe_NS_coeff1_23_16_len 8
#define	cfoe_NS_coeff1_23_16_lsb 16
#define xd_p_cfoe_NS_coeff1_25_24	(*(volatile byte xdata *) 0xF403)
#define    p_cfoe_NS_coeff1_25_24	0xF403 
#define	cfoe_NS_coeff1_25_24_pos 0
#define	cfoe_NS_coeff1_25_24_len 2
#define	cfoe_NS_coeff1_25_24_lsb 24
#define xd_p_cfoe_NS_coeff2_7_0	(*(volatile byte xdata *) 0xF404)
#define    p_cfoe_NS_coeff2_7_0	0xF404 
#define	cfoe_NS_coeff2_7_0_pos 0
#define	cfoe_NS_coeff2_7_0_len 8
#define	cfoe_NS_coeff2_7_0_lsb 0
#define xd_p_cfoe_NS_coeff2_15_8	(*(volatile byte xdata *) 0xF405)
#define    p_cfoe_NS_coeff2_15_8	0xF405 
#define	cfoe_NS_coeff2_15_8_pos 0
#define	cfoe_NS_coeff2_15_8_len 8
#define	cfoe_NS_coeff2_15_8_lsb 8
#define xd_p_cfoe_NS_coeff2_23_16	(*(volatile byte xdata *) 0xF406)
#define    p_cfoe_NS_coeff2_23_16	0xF406 
#define	cfoe_NS_coeff2_23_16_pos 0
#define	cfoe_NS_coeff2_23_16_len 8
#define	cfoe_NS_coeff2_23_16_lsb 16
#define xd_p_cfoe_NS_coeff2_24	(*(volatile byte xdata *) 0xF407)
#define    p_cfoe_NS_coeff2_24	0xF407 
#define	cfoe_NS_coeff2_24_pos 0
#define	cfoe_NS_coeff2_24_len 1
#define	cfoe_NS_coeff2_24_lsb 24
#define xd_p_cfoe_lf_c1_7_0	(*(volatile byte xdata *) 0xF408)
#define    p_cfoe_lf_c1_7_0	0xF408 
#define	cfoe_lf_c1_7_0_pos 0
#define	cfoe_lf_c1_7_0_len 8
#define	cfoe_lf_c1_7_0_lsb 0
#define xd_p_cfoe_lf_c1_9_8	(*(volatile byte xdata *) 0xF409)
#define    p_cfoe_lf_c1_9_8	0xF409 
#define	cfoe_lf_c1_9_8_pos 0
#define	cfoe_lf_c1_9_8_len 2
#define	cfoe_lf_c1_9_8_lsb 8
#define xd_p_cfoe_lf_c2_7_0	(*(volatile byte xdata *) 0xF40A)
#define    p_cfoe_lf_c2_7_0	0xF40A 
#define	cfoe_lf_c2_7_0_pos 0
#define	cfoe_lf_c2_7_0_len 8
#define	cfoe_lf_c2_7_0_lsb 0
#define xd_p_cfoe_lf_c2_9_8	(*(volatile byte xdata *) 0xF40B)
#define    p_cfoe_lf_c2_9_8	0xF40B 
#define	cfoe_lf_c2_9_8_pos 0
#define	cfoe_lf_c2_9_8_len 2
#define	cfoe_lf_c2_9_8_lsb 8
#define xd_p_cfoe_ifod_7_0	(*(volatile byte xdata *) 0xF40C)
#define    p_cfoe_ifod_7_0	0xF40C 
#define	cfoe_ifod_7_0_pos 0
#define	cfoe_ifod_7_0_len 8
#define	cfoe_ifod_7_0_lsb 0
#define xd_p_cfoe_ifod_10_8	(*(volatile byte xdata *) 0xF40D)
#define    p_cfoe_ifod_10_8	0xF40D 
#define	cfoe_ifod_10_8_pos 0
#define	cfoe_ifod_10_8_len 3
#define	cfoe_ifod_10_8_lsb 8
#define xd_p_cfoe_Divg_ctr_th	(*(volatile byte xdata *) 0xF40E)
#define    p_cfoe_Divg_ctr_th	0xF40E 
#define	cfoe_Divg_ctr_th_pos 0
#define	cfoe_Divg_ctr_th_len 4
#define	cfoe_Divg_ctr_th_lsb 0
#define xd_p_cfoe_FOT_divg_th	(*(volatile byte xdata *) 0xF40F)
#define    p_cfoe_FOT_divg_th	0xF40F 
#define	cfoe_FOT_divg_th_pos 0
#define	cfoe_FOT_divg_th_len 8
#define	cfoe_FOT_divg_th_lsb 0
#define xd_p_cfoe_FOT_cnvg_th	(*(volatile byte xdata *) 0xF410)
#define    p_cfoe_FOT_cnvg_th	0xF410 
#define	cfoe_FOT_cnvg_th_pos 0
#define	cfoe_FOT_cnvg_th_len 8
#define	cfoe_FOT_cnvg_th_lsb 0
#define xd_p_reg_cfoe_offset_7_0	(*(volatile byte xdata *) 0xF411)
#define    p_reg_cfoe_offset_7_0	0xF411 
#define	reg_cfoe_offset_7_0_pos 0
#define	reg_cfoe_offset_7_0_len 8
#define	reg_cfoe_offset_7_0_lsb 0
#define xd_p_reg_cfoe_offset_10_8	(*(volatile byte xdata *) 0xF412)
#define    p_reg_cfoe_offset_10_8	0xF412 
#define	reg_cfoe_offset_10_8_pos 0
#define	reg_cfoe_offset_10_8_len 3
#define	reg_cfoe_offset_10_8_lsb 8
#define xd_p_reg_cfoe_ifoe_sign_corr	(*(volatile byte xdata *) 0xF413)
#define    p_reg_cfoe_ifoe_sign_corr	0xF413 
#define	reg_cfoe_ifoe_sign_corr_pos 0
#define	reg_cfoe_ifoe_sign_corr_len 1
#define	reg_cfoe_ifoe_sign_corr_lsb 0
#define xd_p_cfoe_FOT_pullin_cnt_clr	(*(volatile byte xdata *) 0xF414)
#define    p_cfoe_FOT_pullin_cnt_clr	0xF414 
#define	cfoe_FOT_pullin_cnt_clr_pos 0
#define	cfoe_FOT_pullin_cnt_clr_len 1
#define	cfoe_FOT_pullin_cnt_clr_lsb 0
#define xd_p_cfoe_FOT_spec_inv	(*(volatile byte xdata *) 0xF415)
#define    p_cfoe_FOT_spec_inv	0xF415 
#define	cfoe_FOT_spec_inv_pos 0
#define	cfoe_FOT_spec_inv_len 1
#define	cfoe_FOT_spec_inv_lsb 0
#define xd_p_cfoe_FOT_pullin_ctr_th	(*(volatile byte xdata *) 0xF416)
#define    p_cfoe_FOT_pullin_ctr_th	0xF416 
#define	cfoe_FOT_pullin_ctr_th_pos 0
#define	cfoe_FOT_pullin_ctr_th_len 4
#define	cfoe_FOT_pullin_ctr_th_lsb 0
#define xd_p_cfoe_FOT_sf_ctr_th	(*(volatile byte xdata *) 0xF417)
#define    p_cfoe_FOT_sf_ctr_th	0xF417 
#define	cfoe_FOT_sf_ctr_th_pos 0
#define	cfoe_FOT_sf_ctr_th_len 4
#define	cfoe_FOT_sf_ctr_th_lsb 0
#define xd_p_cfoe_FOT_pullin_th	(*(volatile byte xdata *) 0xF418)
#define    p_cfoe_FOT_pullin_th	0xF418 
#define	cfoe_FOT_pullin_th_pos 0
#define	cfoe_FOT_pullin_th_len 8
#define	cfoe_FOT_pullin_th_lsb 0
#define xd_p_cfoe_FOT_kalman_cnt	(*(volatile byte xdata *) 0xF419)
#define    p_cfoe_FOT_kalman_cnt	0xF419 
#define	cfoe_FOT_kalman_cnt_pos 0
#define	cfoe_FOT_kalman_cnt_len 4
#define	cfoe_FOT_kalman_cnt_lsb 0
#define xd_p_cfoe_FOT_fsm_info	(*(volatile byte xdata *) 0xF41A)
#define    p_cfoe_FOT_fsm_info	0xF41A 
#define	cfoe_FOT_fsm_info_pos 0
#define	cfoe_FOT_fsm_info_len 4
#define	cfoe_FOT_fsm_info_lsb 0
#define xd_r_cfoe_FOT_pullin_cnt	(*(volatile byte xdata *) 0xF41B)
#define    r_cfoe_FOT_pullin_cnt	0xF41B 
#define	cfoe_FOT_pullin_cnt_pos 0
#define	cfoe_FOT_pullin_cnt_len 4
#define	cfoe_FOT_pullin_cnt_lsb 0
#define xd_r_cfoe_FOT_sf_cnt	(*(volatile byte xdata *) 0xF41C)
#define    r_cfoe_FOT_sf_cnt	0xF41C 
#define	cfoe_FOT_sf_cnt_pos 0
#define	cfoe_FOT_sf_cnt_len 4
#define	cfoe_FOT_sf_cnt_lsb 0
#define xd_r_reg_r_cfoe_ifoe_ifo_metric	(*(volatile byte xdata *) 0xF41D)
#define    r_reg_r_cfoe_ifoe_ifo_metric	0xF41D 
#define	reg_r_cfoe_ifoe_ifo_metric_pos 0
#define	reg_r_cfoe_ifoe_ifo_metric_len 8
#define	reg_r_cfoe_ifoe_ifo_metric_lsb 0
#define xd_r_reg_r_cfoe_ifoe_cos2num_7_0	(*(volatile byte xdata *) 0xF41E)
#define    r_reg_r_cfoe_ifoe_cos2num_7_0	0xF41E 
#define	reg_r_cfoe_ifoe_cos2num_7_0_pos 0
#define	reg_r_cfoe_ifoe_cos2num_7_0_len 8
#define	reg_r_cfoe_ifoe_cos2num_7_0_lsb 0
#define xd_r_reg_r_cfoe_ifoe_cos2num_15_8	(*(volatile byte xdata *) 0xF41F)
#define    r_reg_r_cfoe_ifoe_cos2num_15_8	0xF41F 
#define	reg_r_cfoe_ifoe_cos2num_15_8_pos 0
#define	reg_r_cfoe_ifoe_cos2num_15_8_len 8
#define	reg_r_cfoe_ifoe_cos2num_15_8_lsb 8
#define xd_r_reg_r_cfoe_ifoe_cos2num_19_16	(*(volatile byte xdata *) 0xF420)
#define    r_reg_r_cfoe_ifoe_cos2num_19_16	0xF420 
#define	reg_r_cfoe_ifoe_cos2num_19_16_pos 0
#define	reg_r_cfoe_ifoe_cos2num_19_16_len 4
#define	reg_r_cfoe_ifoe_cos2num_19_16_lsb 16
#define xd_p_ste_Nu	(*(volatile byte xdata *) 0xF460)
#define    p_ste_Nu	0xF460 
#define	ste_Nu_pos 0
#define	ste_Nu_len 3
#define	ste_Nu_lsb 0
#define xd_p_ste_GI	(*(volatile byte xdata *) 0xF461)
#define    p_ste_GI	0xF461 
#define	ste_GI_pos 0
#define	ste_GI_len 3
#define	ste_GI_lsb 0
#define xd_p_ste_symbol_num	(*(volatile byte xdata *) 0xF463)
#define    p_ste_symbol_num	0xF463 
#define	ste_symbol_num_pos 0
#define	ste_symbol_num_len 3
#define	ste_symbol_num_lsb 0
#define xd_p_ste_sample_num	(*(volatile byte xdata *) 0xF464)
#define    p_ste_sample_num	0xF464 
#define	ste_sample_num_pos 0
#define	ste_sample_num_len 2
#define	ste_sample_num_lsb 0
#define xd_p_ste_symbol_num_4K	(*(volatile byte xdata *) 0xF465)
#define    p_ste_symbol_num_4K	0xF465 
#define	ste_symbol_num_4K_pos 0
#define	ste_symbol_num_4K_len 3
#define	ste_symbol_num_4K_lsb 0
#define xd_p_ste_FFT_offset_7_0	(*(volatile byte xdata *) 0xF466)
#define    p_ste_FFT_offset_7_0	0xF466 
#define	ste_FFT_offset_7_0_pos 0
#define	ste_FFT_offset_7_0_len 8
#define	ste_FFT_offset_7_0_lsb 0
#define xd_p_ste_FFT_offset_13_8	(*(volatile byte xdata *) 0xF467)
#define    p_ste_FFT_offset_13_8	0xF467 
#define	ste_FFT_offset_13_8_pos 0
#define	ste_FFT_offset_13_8_len 6
#define	ste_FFT_offset_13_8_lsb 8
#define xd_p_ste_sample_num_4K	(*(volatile byte xdata *) 0xF468)
#define    p_ste_sample_num_4K	0xF468 
#define	ste_sample_num_4K_pos 0
#define	ste_sample_num_4K_len 2
#define	ste_sample_num_4K_lsb 0
#define xd_p_ste_adv_start_7_0	(*(volatile byte xdata *) 0xF469)
#define    p_ste_adv_start_7_0	0xF469 
#define	ste_adv_start_7_0_pos 0
#define	ste_adv_start_7_0_len 8
#define	ste_adv_start_7_0_lsb 0
#define xd_p_ste_adv_start_10_8	(*(volatile byte xdata *) 0xF46A)
#define    p_ste_adv_start_10_8	0xF46A 
#define	ste_adv_start_10_8_pos 0
#define	ste_adv_start_10_8_len 3
#define	ste_adv_start_10_8_lsb 8
#define xd_p_ste_symbol_num_8K	(*(volatile byte xdata *) 0xF46B)
#define    p_ste_symbol_num_8K	0xF46B 
#define	ste_symbol_num_8K_pos 0
#define	ste_symbol_num_8K_len 3
#define	ste_symbol_num_8K_lsb 0
#define xd_p_ste_sample_num_8K	(*(volatile byte xdata *) 0xF46C)
#define    p_ste_sample_num_8K	0xF46C 
#define	ste_sample_num_8K_pos 0
#define	ste_sample_num_8K_len 2
#define	ste_sample_num_8K_lsb 0
#define xd_p_ste_adv_stop	(*(volatile byte xdata *) 0xF46D)
#define    p_ste_adv_stop	0xF46D 
#define	ste_adv_stop_pos 0
#define	ste_adv_stop_len 8
#define	ste_adv_stop_lsb 0
#define xd_r_ste_P_value_7_0	(*(volatile byte xdata *) 0xF46E)
#define    r_ste_P_value_7_0	0xF46E 
#define	ste_P_value_7_0_pos 0
#define	ste_P_value_7_0_len 8
#define	ste_P_value_7_0_lsb 0
#define xd_r_ste_P_value_10_8	(*(volatile byte xdata *) 0xF46F)
#define    r_ste_P_value_10_8	0xF46F 
#define	ste_P_value_10_8_pos 0
#define	ste_P_value_10_8_len 3
#define	ste_P_value_10_8_lsb 8
#define xd_p_reg_ste_tstmod	(*(volatile byte xdata *) 0xF470)
#define    p_reg_ste_tstmod	0xF470 
#define	reg_ste_tstmod_pos 0
#define	reg_ste_tstmod_len 1
#define	reg_ste_tstmod_lsb 0
#define xd_p_reg_ste_buf_en	(*(volatile byte xdata *) 0xF471)
#define    p_reg_ste_buf_en	0xF471 
#define	reg_ste_buf_en_pos 0
#define	reg_ste_buf_en_len 1
#define	reg_ste_buf_en_lsb 0
#define xd_r_ste_M_value_7_0	(*(volatile byte xdata *) 0xF472)
#define    r_ste_M_value_7_0	0xF472 
#define	ste_M_value_7_0_pos 0
#define	ste_M_value_7_0_len 8
#define	ste_M_value_7_0_lsb 0
#define xd_r_ste_M_value_10_8	(*(volatile byte xdata *) 0xF473)
#define    r_ste_M_value_10_8	0xF473 
#define	ste_M_value_10_8_pos 0
#define	ste_M_value_10_8_len 3
#define	ste_M_value_10_8_lsb 8
#define xd_r_ste_H1	(*(volatile byte xdata *) 0xF474)
#define    r_ste_H1	0xF474 
#define	ste_H1_pos 0
#define	ste_H1_len 7
#define	ste_H1_lsb 0
#define xd_r_ste_H2	(*(volatile byte xdata *) 0xF475)
#define    r_ste_H2	0xF475 
#define	ste_H2_pos 0
#define	ste_H2_len 7
#define	ste_H2_lsb 0
#define xd_r_ste_H3	(*(volatile byte xdata *) 0xF476)
#define    r_ste_H3	0xF476 
#define	ste_H3_pos 0
#define	ste_H3_len 7
#define	ste_H3_lsb 0
#define xd_r_ste_H4	(*(volatile byte xdata *) 0xF477)
#define    r_ste_H4	0xF477 
#define	ste_H4_pos 0
#define	ste_H4_len 7
#define	ste_H4_lsb 0
#define xd_r_ste_Corr_value_I_7_0	(*(volatile byte xdata *) 0xF478)
#define    r_ste_Corr_value_I_7_0	0xF478 
#define	ste_Corr_value_I_7_0_pos 0
#define	ste_Corr_value_I_7_0_len 8
#define	ste_Corr_value_I_7_0_lsb 0
#define xd_r_ste_Corr_value_I_15_8	(*(volatile byte xdata *) 0xF479)
#define    r_ste_Corr_value_I_15_8	0xF479 
#define	ste_Corr_value_I_15_8_pos 0
#define	ste_Corr_value_I_15_8_len 8
#define	ste_Corr_value_I_15_8_lsb 8
#define xd_r_ste_Corr_value_I_23_16	(*(volatile byte xdata *) 0xF47A)
#define    r_ste_Corr_value_I_23_16	0xF47A 
#define	ste_Corr_value_I_23_16_pos 0
#define	ste_Corr_value_I_23_16_len 8
#define	ste_Corr_value_I_23_16_lsb 16
#define xd_r_ste_Corr_value_I_27_24	(*(volatile byte xdata *) 0xF47B)
#define    r_ste_Corr_value_I_27_24	0xF47B 
#define	ste_Corr_value_I_27_24_pos 0
#define	ste_Corr_value_I_27_24_len 4
#define	ste_Corr_value_I_27_24_lsb 24
#define xd_r_ste_Corr_value_Q_7_0	(*(volatile byte xdata *) 0xF47C)
#define    r_ste_Corr_value_Q_7_0	0xF47C 
#define	ste_Corr_value_Q_7_0_pos 0
#define	ste_Corr_value_Q_7_0_len 8
#define	ste_Corr_value_Q_7_0_lsb 0
#define xd_r_ste_Corr_value_Q_15_8	(*(volatile byte xdata *) 0xF47D)
#define    r_ste_Corr_value_Q_15_8	0xF47D 
#define	ste_Corr_value_Q_15_8_pos 0
#define	ste_Corr_value_Q_15_8_len 8
#define	ste_Corr_value_Q_15_8_lsb 8
#define xd_r_ste_Corr_value_Q_23_16	(*(volatile byte xdata *) 0xF47E)
#define    r_ste_Corr_value_Q_23_16	0xF47E 
#define	ste_Corr_value_Q_23_16_pos 0
#define	ste_Corr_value_Q_23_16_len 8
#define	ste_Corr_value_Q_23_16_lsb 16
#define xd_r_ste_Corr_value_Q_27_24	(*(volatile byte xdata *) 0xF47F)
#define    r_ste_Corr_value_Q_27_24	0xF47F 
#define	ste_Corr_value_Q_27_24_pos 0
#define	ste_Corr_value_Q_27_24_len 4
#define	ste_Corr_value_Q_27_24_lsb 24
#define xd_r_ste_J_num_7_0	(*(volatile byte xdata *) 0xF480)
#define    r_ste_J_num_7_0	0xF480 
#define	ste_J_num_7_0_pos 0
#define	ste_J_num_7_0_len 8
#define	ste_J_num_7_0_lsb 0
#define xd_r_ste_J_num_15_8	(*(volatile byte xdata *) 0xF481)
#define    r_ste_J_num_15_8	0xF481 
#define	ste_J_num_15_8_pos 0
#define	ste_J_num_15_8_len 8
#define	ste_J_num_15_8_lsb 8
#define xd_r_ste_J_num_23_16	(*(volatile byte xdata *) 0xF482)
#define    r_ste_J_num_23_16	0xF482 
#define	ste_J_num_23_16_pos 0
#define	ste_J_num_23_16_len 8
#define	ste_J_num_23_16_lsb 16
#define xd_r_ste_J_num_31_24	(*(volatile byte xdata *) 0xF483)
#define    r_ste_J_num_31_24	0xF483 
#define	ste_J_num_31_24_pos 0
#define	ste_J_num_31_24_len 8
#define	ste_J_num_31_24_lsb 24
#define xd_r_ste_J_den_7_0	(*(volatile byte xdata *) 0xF484)
#define    r_ste_J_den_7_0	0xF484 
#define	ste_J_den_7_0_pos 0
#define	ste_J_den_7_0_len 8
#define	ste_J_den_7_0_lsb 0
#define xd_r_ste_J_den_15_8	(*(volatile byte xdata *) 0xF485)
#define    r_ste_J_den_15_8	0xF485 
#define	ste_J_den_15_8_pos 0
#define	ste_J_den_15_8_len 8
#define	ste_J_den_15_8_lsb 8
#define xd_r_ste_J_den_18_16	(*(volatile byte xdata *) 0xF486)
#define    r_ste_J_den_18_16	0xF486 
#define	ste_J_den_18_16_pos 0
#define	ste_J_den_18_16_len 3
#define	ste_J_den_18_16_lsb 16
#define xd_r_ste_Beacon_Indicator	(*(volatile byte xdata *) 0xF488)
#define    r_ste_Beacon_Indicator	0xF488 
#define	ste_Beacon_Indicator_pos 0
#define	ste_Beacon_Indicator_len 1
#define	ste_Beacon_Indicator_lsb 0
#define xd_p_ste_got_sntc_bcn	(*(volatile byte xdata *) 0xF48B)
#define    p_ste_got_sntc_bcn	0xF48B 
#define	ste_got_sntc_bcn_pos 0
#define	ste_got_sntc_bcn_len 1
#define	ste_got_sntc_bcn_lsb 0
#define xd_r_tpsd_Frame_Num	(*(volatile byte xdata *) 0xF4C0)
#define    r_tpsd_Frame_Num	0xF4C0 
#define	tpsd_Frame_Num_pos 0
#define	tpsd_Frame_Num_len 2
#define	tpsd_Frame_Num_lsb 0
#define xd_r_tpsd_Constel	(*(volatile byte xdata *) 0xF4C1)
#define    r_tpsd_Constel	0xF4C1 
#define	tpsd_Constel_pos 0
#define	tpsd_Constel_len 2
#define	tpsd_Constel_lsb 0
#define xd_r_tpsd_GI	(*(volatile byte xdata *) 0xF4C2)
#define    r_tpsd_GI	0xF4C2 
#define	tpsd_GI_pos 0
#define	tpsd_GI_len 2
#define	tpsd_GI_lsb 0
#define xd_r_tpsd_Mode	(*(volatile byte xdata *) 0xF4C3)
#define    r_tpsd_Mode	0xF4C3 
#define	tpsd_Mode_pos 0
#define	tpsd_Mode_len 2
#define	tpsd_Mode_lsb 0
#define xd_r_tpsd_CR_HP	(*(volatile byte xdata *) 0xF4C4)
#define    r_tpsd_CR_HP	0xF4C4 
#define	tpsd_CR_HP_pos 0
#define	tpsd_CR_HP_len 3
#define	tpsd_CR_HP_lsb 0
#define xd_r_tpsd_CR_LP	(*(volatile byte xdata *) 0xF4C5)
#define    r_tpsd_CR_LP	0xF4C5 
#define	tpsd_CR_LP_pos 0
#define	tpsd_CR_LP_len 3
#define	tpsd_CR_LP_lsb 0
#define xd_r_tpsd_Hie	(*(volatile byte xdata *) 0xF4C6)
#define    r_tpsd_Hie	0xF4C6 
#define	tpsd_Hie_pos 0
#define	tpsd_Hie_len 3
#define	tpsd_Hie_lsb 0
#define xd_r_tpsd_Res_Bits	(*(volatile byte xdata *) 0xF4C7)
#define    r_tpsd_Res_Bits	0xF4C7 
#define	tpsd_Res_Bits_pos 0
#define	tpsd_Res_Bits_len 5
#define	tpsd_Res_Bits_lsb 0
#define xd_r_tpsd_Res_Bits_0	(*(volatile byte xdata *) 0xF4C8)
#define    r_tpsd_Res_Bits_0	0xF4C8 
#define	tpsd_Res_Bits_0_pos 0
#define	tpsd_Res_Bits_0_len 1
#define	tpsd_Res_Bits_0_lsb 0
#define xd_r_tpsd_LengthInd	(*(volatile byte xdata *) 0xF4C9)
#define    r_tpsd_LengthInd	0xF4C9 
#define	tpsd_LengthInd_pos 0
#define	tpsd_LengthInd_len 6
#define	tpsd_LengthInd_lsb 0
#define xd_r_tpsd_Cell_Id_7_0	(*(volatile byte xdata *) 0xF4CA)
#define    r_tpsd_Cell_Id_7_0	0xF4CA 
#define	tpsd_Cell_Id_7_0_pos 0
#define	tpsd_Cell_Id_7_0_len 8
#define	tpsd_Cell_Id_7_0_lsb 0
#define xd_r_tpsd_Cell_Id_15_8	(*(volatile byte xdata *) 0xF4CB)
#define    r_tpsd_Cell_Id_15_8	0xF4CB 
#define	tpsd_Cell_Id_15_8_pos 0
#define	tpsd_Cell_Id_15_8_len 8
#define	tpsd_Cell_Id_15_8_lsb 0
#define xd_r_tpsd_use_InDepthInt	(*(volatile byte xdata *) 0xF4CC)
#define    r_tpsd_use_InDepthInt	0xF4CC 
#define	tpsd_use_InDepthInt_pos 0
#define	tpsd_use_InDepthInt_len 1
#define	tpsd_use_InDepthInt_lsb 0
#define xd_r_tpsd_use_TimeSlicing_HP	(*(volatile byte xdata *) 0xF4CD)
#define    r_tpsd_use_TimeSlicing_HP	0xF4CD 
#define	tpsd_use_TimeSlicing_HP_pos 0
#define	tpsd_use_TimeSlicing_HP_len 1
#define	tpsd_use_TimeSlicing_HP_lsb 0
#define xd_r_tpsd_use_mpe_fec_HP	(*(volatile byte xdata *) 0xF4CE)
#define    r_tpsd_use_mpe_fec_HP	0xF4CE 
#define	tpsd_use_mpe_fec_HP_pos 0
#define	tpsd_use_mpe_fec_HP_len 1
#define	tpsd_use_mpe_fec_HP_lsb 0
#define xd_r_tpsd_use_TimeSlicing_LP	(*(volatile byte xdata *) 0xF4CF)
#define    r_tpsd_use_TimeSlicing_LP	0xF4CF 
#define	tpsd_use_TimeSlicing_LP_pos 0
#define	tpsd_use_TimeSlicing_LP_len 1
#define	tpsd_use_TimeSlicing_LP_lsb 0
#define xd_r_tpsd_use_mpe_fec_LP	(*(volatile byte xdata *) 0xF4D0)
#define    r_tpsd_use_mpe_fec_LP	0xF4D0 
#define	tpsd_use_mpe_fec_LP_pos 0
#define	tpsd_use_mpe_fec_LP_len 1
#define	tpsd_use_mpe_fec_LP_lsb 0
#define xd_r_tpsd_leng23_ind_return	(*(volatile byte xdata *) 0xF4D1)
#define    r_tpsd_leng23_ind_return	0xF4D1 
#define	tpsd_leng23_ind_return_pos 0
#define	tpsd_leng23_ind_return_len 1
#define	tpsd_leng23_ind_return_lsb 0
#define xd_p_reg_fft_re_exp	(*(volatile byte xdata *) 0xF500)
#define    p_reg_fft_re_exp	0xF500 
#define	reg_fft_re_exp_pos 0
#define	reg_fft_re_exp_len 4
#define	reg_fft_re_exp_lsb 0
#define xd_p_reg_fft_re_mts	(*(volatile byte xdata *) 0xF501)
#define    p_reg_fft_re_mts	0xF501 
#define	reg_fft_re_mts_pos 0
#define	reg_fft_re_mts_len 8
#define	reg_fft_re_mts_lsb 0
#define xd_p_reg_fft_im_exp	(*(volatile byte xdata *) 0xF502)
#define    p_reg_fft_im_exp	0xF502 
