liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_fft_im_exp_pos 0
#define	reg_fft_im_exp_len 4
#define	reg_fft_im_exp_lsb 0
#define xd_p_reg_fft_im_mts	(*(volatile byte xdata *) 0xF503)
#define    p_reg_fft_im_mts	0xF503 
#define	reg_fft_im_mts_pos 0
#define	reg_fft_im_mts_len 8
#define	reg_fft_im_mts_lsb 0
#define xd_p_reg_fft_conjugate	(*(volatile byte xdata *) 0xF504)
#define    p_reg_fft_conjugate	0xF504 
#define	reg_fft_conjugate_pos 0
#define	reg_fft_conjugate_len 1
#define	reg_fft_conjugate_lsb 0
#define xd_p_reg_fft_power_en	(*(volatile byte xdata *) 0xF505)
#define    p_reg_fft_power_en	0xF505 
#define	reg_fft_power_en_pos 0
#define	reg_fft_power_en_len 1
#define	reg_fft_power_en_lsb 0
#define xd_p_reg_fft_power_factor	(*(volatile byte xdata *) 0xF506)
#define    p_reg_fft_power_factor	0xF506 
#define	reg_fft_power_factor_pos 0
#define	reg_fft_power_factor_len 6
#define	reg_fft_power_factor_lsb 0
#define xd_p_reg_fft_power_in	(*(volatile byte xdata *) 0xF507)
#define    p_reg_fft_power_in	0xF507 
#define	reg_fft_power_in_pos 0
#define	reg_fft_power_in_len 8
#define	reg_fft_power_in_lsb 0
#define xd_p_reg_fft_mask_from0_7_0	(*(volatile byte xdata *) 0xF508)
#define    p_reg_fft_mask_from0_7_0	0xF508 
#define	reg_fft_mask_from0_7_0_pos 0
#define	reg_fft_mask_from0_7_0_len 8
#define	reg_fft_mask_from0_7_0_lsb 0
#define xd_p_reg_fft_mask_from0_12_8	(*(volatile byte xdata *) 0xF509)
#define    p_reg_fft_mask_from0_12_8	0xF509 
#define	reg_fft_mask_from0_12_8_pos 0
#define	reg_fft_mask_from0_12_8_len 5
#define	reg_fft_mask_from0_12_8_lsb 8
#define xd_p_reg_fft_mask_to0_7_0	(*(volatile byte xdata *) 0xF50A)
#define    p_reg_fft_mask_to0_7_0	0xF50A 
#define	reg_fft_mask_to0_7_0_pos 0
#define	reg_fft_mask_to0_7_0_len 8
#define	reg_fft_mask_to0_7_0_lsb 0
#define xd_p_reg_fft_mask_to0_12_8	(*(volatile byte xdata *) 0xF50B)
#define    p_reg_fft_mask_to0_12_8	0xF50B 
#define	reg_fft_mask_to0_12_8_pos 0
#define	reg_fft_mask_to0_12_8_len 5
#define	reg_fft_mask_to0_12_8_lsb 8
#define xd_p_reg_fft_mask_from1_7_0	(*(volatile byte xdata *) 0xF50C)
#define    p_reg_fft_mask_from1_7_0	0xF50C 
#define	reg_fft_mask_from1_7_0_pos 0
#define	reg_fft_mask_from1_7_0_len 8
#define	reg_fft_mask_from1_7_0_lsb 0
#define xd_p_reg_fft_mask_from1_12_8	(*(volatile byte xdata *) 0xF50D)
#define    p_reg_fft_mask_from1_12_8	0xF50D 
#define	reg_fft_mask_from1_12_8_pos 0
#define	reg_fft_mask_from1_12_8_len 5
#define	reg_fft_mask_from1_12_8_lsb 8
#define xd_p_reg_fft_mask_to1_7_0	(*(volatile byte xdata *) 0xF50E)
#define    p_reg_fft_mask_to1_7_0	0xF50E 
#define	reg_fft_mask_to1_7_0_pos 0
#define	reg_fft_mask_to1_7_0_len 8
#define	reg_fft_mask_to1_7_0_lsb 0
#define xd_p_reg_fft_mask_to1_12_8	(*(volatile byte xdata *) 0xF50F)
#define    p_reg_fft_mask_to1_12_8	0xF50F 
#define	reg_fft_mask_to1_12_8_pos 0
#define	reg_fft_mask_to1_12_8_len 5
#define	reg_fft_mask_to1_12_8_lsb 8
#define xd_p_reg_fft_mask_from2_7_0	(*(volatile byte xdata *) 0xF510)
#define    p_reg_fft_mask_from2_7_0	0xF510 
#define	reg_fft_mask_from2_7_0_pos 0
#define	reg_fft_mask_from2_7_0_len 8
#define	reg_fft_mask_from2_7_0_lsb 0
#define xd_p_reg_fft_mask_from2_12_8	(*(volatile byte xdata *) 0xF511)
#define    p_reg_fft_mask_from2_12_8	0xF511 
#define	reg_fft_mask_from2_12_8_pos 0
#define	reg_fft_mask_from2_12_8_len 5
#define	reg_fft_mask_from2_12_8_lsb 8
#define xd_p_reg_fft_mask_to2_7_0	(*(volatile byte xdata *) 0xF512)
#define    p_reg_fft_mask_to2_7_0	0xF512 
#define	reg_fft_mask_to2_7_0_pos 0
#define	reg_fft_mask_to2_7_0_len 8
#define	reg_fft_mask_to2_7_0_lsb 0
#define xd_p_reg_fft_mask_to2_12_8	(*(volatile byte xdata *) 0xF513)
#define    p_reg_fft_mask_to2_12_8	0xF513 
#define	reg_fft_mask_to2_12_8_pos 0
#define	reg_fft_mask_to2_12_8_len 5
#define	reg_fft_mask_to2_12_8_lsb 8
#define xd_p_reg_fft_mask_from3_7_0	(*(volatile byte xdata *) 0xF514)
#define    p_reg_fft_mask_from3_7_0	0xF514 
#define	reg_fft_mask_from3_7_0_pos 0
#define	reg_fft_mask_from3_7_0_len 8
#define	reg_fft_mask_from3_7_0_lsb 0
#define xd_p_reg_fft_mask_from3_12_8	(*(volatile byte xdata *) 0xF515)
#define    p_reg_fft_mask_from3_12_8	0xF515 
#define	reg_fft_mask_from3_12_8_pos 0
#define	reg_fft_mask_from3_12_8_len 5
#define	reg_fft_mask_from3_12_8_lsb 8
#define xd_p_reg_fft_mask_to3_7_0	(*(volatile byte xdata *) 0xF516)
#define    p_reg_fft_mask_to3_7_0	0xF516 
#define	reg_fft_mask_to3_7_0_pos 0
#define	reg_fft_mask_to3_7_0_len 8
#define	reg_fft_mask_to3_7_0_lsb 0
#define xd_p_reg_fft_mask_to3_12_8	(*(volatile byte xdata *) 0xF517)
#define    p_reg_fft_mask_to3_12_8	0xF517 
#define	reg_fft_mask_to3_12_8_pos 0
#define	reg_fft_mask_to3_12_8_len 5
#define	reg_fft_mask_to3_12_8_lsb 8
#define xd_r_fd_sntc_frame_num	(*(volatile byte xdata *) 0xF518)
#define    r_fd_sntc_frame_num	0xF518 
#define	fd_sntc_frame_num_pos 0
#define	fd_sntc_frame_num_len 2
#define	fd_sntc_frame_num_lsb 0
#define xd_r_fd_sntc_symbol_count	(*(volatile byte xdata *) 0xF519)
#define    r_fd_sntc_symbol_count	0xF519 
#define	fd_sntc_symbol_count_pos 0
#define	fd_sntc_symbol_count_len 7
#define	fd_sntc_symbol_count_lsb 0
#define xd_p_reg_sntc_cnt_lo	(*(volatile byte xdata *) 0xF51A)
#define    p_reg_sntc_cnt_lo	0xF51A 
#define	reg_sntc_cnt_lo_pos 0
#define	reg_sntc_cnt_lo_len 8
#define	reg_sntc_cnt_lo_lsb 0
#define xd_p_reg_sntc_cnt_hi	(*(volatile byte xdata *) 0xF51B)
#define    p_reg_sntc_cnt_hi	0xF51B 
#define	reg_sntc_cnt_hi_pos 0
#define	reg_sntc_cnt_hi_len 7
#define	reg_sntc_cnt_hi_lsb 0
#define xd_p_reg_sntc_fft_in	(*(volatile byte xdata *) 0xF51C)
#define    p_reg_sntc_fft_in	0xF51C 
#define	reg_sntc_fft_in_pos 0
#define	reg_sntc_fft_in_len 1
#define	reg_sntc_fft_in_lsb 0
#define xd_r_fd_sntc_en	(*(volatile byte xdata *) 0xF51D)
#define    r_fd_sntc_en	0xF51D 
#define	fd_sntc_en_pos 0
#define	fd_sntc_en_len 1
#define	fd_sntc_en_lsb 0
#define xd_p_reg_sntc_x2	(*(volatile byte xdata *) 0xF51E)
#define    p_reg_sntc_x2	0xF51E 
#define	reg_sntc_x2_pos 0
#define	reg_sntc_x2_len 1
#define	reg_sntc_x2_lsb 0
#define xd_p_reg_cge_en_7_0	(*(volatile byte xdata *) 0xF51F)
#define    p_reg_cge_en_7_0	0xF51F 
#define	reg_cge_en_7_0_pos 0
#define	reg_cge_en_7_0_len 8
#define	reg_cge_en_7_0_lsb 0
#define xd_p_reg_cge_en_15_8	(*(volatile byte xdata *) 0xF520)
#define    p_reg_cge_en_15_8	0xF520 
#define	reg_cge_en_15_8_pos 0
#define	reg_cge_en_15_8_len 8
#define	reg_cge_en_15_8_lsb 8
#define xd_p_reg_cge_en_23_16	(*(volatile byte xdata *) 0xF521)
#define    p_reg_cge_en_23_16	0xF521 
#define	reg_cge_en_23_16_pos 0
#define	reg_cge_en_23_16_len 8
#define	reg_cge_en_23_16_lsb 16
#define xd_p_reg_cge_en_31_24	(*(volatile byte xdata *) 0xF522)
#define    p_reg_cge_en_31_24	0xF522 
#define	reg_cge_en_31_24_pos 0
#define	reg_cge_en_31_24_len 8
#define	reg_cge_en_31_24_lsb 24
#define xd_p_reg_cge_en_39_32	(*(volatile byte xdata *) 0xF523)
#define    p_reg_cge_en_39_32	0xF523 
#define	reg_cge_en_39_32_pos 0
#define	reg_cge_en_39_32_len 8
#define	reg_cge_en_39_32_lsb 32
#define xd_p_reg_cge_en_43_40	(*(volatile byte xdata *) 0xF524)
#define    p_reg_cge_en_43_40	0xF524 
#define	reg_cge_en_43_40_pos 0
#define	reg_cge_en_43_40_len 4
#define	reg_cge_en_43_40_lsb 40
#define xd_p_reg_fft_sat_en	(*(volatile byte xdata *) 0xF525)
#define    p_reg_fft_sat_en	0xF525 
#define	reg_fft_sat_en_pos 0
#define	reg_fft_sat_en_len 1
#define	reg_fft_sat_en_lsb 0
#define xd_p_reg_fft_sat_count_clr	(*(volatile byte xdata *) 0xF526)
#define    p_reg_fft_sat_count_clr	0xF526 
#define	reg_fft_sat_count_clr_pos 0
#define	reg_fft_sat_count_clr_len 1
#define	reg_fft_sat_count_clr_lsb 0
#define xd_p_reg_fft_rescale_round	(*(volatile byte xdata *) 0xF527)
#define    p_reg_fft_rescale_round	0xF527 
#define	reg_fft_rescale_round_pos 0
#define	reg_fft_rescale_round_len 1
#define	reg_fft_rescale_round_lsb 0
#define xd_r_reg_fft_sat_count_12_7_0	(*(volatile byte xdata *) 0xF528)
#define    r_reg_fft_sat_count_12_7_0	0xF528 
#define	reg_fft_sat_count_12_7_0_pos 0
#define	reg_fft_sat_count_12_7_0_len 8
#define	reg_fft_sat_count_12_7_0_lsb 0
#define xd_r_reg_fft_sat_count_12_15_8	(*(volatile byte xdata *) 0xF529)
#define    r_reg_fft_sat_count_12_15_8	0xF529 
#define	reg_fft_sat_count_12_15_8_pos 0
#define	reg_fft_sat_count_12_15_8_len 8
#define	reg_fft_sat_count_12_15_8_lsb 8
#define xd_r_reg_fft_sat_count_10_7_0	(*(volatile byte xdata *) 0xF52A)
#define    r_reg_fft_sat_count_10_7_0	0xF52A 
#define	reg_fft_sat_count_10_7_0_pos 0
#define	reg_fft_sat_count_10_7_0_len 8
#define	reg_fft_sat_count_10_7_0_lsb 0
#define xd_r_reg_fft_sat_count_10_15_8	(*(volatile byte xdata *) 0xF52B)
#define    r_reg_fft_sat_count_10_15_8	0xF52B 
#define	reg_fft_sat_count_10_15_8_pos 0
#define	reg_fft_sat_count_10_15_8_len 8
#define	reg_fft_sat_count_10_15_8_lsb 8
#define xd_p_reg_fft_capture_idx_7_0	(*(volatile byte xdata *) 0xF52C)
#define    p_reg_fft_capture_idx_7_0	0xF52C 
#define	reg_fft_capture_idx_7_0_pos 0
#define	reg_fft_capture_idx_7_0_len 8
#define	reg_fft_capture_idx_7_0_lsb 0
#define xd_p_reg_fft_capture_idx_12_8	(*(volatile byte xdata *) 0xF52D)
#define    p_reg_fft_capture_idx_12_8	0xF52D 
#define	reg_fft_capture_idx_12_8_pos 0
#define	reg_fft_capture_idx_12_8_len 5
#define	reg_fft_capture_idx_12_8_lsb 8
#define xd_p_reg_fft_capture	(*(volatile byte xdata *) 0xF52E)
#define    p_reg_fft_capture	0xF52E 
#define	reg_fft_capture_pos 0
#define	reg_fft_capture_len 1
#define	reg_fft_capture_lsb 0
#define xd_p_reg_gp_trigger_fd	(*(volatile byte xdata *) 0xF52F)
#define    p_reg_gp_trigger_fd	0xF52F 
#define	reg_gp_trigger_fd_pos 0
#define	reg_gp_trigger_fd_len 1
#define	reg_gp_trigger_fd_lsb 0
#define xd_p_reg_trigger_sel_fd	(*(volatile byte xdata *) 0xF530)
#define    p_reg_trigger_sel_fd	0xF530 
#define	reg_trigger_sel_fd_pos 0
#define	reg_trigger_sel_fd_len 2
#define	reg_trigger_sel_fd_lsb 0
#define xd_p_reg_trigger_module_sel_fd	(*(volatile byte xdata *) 0xF531)
#define    p_reg_trigger_module_sel_fd	0xF531 
#define	reg_trigger_module_sel_fd_pos 0
#define	reg_trigger_module_sel_fd_len 6
#define	reg_trigger_module_sel_fd_lsb 0
#define xd_p_reg_trigger_set_sel_fd	(*(volatile byte xdata *) 0xF532)
#define    p_reg_trigger_set_sel_fd	0xF532 
#define	reg_trigger_set_sel_fd_pos 0
#define	reg_trigger_set_sel_fd_len 6
#define	reg_trigger_set_sel_fd_lsb 0
#define xd_r_reg_fft_idx_pre_max_7_0	(*(volatile byte xdata *) 0xF533)
#define    r_reg_fft_idx_pre_max_7_0	0xF533 
#define	reg_fft_idx_pre_max_7_0_pos 0
#define	reg_fft_idx_pre_max_7_0_len 8
#define	reg_fft_idx_pre_max_7_0_lsb 0
#define xd_r_reg_fft_idx_pre_max_12_8	(*(volatile byte xdata *) 0xF534)
#define    r_reg_fft_idx_pre_max_12_8	0xF534 
#define	reg_fft_idx_pre_max_12_8_pos 0
#define	reg_fft_idx_pre_max_12_8_len 5
#define	reg_fft_idx_pre_max_12_8_lsb 8
#define xd_r_reg_fft_crc	(*(volatile byte xdata *) 0xF535)
#define    r_reg_fft_crc	0xF535 
#define	reg_fft_crc_pos 0
#define	reg_fft_crc_len 8
#define	reg_fft_crc_lsb 0
#define xd_p_fd_fft_shift_max	(*(volatile byte xdata *) 0xF536)
#define    p_fd_fft_shift_max	0xF536 
#define	fd_fft_shift_max_pos 0
#define	fd_fft_shift_max_len 4
#define	fd_fft_shift_max_lsb 0
#define xd_p_fd_fft_frame_num	(*(volatile byte xdata *) 0xF537)
#define    p_fd_fft_frame_num	0xF537 
#define	fd_fft_frame_num_pos 0
#define	fd_fft_frame_num_len 2
#define	fd_fft_frame_num_lsb 0
#define xd_p_fd_fft_symbol_count	(*(volatile byte xdata *) 0xF538)
#define    p_fd_fft_symbol_count	0xF538 
#define	fd_fft_symbol_count_pos 0
#define	fd_fft_symbol_count_len 7
#define	fd_fft_symbol_count_lsb 0
#define xd_r_reg_fft_idx_max_7_0	(*(volatile byte xdata *) 0xF539)
#define    r_reg_fft_idx_max_7_0	0xF539 
#define	reg_fft_idx_max_7_0_pos 0
#define	reg_fft_idx_max_7_0_len 8
#define	reg_fft_idx_max_7_0_lsb 0
#define xd_r_reg_fft_idx_max_12_8	(*(volatile byte xdata *) 0xF53A)
#define    r_reg_fft_idx_max_12_8	0xF53A 
#define	reg_fft_idx_max_12_8_pos 0
#define	reg_fft_idx_max_12_8_len 5
#define	reg_fft_idx_max_12_8_lsb 8
#define xd_p_reg_fft_rotate_en	(*(volatile byte xdata *) 0xF53B)
#define    p_reg_fft_rotate_en	0xF53B 
#define	reg_fft_rotate_en_pos 0
#define	reg_fft_rotate_en_len 1
#define	reg_fft_rotate_en_lsb 0
#define xd_p_reg_fft_rotate_base_7_0	(*(volatile byte xdata *) 0xF53C)
#define    p_reg_fft_rotate_base_7_0	0xF53C 
#define	reg_fft_rotate_base_7_0_pos 0
#define	reg_fft_rotate_base_7_0_len 8
#define	reg_fft_rotate_base_7_0_lsb 0
#define xd_p_reg_fft_rotate_base_12_8	(*(volatile byte xdata *) 0xF53D)
#define    p_reg_fft_rotate_base_12_8	0xF53D 
#define	reg_fft_rotate_base_12_8_pos 0
#define	reg_fft_rotate_base_12_8_len 5
#define	reg_fft_rotate_base_12_8_lsb 8
#define xd_r_fd_fpcc_cp_corr_signn	(*(volatile byte xdata *) 0xF53E)
#define    r_fd_fpcc_cp_corr_signn	0xF53E 
#define	fd_fpcc_cp_corr_signn_pos 0
#define	fd_fpcc_cp_corr_signn_len 8
#define	fd_fpcc_cp_corr_signn_lsb 0
#define xd_p_reg_feq_s1	(*(volatile byte xdata *) 0xF53F)
#define    p_reg_feq_s1	0xF53F 
#define	reg_feq_s1_pos 0
#define	reg_feq_s1_len 5
#define	reg_feq_s1_lsb 0
#define xd_p_reg_feq_sat_ind	(*(volatile byte xdata *) 0xF540)
#define    p_reg_feq_sat_ind	0xF540 
#define	reg_feq_sat_ind_pos 0
#define	reg_feq_sat_ind_len 3
#define	reg_feq_sat_ind_lsb 0
#define xd_p_reg_p_csi_cal_en	(*(volatile byte xdata *) 0xF541)
#define    p_reg_p_csi_cal_en	0xF541 
#define	reg_p_csi_cal_en_pos 0
#define	reg_p_csi_cal_en_len 1
#define	reg_p_csi_cal_en_lsb 0
#define xd_p_reg_p_csi_ar_mode	(*(volatile byte xdata *) 0xF542)
#define    p_reg_p_csi_ar_mode	0xF542 
#define	reg_p_csi_ar_mode_pos 0
#define	reg_p_csi_ar_mode_len 2
#define	reg_p_csi_ar_mode_lsb 0
#define xd_p_reg_p_csi_accu_sym_num	(*(volatile byte xdata *) 0xF543)
#define    p_reg_p_csi_accu_sym_num	0xF543 
#define	reg_p_csi_accu_sym_num_pos 0
#define	reg_p_csi_accu_sym_num_len 8
#define	reg_p_csi_accu_sym_num_lsb 0
#define xd_p_reg_p_csi_eh2_shift_thr	(*(volatile byte xdata *) 0xF544)
#define    p_reg_p_csi_eh2_shift_thr	0xF544 
#define	reg_p_csi_eh2_shift_thr_pos 0
#define	reg_p_csi_eh2_shift_thr_len 4
#define	reg_p_csi_eh2_shift_thr_lsb 0
#define xd_p_reg_p_feq_protect_eh2_shift_thr	(*(volatile byte xdata *) 0xF545)
#define    p_reg_p_feq_protect_eh2_shift_thr	0xF545 
#define	reg_p_feq_protect_eh2_shift_thr_pos 0
#define	reg_p_feq_protect_eh2_shift_thr_len 4
#define	reg_p_feq_protect_eh2_shift_thr_lsb 0
#define xd_p_reg_p_csi_error_accu_s1	(*(volatile byte xdata *) 0xF546)
#define    p_reg_p_csi_error_accu_s1	0xF546 
#define	reg_p_csi_error_accu_s1_pos 0
#define	reg_p_csi_error_accu_s1_len 6
#define	reg_p_csi_error_accu_s1_lsb 0
#define xd_p_reg_p_csi_shift2	(*(volatile byte xdata *) 0xF547)
#define    p_reg_p_csi_shift2	0xF547 
#define	reg_p_csi_shift2_pos 0
#define	reg_p_csi_shift2_len 4
#define	reg_p_csi_shift2_lsb 0
#define xd_p_reg_p_csi_mul2	(*(volatile byte xdata *) 0xF548)
#define    p_reg_p_csi_mul2	0xF548 
#define	reg_p_csi_mul2_pos 0
#define	reg_p_csi_mul2_len 8
#define	reg_p_csi_mul2_lsb 0
#define xd_p_reg_p_csi_level2_7_0	(*(volatile byte xdata *) 0xF549)
#define    p_reg_p_csi_level2_7_0	0xF549 
#define	reg_p_csi_level2_7_0_pos 0
#define	reg_p_csi_level2_7_0_len 8
#define	reg_p_csi_level2_7_0_lsb 0
#define xd_p_reg_p_csi_level2_8	(*(volatile byte xdata *) 0xF54A)
#define    p_reg_p_csi_level2_8	0xF54A 
#define	reg_p_csi_level2_8_pos 0
#define	reg_p_csi_level2_8_len 1
#define	reg_p_csi_level2_8_lsb 8
#define xd_p_reg_p_feq_protect_ratio	(*(volatile byte xdata *) 0xF54B)
#define    p_reg_p_feq_protect_ratio	0xF54B 
#define	reg_p_feq_protect_ratio_pos 0
#define	reg_p_feq_protect_ratio_len 8
#define	reg_p_feq_protect_ratio_lsb 0
#define xd_r_reg_csi_rdy	(*(volatile byte xdata *) 0xF54C)
#define    r_reg_csi_rdy	0xF54C 
#define	reg_csi_rdy_pos 0
#define	reg_csi_rdy_len 1
#define	reg_csi_rdy_lsb 0
#define xd_p_reg_p_feq_h2protect_en	(*(volatile byte xdata *) 0xF54D)
#define    p_reg_p_feq_h2protect_en	0xF54D 
#define	reg_p_feq_h2protect_en_pos 0
#define	reg_p_feq_h2protect_en_len 1
#define	reg_p_feq_h2protect_en_lsb 0
#define xd_r_reg_tpsd_lock_f0	(*(volatile byte xdata *) 0xF54E)
#define    r_reg_tpsd_lock_f0	0xF54E 
#define	reg_tpsd_lock_f0_pos 0
#define	reg_tpsd_lock_f0_len 1
#define	reg_tpsd_lock_f0_lsb 0
#define xd_r_reg_tpsd_lock_f1	(*(volatile byte xdata *) 0xF54F)
#define    r_reg_tpsd_lock_f1	0xF54F 
#define	reg_tpsd_lock_f1_pos 0
#define	reg_tpsd_lock_f1_len 1
#define	reg_tpsd_lock_f1_lsb 0
#define xd_p_reg_p_csi_sp_idx_7_0	(*(volatile byte xdata *) 0xF550)
#define    p_reg_p_csi_sp_idx_7_0	0xF550 
#define	reg_p_csi_sp_idx_7_0_pos 0
#define	reg_p_csi_sp_idx_7_0_len 8
#define	reg_p_csi_sp_idx_7_0_lsb 0
#define xd_p_reg_p_csi_sp_idx_11_8	(*(volatile byte xdata *) 0xF551)
#define    p_reg_p_csi_sp_idx_11_8	0xF551 
#define	reg_p_csi_sp_idx_11_8_pos 0
#define	reg_p_csi_sp_idx_11_8_len 4
#define	reg_p_csi_sp_idx_11_8_lsb 8
#define xd_p_fd_fpcc_cp_corr_tone_th	(*(volatile byte xdata *) 0xF552)
#define    p_fd_fpcc_cp_corr_tone_th	0xF552 
#define	fd_fpcc_cp_corr_tone_th_pos 0
#define	fd_fpcc_cp_corr_tone_th_len 6
#define	fd_fpcc_cp_corr_tone_th_lsb 0
#define xd_p_fd_fpcc_cp_corr_symbol_log_th	(*(volatile byte xdata *) 0xF553)
#define    p_fd_fpcc_cp_corr_symbol_log_th	0xF553 
#define	fd_fpcc_cp_corr_symbol_log_th_pos 0
#define	fd_fpcc_cp_corr_symbol_log_th_len 4
#define	fd_fpcc_cp_corr_symbol_log_th_lsb 0
#define xd_p_fd_fpcc_cp_corr_int	(*(volatile byte xdata *) 0xF554)
#define    p_fd_fpcc_cp_corr_int	0xF554 
#define	fd_fpcc_cp_corr_int_pos 0
#define	fd_fpcc_cp_corr_int_len 1
#define	fd_fpcc_cp_corr_int_lsb 0
#define xd_p_reg_fpcc_cp_memidx	(*(volatile byte xdata *) 0xF555)
#define    p_reg_fpcc_cp_memidx	0xF555 
#define	reg_fpcc_cp_memidx_pos 0
#define	reg_fpcc_cp_memidx_len 8
#define	reg_fpcc_cp_memidx_lsb 0
#define xd_p_reg_fpcc_cpmask_en	(*(volatile byte xdata *) 0xF556)
#define    p_reg_fpcc_cpmask_en	0xF556 
#define	reg_fpcc_cpmask_en_pos 0
#define	reg_fpcc_cpmask_en_len 1
#define	reg_fpcc_cpmask_en_lsb 0
#define xd_p_reg_fpcc_cp_grpidx	(*(volatile byte xdata *) 0xF557)
#define    p_reg_fpcc_cp_grpidx	0xF557 
#define	reg_fpcc_cp_grpidx_pos 0
#define	reg_fpcc_cp_grpidx_len 5
#define	reg_fpcc_cp_grpidx_lsb 0
#define xd_r_reg_fpcc_cp_sts	(*(volatile byte xdata *) 0xF558)
#define    r_reg_fpcc_cp_sts	0xF558 
#define	reg_fpcc_cp_sts_pos 0
#define	reg_fpcc_cp_sts_len 1
#define	reg_fpcc_cp_sts_lsb 0
#define xd_p_reg_sfoe_ns_7_0	(*(volatile byte xdata *) 0xF559)
#define    p_reg_sfoe_ns_7_0	0xF559 
#define	reg_sfoe_ns_7_0_pos 0
#define	reg_sfoe_ns_7_0_len 8
#define	reg_sfoe_ns_7_0_lsb 0
#define xd_p_reg_sfoe_ns_14_8	(*(volatile byte xdata *) 0xF55A)
#define    p_reg_sfoe_ns_14_8	0xF55A 
#define	reg_sfoe_ns_14_8_pos 0
#define	reg_sfoe_ns_14_8_len 7
#define	reg_sfoe_ns_14_8_lsb 8
#define xd_p_reg_sfoe_c1_7_0	(*(volatile byte xdata *) 0xF55B)
#define    p_reg_sfoe_c1_7_0	0xF55B 
#define	reg_sfoe_c1_7_0_pos 0
#define	reg_sfoe_c1_7_0_len 8
#define	reg_sfoe_c1_7_0_lsb 0
#define xd_p_reg_sfoe_c1_9_8	(*(volatile byte xdata *) 0xF55C)
#define    p_reg_sfoe_c1_9_8	0xF55C 
#define	reg_sfoe_c1_9_8_pos 0
#define	reg_sfoe_c1_9_8_len 2
#define	reg_sfoe_c1_9_8_lsb 8
#define xd_p_reg_sfoe_c2_7_0	(*(volatile byte xdata *) 0xF55D)
#define    p_reg_sfoe_c2_7_0	0xF55D 
#define	reg_sfoe_c2_7_0_pos 0
#define	reg_sfoe_c2_7_0_len 8
#define	reg_sfoe_c2_7_0_lsb 0
#define xd_p_reg_sfoe_c2_9_8	(*(volatile byte xdata *) 0xF55E)
#define    p_reg_sfoe_c2_9_8	0xF55E 
#define	reg_sfoe_c2_9_8_pos 0
#define	reg_sfoe_c2_9_8_len 2
#define	reg_sfoe_c2_9_8_lsb 8
#define xd_p_reg_sfoe_lm_counter_th	(*(volatile byte xdata *) 0xF55F)
#define    p_reg_sfoe_lm_counter_th	0xF55F 
#define	reg_sfoe_lm_counter_th_pos 0
#define	reg_sfoe_lm_counter_th_len 4
#define	reg_sfoe_lm_counter_th_lsb 0
#define xd_p_reg_sfoe_spec_inv	(*(volatile byte xdata *) 0xF560)
#define    p_reg_sfoe_spec_inv	0xF560 
#define	reg_sfoe_spec_inv_pos 0
#define	reg_sfoe_spec_inv_len 1
#define	reg_sfoe_spec_inv_lsb 0
#define xd_p_reg_sfoe_convg_th	(*(volatile byte xdata *) 0xF561)
#define    p_reg_sfoe_convg_th	0xF561 
#define	reg_sfoe_convg_th_pos 0
#define	reg_sfoe_convg_th_len 8
#define	reg_sfoe_convg_th_lsb 0
#define xd_p_reg_sfoe_divg_th	(*(volatile byte xdata *) 0xF562)
#define    p_reg_sfoe_divg_th	0xF562 
#define	reg_sfoe_divg_th_pos 0
#define	reg_sfoe_divg_th_len 8
#define	reg_sfoe_divg_th_lsb 0
#define xd_p_reg_sfoe_pullin_ctr_th	(*(volatile byte xdata *) 0xF563)
#define    p_reg_sfoe_pullin_ctr_th	0xF563 
#define	reg_sfoe_pullin_ctr_th_pos 0
#define	reg_sfoe_pullin_ctr_th_len 4
#define	reg_sfoe_pullin_ctr_th_lsb 0
#define xd_p_reg_sfoe_sf_ctr_th	(*(volatile byte xdata *) 0xF564)
#define    p_reg_sfoe_sf_ctr_th	0xF564 
#define	reg_sfoe_sf_ctr_th_pos 0
#define	reg_sfoe_sf_ctr_th_len 4
#define	reg_sfoe_sf_ctr_th_lsb 0
#define xd_p_reg_sfoe_pullin_th	(*(volatile byte xdata *) 0xF565)
#define    p_reg_sfoe_pullin_th	0xF565 
#define	reg_sfoe_pullin_th_pos 0
#define	reg_sfoe_pullin_th_len 8
#define	reg_sfoe_pullin_th_lsb 0
#define xd_p_reg_sfoe_kalman_cnt	(*(volatile byte xdata *) 0xF566)
#define    p_reg_sfoe_kalman_cnt	0xF566 
#define	reg_sfoe_kalman_cnt_pos 0
#define	reg_sfoe_kalman_cnt_len 4
#define	reg_sfoe_kalman_cnt_lsb 0
#define xd_p_reg_sfoe_fsm_info	(*(volatile byte xdata *) 0xF567)
#define    p_reg_sfoe_fsm_info	0xF567 
#define	reg_sfoe_fsm_info_pos 0
#define	reg_sfoe_fsm_info_len 4
#define	reg_sfoe_fsm_info_lsb 0
#define xd_r_reg_sfoe_pullin_cnt	(*(volatile byte xdata *) 0xF568)
#define    r_reg_sfoe_pullin_cnt	0xF568 
#define	reg_sfoe_pullin_cnt_pos 0
#define	reg_sfoe_pullin_cnt_len 4
#define	reg_sfoe_pullin_cnt_lsb 0
#define xd_r_reg_sfoe_sf_cnt	(*(volatile byte xdata *) 0xF569)
#define    r_reg_sfoe_sf_cnt	0xF569 
#define	reg_sfoe_sf_cnt_pos 0
#define	reg_sfoe_sf_cnt_len 4
#define	reg_sfoe_sf_cnt_lsb 0
#define xd_p_reg_fste_phase_ini_7_0	(*(volatile byte xdata *) 0xF56A)
#define    p_reg_fste_phase_ini_7_0	0xF56A 
#define	reg_fste_phase_ini_7_0_pos 0
#define	reg_fste_phase_ini_7_0_len 8
#define	reg_fste_phase_ini_7_0_lsb 0
#define xd_p_reg_fste_phase_ini_11_8	(*(volatile byte xdata *) 0xF56B)
#define    p_reg_fste_phase_ini_11_8	0xF56B 
#define	reg_fste_phase_ini_11_8_pos 0
#define	reg_fste_phase_ini_11_8_len 4
#define	reg_fste_phase_ini_11_8_lsb 8
#define xd_p_reg_fste_phase_inc_7_0	(*(volatile byte xdata *) 0xF56C)
#define    p_reg_fste_phase_inc_7_0	0xF56C 
#define	reg_fste_phase_inc_7_0_pos 0
#define	reg_fste_phase_inc_7_0_len 8
#define	reg_fste_phase_inc_7_0_lsb 0
#define xd_p_reg_fste_phase_inc_11_8	(*(volatile byte xdata *) 0xF56D)
#define    p_reg_fste_phase_inc_11_8	0xF56D 
#define	reg_fste_phase_inc_11_8_pos 0
#define	reg_fste_phase_inc_11_8_len 4
#define	reg_fste_phase_inc_11_8_lsb 8
#define xd_p_reg_fste_acum_cost_cnt_max	(*(volatile byte xdata *) 0xF56E)
#define    p_reg_fste_acum_cost_cnt_max	0xF56E 
#define	reg_fste_acum_cost_cnt_max_pos 0
#define	reg_fste_acum_cost_cnt_max_len 4
#define	reg_fste_acum_cost_cnt_max_lsb 0
#define xd_p_reg_fste_step_size_std	(*(volatile byte xdata *) 0xF56F)
#define    p_reg_fste_step_size_std	0xF56F 
#define	reg_fste_step_size_std_pos 0
#define	reg_fste_step_size_std_len 4
#define	reg_fste_step_size_std_lsb 0
#define xd_p_reg_fste_step_size_max	(*(volatile byte xdata *) 0xF570)
#define    p_reg_fste_step_size_max	0xF570 
#define	reg_fste_step_size_max_pos 0
#define	reg_fste_step_size_max_len 4
#define	reg_fste_step_size_max_lsb 0
#define xd_p_reg_fste_rpd_dir_cnt_max	(*(volatile byte xdata *) 0xF571)
#define    p_reg_fste_rpd_dir_cnt_max	0xF571 
#define	reg_fste_rpd_dir_cnt_max_pos 0
#define	reg_fste_rpd_dir_cnt_max_len 4
#define	reg_fste_rpd_dir_cnt_max_lsb 0
#define xd_p_reg_fste_frac_cost_cnt_max_7_0	(*(volatile byte xdata *) 0xF572)
#define    p_reg_fste_frac_cost_cnt_max_7_0	0xF572 
#define	reg_fste_frac_cost_cnt_max_7_0_pos 0
#define	reg_fste_frac_cost_cnt_max_7_0_len 8
#define	reg_fste_frac_cost_cnt_max_7_0_lsb 0
#define xd_p_reg_fste_frac_cost_cnt_max_9_8	(*(volatile byte xdata *) 0xF573)
#define    p_reg_fste_frac_cost_cnt_max_9_8	0xF573 
#define	reg_fste_frac_cost_cnt_max_9_8_pos 0
#define	reg_fste_frac_cost_cnt_max_9_8_len 2
