liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_fste_frac_cost_cnt_max_9_8_lsb 8
#define xd_p_reg_fste_isLongWeakTail	(*(volatile byte xdata *) 0xF574)
#define    p_reg_fste_isLongWeakTail	0xF574 
#define	reg_fste_isLongWeakTail_pos 0
#define	reg_fste_isLongWeakTail_len 1
#define	reg_fste_isLongWeakTail_lsb 0
#define xd_p_reg_fste_isLongWeakHead	(*(volatile byte xdata *) 0xF575)
#define    p_reg_fste_isLongWeakHead	0xF575 
#define	reg_fste_isLongWeakHead_pos 0
#define	reg_fste_isLongWeakHead_len 1
#define	reg_fste_isLongWeakHead_lsb 0
#define xd_p_reg_fste_w0_7_0	(*(volatile byte xdata *) 0xF576)
#define    p_reg_fste_w0_7_0	0xF576 
#define	reg_fste_w0_7_0_pos 0
#define	reg_fste_w0_7_0_len 8
#define	reg_fste_w0_7_0_lsb 0
#define xd_p_reg_fste_w0_9_8	(*(volatile byte xdata *) 0xF577)
#define    p_reg_fste_w0_9_8	0xF577 
#define	reg_fste_w0_9_8_pos 0
#define	reg_fste_w0_9_8_len 2
#define	reg_fste_w0_9_8_lsb 8
#define xd_p_reg_fste_w1_7_0	(*(volatile byte xdata *) 0xF578)
#define    p_reg_fste_w1_7_0	0xF578 
#define	reg_fste_w1_7_0_pos 0
#define	reg_fste_w1_7_0_len 8
#define	reg_fste_w1_7_0_lsb 0
#define xd_p_reg_fste_w1_9_8	(*(volatile byte xdata *) 0xF579)
#define    p_reg_fste_w1_9_8	0xF579 
#define	reg_fste_w1_9_8_pos 0
#define	reg_fste_w1_9_8_len 2
#define	reg_fste_w1_9_8_lsb 8
#define xd_p_reg_fste_w2_7_0	(*(volatile byte xdata *) 0xF57A)
#define    p_reg_fste_w2_7_0	0xF57A 
#define	reg_fste_w2_7_0_pos 0
#define	reg_fste_w2_7_0_len 8
#define	reg_fste_w2_7_0_lsb 0
#define xd_p_reg_fste_w2_9_8	(*(volatile byte xdata *) 0xF57B)
#define    p_reg_fste_w2_9_8	0xF57B 
#define	reg_fste_w2_9_8_pos 0
#define	reg_fste_w2_9_8_len 2
#define	reg_fste_w2_9_8_lsb 8
#define xd_p_reg_fste_w3_7_0	(*(volatile byte xdata *) 0xF57C)
#define    p_reg_fste_w3_7_0	0xF57C 
#define	reg_fste_w3_7_0_pos 0
#define	reg_fste_w3_7_0_len 8
#define	reg_fste_w3_7_0_lsb 0
#define xd_p_reg_fste_w3_9_8	(*(volatile byte xdata *) 0xF57D)
#define    p_reg_fste_w3_9_8	0xF57D 
#define	reg_fste_w3_9_8_pos 0
#define	reg_fste_w3_9_8_len 2
#define	reg_fste_w3_9_8_lsb 8
#define xd_p_reg_fste_w4_7_0	(*(volatile byte xdata *) 0xF57E)
#define    p_reg_fste_w4_7_0	0xF57E 
#define	reg_fste_w4_7_0_pos 0
#define	reg_fste_w4_7_0_len 8
#define	reg_fste_w4_7_0_lsb 0
#define xd_p_reg_fste_w4_9_8	(*(volatile byte xdata *) 0xF57F)
#define    p_reg_fste_w4_9_8	0xF57F 
#define	reg_fste_w4_9_8_pos 0
#define	reg_fste_w4_9_8_len 2
#define	reg_fste_w4_9_8_lsb 8
#define xd_p_reg_fste_w5_7_0	(*(volatile byte xdata *) 0xF580)
#define    p_reg_fste_w5_7_0	0xF580 
#define	reg_fste_w5_7_0_pos 0
#define	reg_fste_w5_7_0_len 8
#define	reg_fste_w5_7_0_lsb 0
#define xd_p_reg_fste_w5_9_8	(*(volatile byte xdata *) 0xF581)
#define    p_reg_fste_w5_9_8	0xF581 
#define	reg_fste_w5_9_8_pos 0
#define	reg_fste_w5_9_8_len 2
#define	reg_fste_w5_9_8_lsb 8
#define xd_p_reg_fste_w6_7_0	(*(volatile byte xdata *) 0xF582)
#define    p_reg_fste_w6_7_0	0xF582 
#define	reg_fste_w6_7_0_pos 0
#define	reg_fste_w6_7_0_len 8
#define	reg_fste_w6_7_0_lsb 0
#define xd_p_reg_fste_w6_9_8	(*(volatile byte xdata *) 0xF583)
#define    p_reg_fste_w6_9_8	0xF583 
#define	reg_fste_w6_9_8_pos 0
#define	reg_fste_w6_9_8_len 2
#define	reg_fste_w6_9_8_lsb 8
#define xd_p_reg_fste_w7_7_0	(*(volatile byte xdata *) 0xF584)
#define    p_reg_fste_w7_7_0	0xF584 
#define	reg_fste_w7_7_0_pos 0
#define	reg_fste_w7_7_0_len 8
#define	reg_fste_w7_7_0_lsb 0
#define xd_p_reg_fste_w7_9_8	(*(volatile byte xdata *) 0xF585)
#define    p_reg_fste_w7_9_8	0xF585 
#define	reg_fste_w7_9_8_pos 0
#define	reg_fste_w7_9_8_len 2
#define	reg_fste_w7_9_8_lsb 8
#define xd_p_reg_fste_w8_7_0	(*(volatile byte xdata *) 0xF586)
#define    p_reg_fste_w8_7_0	0xF586 
#define	reg_fste_w8_7_0_pos 0
#define	reg_fste_w8_7_0_len 8
#define	reg_fste_w8_7_0_lsb 0
#define xd_p_reg_fste_w8_9_8	(*(volatile byte xdata *) 0xF587)
#define    p_reg_fste_w8_9_8	0xF587 
#define	reg_fste_w8_9_8_pos 0
#define	reg_fste_w8_9_8_len 2
#define	reg_fste_w8_9_8_lsb 8
#define xd_p_reg_fste_w9_7_0	(*(volatile byte xdata *) 0xF588)
#define    p_reg_fste_w9_7_0	0xF588 
#define	reg_fste_w9_7_0_pos 0
#define	reg_fste_w9_7_0_len 8
#define	reg_fste_w9_7_0_lsb 0
#define xd_p_reg_fste_w9_9_8	(*(volatile byte xdata *) 0xF589)
#define    p_reg_fste_w9_9_8	0xF589 
#define	reg_fste_w9_9_8_pos 0
#define	reg_fste_w9_9_8_len 2
#define	reg_fste_w9_9_8_lsb 8
#define xd_p_reg_fste_wa_7_0	(*(volatile byte xdata *) 0xF58A)
#define    p_reg_fste_wa_7_0	0xF58A 
#define	reg_fste_wa_7_0_pos 0
#define	reg_fste_wa_7_0_len 8
#define	reg_fste_wa_7_0_lsb 0
#define xd_p_reg_fste_wa_9_8	(*(volatile byte xdata *) 0xF58B)
#define    p_reg_fste_wa_9_8	0xF58B 
#define	reg_fste_wa_9_8_pos 0
#define	reg_fste_wa_9_8_len 2
#define	reg_fste_wa_9_8_lsb 8
#define xd_p_reg_fste_wb_7_0	(*(volatile byte xdata *) 0xF58C)
#define    p_reg_fste_wb_7_0	0xF58C 
#define	reg_fste_wb_7_0_pos 0
#define	reg_fste_wb_7_0_len 8
#define	reg_fste_wb_7_0_lsb 0
#define xd_p_reg_fste_wb_9_8	(*(volatile byte xdata *) 0xF58D)
#define    p_reg_fste_wb_9_8	0xF58D 
#define	reg_fste_wb_9_8_pos 0
#define	reg_fste_wb_9_8_len 2
#define	reg_fste_wb_9_8_lsb 8
#define xd_p_reg_fste_wc_7_0	(*(volatile byte xdata *) 0xF58E)
#define    p_reg_fste_wc_7_0	0xF58E 
#define	reg_fste_wc_7_0_pos 0
#define	reg_fste_wc_7_0_len 8
#define	reg_fste_wc_7_0_lsb 0
#define xd_p_reg_fste_wc_9_8	(*(volatile byte xdata *) 0xF58F)
#define    p_reg_fste_wc_9_8	0xF58F 
#define	reg_fste_wc_9_8_pos 0
#define	reg_fste_wc_9_8_len 2
#define	reg_fste_wc_9_8_lsb 8
#define xd_p_reg_fste_wd_7_0	(*(volatile byte xdata *) 0xF590)
#define    p_reg_fste_wd_7_0	0xF590 
#define	reg_fste_wd_7_0_pos 0
#define	reg_fste_wd_7_0_len 8
#define	reg_fste_wd_7_0_lsb 0
#define xd_p_reg_fste_wd_9_8	(*(volatile byte xdata *) 0xF591)
#define    p_reg_fste_wd_9_8	0xF591 
#define	reg_fste_wd_9_8_pos 0
#define	reg_fste_wd_9_8_len 2
#define	reg_fste_wd_9_8_lsb 8
#define xd_p_reg_fste_we_7_0	(*(volatile byte xdata *) 0xF592)
#define    p_reg_fste_we_7_0	0xF592 
#define	reg_fste_we_7_0_pos 0
#define	reg_fste_we_7_0_len 8
#define	reg_fste_we_7_0_lsb 0
#define xd_p_reg_fste_we_9_8	(*(volatile byte xdata *) 0xF593)
#define    p_reg_fste_we_9_8	0xF593 
#define	reg_fste_we_9_8_pos 0
#define	reg_fste_we_9_8_len 2
#define	reg_fste_we_9_8_lsb 8
#define xd_p_reg_fste_wf_7_0	(*(volatile byte xdata *) 0xF594)
#define    p_reg_fste_wf_7_0	0xF594 
#define	reg_fste_wf_7_0_pos 0
#define	reg_fste_wf_7_0_len 8
#define	reg_fste_wf_7_0_lsb 0
#define xd_p_reg_fste_wf_9_8	(*(volatile byte xdata *) 0xF595)
#define    p_reg_fste_wf_9_8	0xF595 
#define	reg_fste_wf_9_8_pos 0
#define	reg_fste_wf_9_8_len 2
#define	reg_fste_wf_9_8_lsb 8
#define xd_p_reg_fste_wg_7_0	(*(volatile byte xdata *) 0xF596)
#define    p_reg_fste_wg_7_0	0xF596 
#define	reg_fste_wg_7_0_pos 0
#define	reg_fste_wg_7_0_len 8
#define	reg_fste_wg_7_0_lsb 0
#define xd_p_reg_fste_wg_9_8	(*(volatile byte xdata *) 0xF597)
#define    p_reg_fste_wg_9_8	0xF597 
#define	reg_fste_wg_9_8_pos 0
#define	reg_fste_wg_9_8_len 2
#define	reg_fste_wg_9_8_lsb 8
#define xd_p_reg_fste_wh_7_0	(*(volatile byte xdata *) 0xF598)
#define    p_reg_fste_wh_7_0	0xF598 
#define	reg_fste_wh_7_0_pos 0
#define	reg_fste_wh_7_0_len 8
#define	reg_fste_wh_7_0_lsb 0
#define xd_p_reg_fste_wh_9_8	(*(volatile byte xdata *) 0xF599)
#define    p_reg_fste_wh_9_8	0xF599 
#define	reg_fste_wh_9_8_pos 0
#define	reg_fste_wh_9_8_len 2
#define	reg_fste_wh_9_8_lsb 8
#define xd_r_fd_fste_i_adj_org	(*(volatile byte xdata *) 0xF59A)
#define    r_fd_fste_i_adj_org	0xF59A 
#define	fd_fste_i_adj_org_pos 0
#define	fd_fste_i_adj_org_len 5
#define	fd_fste_i_adj_org_lsb 0
#define xd_r_fd_fste_f_adj_7_0	(*(volatile byte xdata *) 0xF59B)
#define    r_fd_fste_f_adj_7_0	0xF59B 
#define	fd_fste_f_adj_7_0_pos 0
#define	fd_fste_f_adj_7_0_len 8
#define	fd_fste_f_adj_7_0_lsb 0
#define xd_r_fd_fste_f_adj_15_8	(*(volatile byte xdata *) 0xF59C)
#define    r_fd_fste_f_adj_15_8	0xF59C 
#define	fd_fste_f_adj_15_8_pos 0
#define	fd_fste_f_adj_15_8_len 8
#define	fd_fste_f_adj_15_8_lsb 8
#define xd_r_fd_fste_f_adj_19_16	(*(volatile byte xdata *) 0xF59D)
#define    r_fd_fste_f_adj_19_16	0xF59D 
#define	fd_fste_f_adj_19_16_pos 0
#define	fd_fste_f_adj_19_16_len 4
#define	fd_fste_f_adj_19_16_lsb 16
#define xd_p_reg_fste_ehw_7_0	(*(volatile byte xdata *) 0xF59E)
#define    p_reg_fste_ehw_7_0	0xF59E 
#define	reg_fste_ehw_7_0_pos 0
#define	reg_fste_ehw_7_0_len 8
#define	reg_fste_ehw_7_0_lsb 0
#define xd_p_reg_fste_ehw_12_8	(*(volatile byte xdata *) 0xF59F)
#define    p_reg_fste_ehw_12_8	0xF59F 
#define	reg_fste_ehw_12_8_pos 0
#define	reg_fste_ehw_12_8_len 5
#define	reg_fste_ehw_12_8_lsb 8
#define xd_p_reg_fste_i_adj_vld	(*(volatile byte xdata *) 0xF5A0)
#define    p_reg_fste_i_adj_vld	0xF5A0 
#define	reg_fste_i_adj_vld_pos 0
#define	reg_fste_i_adj_vld_len 1
#define	reg_fste_i_adj_vld_lsb 0
#define xd_p_reg_fste_ceTimesPhasor_real	(*(volatile byte xdata *) 0xF5A1)
#define    p_reg_fste_ceTimesPhasor_real	0xF5A1 
#define	reg_fste_ceTimesPhasor_real_pos 0
#define	reg_fste_ceTimesPhasor_real_len 1
#define	reg_fste_ceTimesPhasor_real_lsb 0
#define xd_p_reg_fste_ceTimesPhasor_imag	(*(volatile byte xdata *) 0xF5A2)
#define    p_reg_fste_ceTimesPhasor_imag	0xF5A2 
#define	reg_fste_ceTimesPhasor_imag_pos 0
#define	reg_fste_ceTimesPhasor_imag_len 1
#define	reg_fste_ceTimesPhasor_imag_lsb 0
#define xd_p_reg_fste_cerTimesW_real	(*(volatile byte xdata *) 0xF5A3)
#define    p_reg_fste_cerTimesW_real	0xF5A3 
#define	reg_fste_cerTimesW_real_pos 0
#define	reg_fste_cerTimesW_real_len 1
#define	reg_fste_cerTimesW_real_lsb 0
#define xd_p_reg_fste_cerTimesW_imag	(*(volatile byte xdata *) 0xF5A4)
#define    p_reg_fste_cerTimesW_imag	0xF5A4 
#define	reg_fste_cerTimesW_imag_pos 0
#define	reg_fste_cerTimesW_imag_len 1
#define	reg_fste_cerTimesW_imag_lsb 0
#define xd_p_reg_fste_cerTimesWAccum_real	(*(volatile byte xdata *) 0xF5A5)
#define    p_reg_fste_cerTimesWAccum_real	0xF5A5 
#define	reg_fste_cerTimesWAccum_real_pos 0
#define	reg_fste_cerTimesWAccum_real_len 1
#define	reg_fste_cerTimesWAccum_real_lsb 0
#define xd_p_reg_fste_cerTimesWAccum_imag	(*(volatile byte xdata *) 0xF5A6)
#define    p_reg_fste_cerTimesWAccum_imag	0xF5A6 
#define	reg_fste_cerTimesWAccum_imag_pos 0
#define	reg_fste_cerTimesWAccum_imag_len 1
#define	reg_fste_cerTimesWAccum_imag_lsb 0
#define xd_p_reg_fste_cost	(*(volatile byte xdata *) 0xF5A7)
#define    p_reg_fste_cost	0xF5A7 
#define	reg_fste_cost_pos 0
#define	reg_fste_cost_len 1
#define	reg_fste_cost_lsb 0
#define xd_p_fd_tpsd_en	(*(volatile byte xdata *) 0xF5A8)
#define    p_fd_tpsd_en	0xF5A8 
#define	fd_tpsd_en_pos 0
#define	fd_tpsd_en_len 1
#define	fd_tpsd_en_lsb 0
#define xd_p_fd_tpsd_lock	(*(volatile byte xdata *) 0xF5A9)
#define    p_fd_tpsd_lock	0xF5A9 
#define	fd_tpsd_lock_pos 0
#define	fd_tpsd_lock_len 1
#define	fd_tpsd_lock_lsb 0
#define xd_r_fd_tpsd_s19	(*(volatile byte xdata *) 0xF5AA)
#define    r_fd_tpsd_s19	0xF5AA 
#define	fd_tpsd_s19_pos 0
#define	fd_tpsd_s19_len 1
#define	fd_tpsd_s19_lsb 0
#define xd_r_fd_tpsd_s17	(*(volatile byte xdata *) 0xF5AB)
#define    r_fd_tpsd_s17	0xF5AB 
#define	fd_tpsd_s17_pos 0
#define	fd_tpsd_s17_len 1
#define	fd_tpsd_s17_lsb 0
#define xd_p_fd_sfr_ste_en	(*(volatile byte xdata *) 0xF5AC)
#define    p_fd_sfr_ste_en	0xF5AC 
#define	fd_sfr_ste_en_pos 0
#define	fd_sfr_ste_en_len 1
#define	fd_sfr_ste_en_lsb 0
#define xd_p_fd_sfr_ste_mode	(*(volatile byte xdata *) 0xF5AD)
#define    p_fd_sfr_ste_mode	0xF5AD 
#define	fd_sfr_ste_mode_pos 0
#define	fd_sfr_ste_mode_len 2
#define	fd_sfr_ste_mode_lsb 0
#define xd_p_fd_sfr_ste_done	(*(volatile byte xdata *) 0xF5AE)
#define    p_fd_sfr_ste_done	0xF5AE 
#define	fd_sfr_ste_done_pos 0
#define	fd_sfr_ste_done_len 1
#define	fd_sfr_ste_done_lsb 0
#define xd_p_reg_cfoe_ffoe_en	(*(volatile byte xdata *) 0xF5AF)
#define    p_reg_cfoe_ffoe_en	0xF5AF 
#define	reg_cfoe_ffoe_en_pos 0
#define	reg_cfoe_ffoe_en_len 1
#define	reg_cfoe_ffoe_en_lsb 0
#define xd_p_reg_cfoe_ifoe_en	(*(volatile byte xdata *) 0xF5B0)
#define    p_reg_cfoe_ifoe_en	0xF5B0 
#define	reg_cfoe_ifoe_en_pos 0
#define	reg_cfoe_ifoe_en_len 1
#define	reg_cfoe_ifoe_en_lsb 0
#define xd_p_reg_cfoe_fot_en	(*(volatile byte xdata *) 0xF5B1)
#define    p_reg_cfoe_fot_en	0xF5B1 
#define	reg_cfoe_fot_en_pos 0
#define	reg_cfoe_fot_en_len 1
#define	reg_cfoe_fot_en_lsb 0
#define xd_p_reg_cfoe_fot_lm_en	(*(volatile byte xdata *) 0xF5B2)
#define    p_reg_cfoe_fot_lm_en	0xF5B2 
#define	reg_cfoe_fot_lm_en_pos 0
#define	reg_cfoe_fot_lm_en_len 1
#define	reg_cfoe_fot_lm_en_lsb 0
#define xd_p_reg_cfoe_fot_rst	(*(volatile byte xdata *) 0xF5B3)
#define    p_reg_cfoe_fot_rst	0xF5B3 
#define	reg_cfoe_fot_rst_pos 0
#define	reg_cfoe_fot_rst_len 1
#define	reg_cfoe_fot_rst_lsb 0
#define xd_r_fd_cfoe_ffoe_done	(*(volatile byte xdata *) 0xF5B4)
#define    r_fd_cfoe_ffoe_done	0xF5B4 
#define	fd_cfoe_ffoe_done_pos 0
#define	fd_cfoe_ffoe_done_len 1
#define	fd_cfoe_ffoe_done_lsb 0
#define xd_p_fd_cfoe_metric_vld	(*(volatile byte xdata *) 0xF5B5)
#define    p_fd_cfoe_metric_vld	0xF5B5 
#define	fd_cfoe_metric_vld_pos 0
#define	fd_cfoe_metric_vld_len 1
#define	fd_cfoe_metric_vld_lsb 0
#define xd_p_reg_cfoe_ifod_vld	(*(volatile byte xdata *) 0xF5B6)
#define    p_reg_cfoe_ifod_vld	0xF5B6 
#define	reg_cfoe_ifod_vld_pos 0
#define	reg_cfoe_ifod_vld_len 1
#define	reg_cfoe_ifod_vld_lsb 0
#define xd_r_fd_cfoe_ifoe_done	(*(volatile byte xdata *) 0xF5B7)
#define    r_fd_cfoe_ifoe_done	0xF5B7 
#define	fd_cfoe_ifoe_done_pos 0
#define	fd_cfoe_ifoe_done_len 1
#define	fd_cfoe_ifoe_done_lsb 0
#define xd_p_reg_cfoe_ifoe_spec_inv	(*(volatile byte xdata *) 0xF5B8)
#define    p_reg_cfoe_ifoe_spec_inv	0xF5B8 
#define	reg_cfoe_ifoe_spec_inv_pos 0
#define	reg_cfoe_ifoe_spec_inv_len 1
#define	reg_cfoe_ifoe_spec_inv_lsb 0
#define xd_p_reg_cfoe_divg_int	(*(volatile byte xdata *) 0xF5B9)
#define    p_reg_cfoe_divg_int	0xF5B9 
#define	reg_cfoe_divg_int_pos 0
#define	reg_cfoe_divg_int_len 1
#define	reg_cfoe_divg_int_lsb 0
#define xd_r_reg_cfoe_divg_flag	(*(volatile byte xdata *) 0xF5BA)
#define    r_reg_cfoe_divg_flag	0xF5BA 
#define	reg_cfoe_divg_flag_pos 0
#define	reg_cfoe_divg_flag_len 1
#define	reg_cfoe_divg_flag_lsb 0
#define xd_p_reg_sfoe_en	(*(volatile byte xdata *) 0xF5BB)
#define    p_reg_sfoe_en	0xF5BB 
#define	reg_sfoe_en_pos 0
#define	reg_sfoe_en_len 1
#define	reg_sfoe_en_lsb 0
#define xd_p_reg_sfoe_dis	(*(volatile byte xdata *) 0xF5BC)
#define    p_reg_sfoe_dis	0xF5BC 
#define	reg_sfoe_dis_pos 0
#define	reg_sfoe_dis_len 1
#define	reg_sfoe_dis_lsb 0
#define xd_p_reg_sfoe_rst	(*(volatile byte xdata *) 0xF5BD)
#define    p_reg_sfoe_rst	0xF5BD 
#define	reg_sfoe_rst_pos 0
#define	reg_sfoe_rst_len 1
#define	reg_sfoe_rst_lsb 0
#define xd_p_reg_sfoe_vld_int	(*(volatile byte xdata *) 0xF5BE)
#define    p_reg_sfoe_vld_int	0xF5BE 
#define	reg_sfoe_vld_int_pos 0
#define	reg_sfoe_vld_int_len 1
#define	reg_sfoe_vld_int_lsb 0
#define xd_p_reg_sfoe_lm_en	(*(volatile byte xdata *) 0xF5BF)
#define    p_reg_sfoe_lm_en	0xF5BF 
#define	reg_sfoe_lm_en_pos 0
#define	reg_sfoe_lm_en_len 1
#define	reg_sfoe_lm_en_lsb 0
#define xd_p_reg_sfoe_divg_int	(*(volatile byte xdata *) 0xF5C0)
#define    p_reg_sfoe_divg_int	0xF5C0 
#define	reg_sfoe_divg_int_pos 0
#define	reg_sfoe_divg_int_len 1
#define	reg_sfoe_divg_int_lsb 0
#define xd_r_reg_sfoe_divg_flag	(*(volatile byte xdata *) 0xF5C1)
#define    r_reg_sfoe_divg_flag	0xF5C1 
#define	reg_sfoe_divg_flag_pos 0
#define	reg_sfoe_divg_flag_len 1
#define	reg_sfoe_divg_flag_lsb 0
#define xd_p_reg_fft_rst	(*(volatile byte xdata *) 0xF5C2)
#define    p_reg_fft_rst	0xF5C2 
#define	reg_fft_rst_pos 0
#define	reg_fft_rst_len 1
#define	reg_fft_rst_lsb 0
#define xd_p_reg_fft_mask2_en	(*(volatile byte xdata *) 0xF5C3)
#define    p_reg_fft_mask2_en	0xF5C3 
#define	reg_fft_mask2_en_pos 0
#define	reg_fft_mask2_en_len 1
#define	reg_fft_mask2_en_lsb 0
#define xd_p_reg_fft_mask3_en	(*(volatile byte xdata *) 0xF5C4)
#define    p_reg_fft_mask3_en	0xF5C4 
#define	reg_fft_mask3_en_pos 0
#define	reg_fft_mask3_en_len 1
#define	reg_fft_mask3_en_lsb 0
#define xd_p_reg_fft_crc_en	(*(volatile byte xdata *) 0xF5C5)
#define    p_reg_fft_crc_en	0xF5C5 
#define	reg_fft_crc_en_pos 0
#define	reg_fft_crc_en_len 1
#define	reg_fft_crc_en_lsb 0
#define xd_p_reg_fft_mask0_en	(*(volatile byte xdata *) 0xF5C6)
#define    p_reg_fft_mask0_en	0xF5C6 
#define	reg_fft_mask0_en_pos 0
#define	reg_fft_mask0_en_len 1
#define	reg_fft_mask0_en_lsb 0
#define xd_p_reg_fft_mask1_en	(*(volatile byte xdata *) 0xF5C7)
#define    p_reg_fft_mask1_en	0xF5C7 
#define	reg_fft_mask1_en_pos 0
#define	reg_fft_mask1_en_len 1
#define	reg_fft_mask1_en_lsb 0
#define xd_p_fd_fste_en	(*(volatile byte xdata *) 0xF5C8)
#define    p_fd_fste_en	0xF5C8 
#define	fd_fste_en_pos 0
#define	fd_fste_en_len 1
#define	fd_fste_en_lsb 0
#define xd_p_reg_feq_eh2_comp_en	(*(volatile byte xdata *) 0xF5C9)
#define    p_reg_feq_eh2_comp_en	0xF5C9 
#define	reg_feq_eh2_comp_en_pos 0
#define	reg_feq_eh2_comp_en_len 1
#define	reg_feq_eh2_comp_en_lsb 0
#define xd_p_reg_feq_read_update	(*(volatile byte xdata *) 0xF5CA)
#define    p_reg_feq_read_update	0xF5CA 
#define	reg_feq_read_update_pos 0
#define	reg_feq_read_update_len 1
#define	reg_feq_read_update_lsb 0
#define xd_p_reg_feq_data_vld	(*(volatile byte xdata *) 0xF5CB)
#define    p_reg_feq_data_vld	0xF5CB 
#define	reg_feq_data_vld_pos 0
#define	reg_feq_data_vld_len 1
#define	reg_feq_data_vld_lsb 0
#define xd_p_reg_feq_tone_idx_7_0	(*(volatile byte xdata *) 0xF5CC)
#define    p_reg_feq_tone_idx_7_0	0xF5CC 
#define	reg_feq_tone_idx_7_0_pos 0
#define	reg_feq_tone_idx_7_0_len 8
#define	reg_feq_tone_idx_7_0_lsb 0
#define xd_p_reg_feq_tone_idx_12_8	(*(volatile byte xdata *) 0xF5CD)
#define    p_reg_feq_tone_idx_12_8	0xF5CD 
#define	reg_feq_tone_idx_12_8_pos 0
#define	reg_feq_tone_idx_12_8_len 5
#define	reg_feq_tone_idx_12_8_lsb 8
#define xd_r_reg_feq_data_re_7_0	(*(volatile byte xdata *) 0xF5CE)
#define    r_reg_feq_data_re_7_0	0xF5CE 
#define	reg_feq_data_re_7_0_pos 0
#define	reg_feq_data_re_7_0_len 8
#define	reg_feq_data_re_7_0_lsb 0
#define xd_r_reg_feq_data_re_15_8	(*(volatile byte xdata *) 0xF5CF)
#define    r_reg_feq_data_re_15_8	0xF5CF 
#define	reg_feq_data_re_15_8_pos 0
#define	reg_feq_data_re_15_8_len 8
#define	reg_feq_data_re_15_8_lsb 8
#define xd_r_reg_feq_data_re_21_16	(*(volatile byte xdata *) 0xF5D0)
#define    r_reg_feq_data_re_21_16	0xF5D0 
#define	reg_feq_data_re_21_16_pos 0
#define	reg_feq_data_re_21_16_len 6
#define	reg_feq_data_re_21_16_lsb 16
#define xd_r_reg_feq_data_im_7_0	(*(volatile byte xdata *) 0xF5D1)
#define    r_reg_feq_data_im_7_0	0xF5D1 
#define	reg_feq_data_im_7_0_pos 0
#define	reg_feq_data_im_7_0_len 8
#define	reg_feq_data_im_7_0_lsb 0
#define xd_r_reg_feq_data_im_15_8	(*(volatile byte xdata *) 0xF5D2)
#define    r_reg_feq_data_im_15_8	0xF5D2 
#define	reg_feq_data_im_15_8_pos 0
#define	reg_feq_data_im_15_8_len 8
#define	reg_feq_data_im_15_8_lsb 8
#define xd_r_reg_feq_data_im_21_16	(*(volatile byte xdata *) 0xF5D3)
#define    r_reg_feq_data_im_21_16	0xF5D3 
#define	reg_feq_data_im_21_16_pos 0
#define	reg_feq_data_im_21_16_len 6
#define	reg_feq_data_im_21_16_lsb 16
#define xd_r_reg_feq_data_h2_7_0	(*(volatile byte xdata *) 0xF5D4)
#define    r_reg_feq_data_h2_7_0	0xF5D4 
#define	reg_feq_data_h2_7_0_pos 0
#define	reg_feq_data_h2_7_0_len 8
#define	reg_feq_data_h2_7_0_lsb 0
#define xd_r_reg_feq_data_h2_15_8	(*(volatile byte xdata *) 0xF5D5)
#define    r_reg_feq_data_h2_15_8	0xF5D5 
#define	reg_feq_data_h2_15_8_pos 0
#define	reg_feq_data_h2_15_8_len 8
#define	reg_feq_data_h2_15_8_lsb 8
#define xd_r_reg_feq_data_h2_18_16	(*(volatile byte xdata *) 0xF5D6)
#define    r_reg_feq_data_h2_18_16	0xF5D6 
#define	reg_feq_data_h2_18_16_pos 0
#define	reg_feq_data_h2_18_16_len 3
#define	reg_feq_data_h2_18_16_lsb 16
#define xd_p_reg_fs_en	(*(volatile byte xdata *) 0xF5D7)
#define    p_reg_fs_en	0xF5D7 
#define	reg_fs_en_pos 0
#define	reg_fs_en_len 1
#define	reg_fs_en_lsb 0
#define xd_p_reg_fs_offset	(*(volatile byte xdata *) 0xF5D8)
#define    p_reg_fs_offset	0xF5D8 
#define	reg_fs_offset_pos 0
#define	reg_fs_offset_len 3
#define	reg_fs_offset_lsb 0
#define xd_p_reg_fs_debug	(*(volatile byte xdata *) 0xF5D9)
#define    p_reg_fs_debug	0xF5D9 
#define	reg_fs_debug_pos 0
#define	reg_fs_debug_len 1
#define	reg_fs_debug_lsb 0
#define xd_p_reg_fs_half_inv	(*(volatile byte xdata *) 0xF5DA)
#define    p_reg_fs_half_inv	0xF5DA 
#define	reg_fs_half_inv_pos 0
#define	reg_fs_half_inv_len 1
#define	reg_fs_half_inv_lsb 0
#define xd_p_reg_cdpf_state	(*(volatile byte xdata *) 0xF5E1)
#define    p_reg_cdpf_state	0xF5E1 
#define	reg_cdpf_state_pos 0
#define	reg_cdpf_state_len 4
#define	reg_cdpf_state_lsb 0
#define xd_p_reg_cdpf_rxsymboldelay	(*(volatile byte xdata *) 0xF5E3)
#define    p_reg_cdpf_rxsymboldelay	0xF5E3 
#define	reg_cdpf_rxsymboldelay_pos 0
#define	reg_cdpf_rxsymboldelay_len 4
#define	reg_cdpf_rxsymboldelay_lsb 0
#define xd_p_reg_cdpf_ceavesymbolno	(*(volatile byte xdata *) 0xF5E4)
#define    p_reg_cdpf_ceavesymbolno	0xF5E4 
#define	reg_cdpf_ceavesymbolno_pos 0
#define	reg_cdpf_ceavesymbolno_len 4
#define	reg_cdpf_ceavesymbolno_lsb 0
#define xd_p_reg_cdpf_ceshift	(*(volatile byte xdata *) 0xF5E5)
#define    p_reg_cdpf_ceshift	0xF5E5 
#define	reg_cdpf_ceshift_pos 0
#define	reg_cdpf_ceshift_len 3
#define	reg_cdpf_ceshift_lsb 0
#define xd_p_reg_cdpf_en	(*(volatile byte xdata *) 0xF5E7)
#define    p_reg_cdpf_en	0xF5E7 
#define	reg_cdpf_en_pos 0
#define	reg_cdpf_en_len 1
#define	reg_cdpf_en_lsb 0
#define xd_p_reg_cdpf_fdiw0	(*(volatile byte xdata *) 0xF600)
#define    p_reg_cdpf_fdiw0	0xF600 
#define	reg_cdpf_fdiw0_pos 0
#define	reg_cdpf_fdiw0_len 7
#define	reg_cdpf_fdiw0_lsb 0
#define xd_p_reg_cdpf_fdiw1	(*(volatile byte xdata *) 0xF601)
#define    p_reg_cdpf_fdiw1	0xF601 
#define	reg_cdpf_fdiw1_pos 0
#define	reg_cdpf_fdiw1_len 7
#define	reg_cdpf_fdiw1_lsb 0
#define xd_p_reg_cdpf_fdiw2	(*(volatile byte xdata *) 0xF602)
#define    p_reg_cdpf_fdiw2	0xF602 
#define	reg_cdpf_fdiw2_pos 0
#define	reg_cdpf_fdiw2_len 7
#define	reg_cdpf_fdiw2_lsb 0
#define xd_p_reg_cdpf_fdiw3	(*(volatile byte xdata *) 0xF603)
#define    p_reg_cdpf_fdiw3	0xF603 
#define	reg_cdpf_fdiw3_pos 0
#define	reg_cdpf_fdiw3_len 7
#define	reg_cdpf_fdiw3_lsb 0
#define xd_p_reg_cdpf_fdiw4	(*(volatile byte xdata *) 0xF604)
#define    p_reg_cdpf_fdiw4	0xF604 
#define	reg_cdpf_fdiw4_pos 0
#define	reg_cdpf_fdiw4_len 7
#define	reg_cdpf_fdiw4_lsb 0
#define xd_p_reg_cdpf_fdiw5	(*(volatile byte xdata *) 0xF605)
#define    p_reg_cdpf_fdiw5	0xF605 
#define	reg_cdpf_fdiw5_pos 0
#define	reg_cdpf_fdiw5_len 7
#define	reg_cdpf_fdiw5_lsb 0
#define xd_p_reg_cdpf_fdiw6	(*(volatile byte xdata *) 0xF606)
#define    p_reg_cdpf_fdiw6	0xF606 
#define	reg_cdpf_fdiw6_pos 0
#define	reg_cdpf_fdiw6_len 7
#define	reg_cdpf_fdiw6_lsb 0
#define xd_p_reg_cdpf_fdiw7	(*(volatile byte xdata *) 0xF607)
#define    p_reg_cdpf_fdiw7	0xF607 
#define	reg_cdpf_fdiw7_pos 0
#define	reg_cdpf_fdiw7_len 7
#define	reg_cdpf_fdiw7_lsb 0
#define xd_p_reg_stes_mode	(*(volatile byte xdata *) 0xF609)
#define    p_reg_stes_mode	0xF609 
#define	reg_stes_mode_pos 0
#define	reg_stes_mode_len 1
#define	reg_stes_mode_lsb 0
#define xd_p_reg_stes_done_st	(*(volatile byte xdata *) 0xF60A)
#define    p_reg_stes_done_st	0xF60A 
#define	reg_stes_done_st_pos 0
#define	reg_stes_done_st_len 2
#define	reg_stes_done_st_lsb 0
#define xd_p_reg_stes_done	(*(volatile byte xdata *) 0xF60B)
#define    p_reg_stes_done	0xF60B 
#define	reg_stes_done_pos 0
#define	reg_stes_done_len 1
#define	reg_stes_done_lsb 0
#define xd_p_reg_stes_timing_7_0	(*(volatile byte xdata *) 0xF60C)
#define    p_reg_stes_timing_7_0	0xF60C 
#define	reg_stes_timing_7_0_pos 0
#define	reg_stes_timing_7_0_len 8
#define	reg_stes_timing_7_0_lsb 0
#define xd_p_reg_stes_timing_15_8	(*(volatile byte xdata *) 0xF60D)
#define    p_reg_stes_timing_15_8	0xF60D 
#define	reg_stes_timing_15_8_pos 0
#define	reg_stes_timing_15_8_len 8
#define	reg_stes_timing_15_8_lsb 8
#define xd_p_reg_stes_sym_tot_adj_thre_7_0	(*(volatile byte xdata *) 0xF60E)
#define    p_reg_stes_sym_tot_adj_thre_7_0	0xF60E 
#define	reg_stes_sym_tot_adj_thre_7_0_pos 0
