liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_stes_sym_tot_adj_thre_7_0_len 8
#define	reg_stes_sym_tot_adj_thre_7_0_lsb 0
#define xd_p_reg_stes_sym_tot_adj_thre_15_8	(*(volatile byte xdata *) 0xF60F)
#define    p_reg_stes_sym_tot_adj_thre_15_8	0xF60F 
#define	reg_stes_sym_tot_adj_thre_15_8_pos 0
#define	reg_stes_sym_tot_adj_thre_15_8_len 8
#define	reg_stes_sym_tot_adj_thre_15_8_lsb 8
#define xd_p_reg_stes_sym_thre_9_2	(*(volatile byte xdata *) 0xF610)
#define    p_reg_stes_sym_thre_9_2	0xF610 
#define	reg_stes_sym_thre_9_2_pos 0
#define	reg_stes_sym_thre_9_2_len 8
#define	reg_stes_sym_thre_9_2_lsb 0
#define xd_p_reg_stes_sym_wo_adj_thre_9_2	(*(volatile byte xdata *) 0xF611)
#define    p_reg_stes_sym_wo_adj_thre_9_2	0xF611 
#define	reg_stes_sym_wo_adj_thre_9_2_pos 0
#define	reg_stes_sym_wo_adj_thre_9_2_len 8
#define	reg_stes_sym_wo_adj_thre_9_2_lsb 0
#define xd_p_reg_fste_i_adj_7_0	(*(volatile byte xdata *) 0xF612)
#define    p_reg_fste_i_adj_7_0	0xF612 
#define	reg_fste_i_adj_7_0_pos 0
#define	reg_fste_i_adj_7_0_len 8
#define	reg_fste_i_adj_7_0_lsb 0
#define xd_p_reg_fste_i_adj_15_8	(*(volatile byte xdata *) 0xF613)
#define    p_reg_fste_i_adj_15_8	0xF613 
#define	reg_fste_i_adj_15_8_pos 0
#define	reg_fste_i_adj_15_8_len 8
#define	reg_fste_i_adj_15_8_lsb 8
#define xd_r_fd_stes_iadj_val_7_0	(*(volatile byte xdata *) 0xF614)
#define    r_fd_stes_iadj_val_7_0	0xF614 
#define	fd_stes_iadj_val_7_0_pos 0
#define	fd_stes_iadj_val_7_0_len 8
#define	fd_stes_iadj_val_7_0_lsb 0
#define xd_r_fd_stes_iadj_val_15_8	(*(volatile byte xdata *) 0xF615)
#define    r_fd_stes_iadj_val_15_8	0xF615 
#define	fd_stes_iadj_val_15_8_pos 0
#define	fd_stes_iadj_val_15_8_len 8
#define	fd_stes_iadj_val_15_8_lsb 8
#define xd_r_fd_stes_symb_cnt_9_2	(*(volatile byte xdata *) 0xF616)
#define    r_fd_stes_symb_cnt_9_2	0xF616 
#define	fd_stes_symb_cnt_9_2_pos 0
#define	fd_stes_symb_cnt_9_2_len 8
#define	fd_stes_symb_cnt_9_2_lsb 0
#define xd_r_fd_stes_snoi_cnt_9_2	(*(volatile byte xdata *) 0xF617)
#define    r_fd_stes_snoi_cnt_9_2	0xF617 
#define	fd_stes_snoi_cnt_9_2_pos 0
#define	fd_stes_snoi_cnt_9_2_len 8
#define	fd_stes_snoi_cnt_9_2_lsb 0
#define xd_r_fd_last_iadj_val_7_0	(*(volatile byte xdata *) 0xF618)
#define    r_fd_last_iadj_val_7_0	0xF618 
#define	fd_last_iadj_val_7_0_pos 0
#define	fd_last_iadj_val_7_0_len 8
#define	fd_last_iadj_val_7_0_lsb 0
#define xd_r_fd_last_iadj_val_15_8	(*(volatile byte xdata *) 0xF619)
#define    r_fd_last_iadj_val_15_8	0xF619 
#define	fd_last_iadj_val_15_8_pos 0
#define	fd_last_iadj_val_15_8_len 8
#define	fd_last_iadj_val_15_8_lsb 8
#define xd_p_reg_stes_bypass	(*(volatile byte xdata *) 0xF61A)
#define    p_reg_stes_bypass	0xF61A 
#define	reg_stes_bypass_pos 0
#define	reg_stes_bypass_len 1
#define	reg_stes_bypass_lsb 0
#define xd_p_reg_stes_best_timing_idx	(*(volatile byte xdata *) 0xF61B)
#define    p_reg_stes_best_timing_idx	0xF61B 
#define	reg_stes_best_timing_idx_pos 0
#define	reg_stes_best_timing_idx_len 4
#define	reg_stes_best_timing_idx_lsb 0
#define xd_p_reg_stes_iadj_val_7_0	(*(volatile byte xdata *) 0xF61C)
#define    p_reg_stes_iadj_val_7_0	0xF61C 
#define	reg_stes_iadj_val_7_0_pos 0
#define	reg_stes_iadj_val_7_0_len 8
#define	reg_stes_iadj_val_7_0_lsb 0
#define xd_p_reg_stes_iadj_val_15_8	(*(volatile byte xdata *) 0xF61D)
#define    p_reg_stes_iadj_val_15_8	0xF61D 
#define	reg_stes_iadj_val_15_8_pos 0
#define	reg_stes_iadj_val_15_8_len 8
#define	reg_stes_iadj_val_15_8_lsb 8
#define xd_p_reg_p_ste_start_guard_7_0	(*(volatile byte xdata *) 0xF620)
#define    p_reg_p_ste_start_guard_7_0	0xF620 
#define	reg_p_ste_start_guard_7_0_pos 0
#define	reg_p_ste_start_guard_7_0_len 8
#define	reg_p_ste_start_guard_7_0_lsb 0
#define xd_p_reg_p_ste_start_guard_9_8	(*(volatile byte xdata *) 0xF621)
#define    p_reg_p_ste_start_guard_9_8	0xF621 
#define	reg_p_ste_start_guard_9_8_pos 0
#define	reg_p_ste_start_guard_9_8_len 2
#define	reg_p_ste_start_guard_9_8_lsb 8
#define xd_p_reg_p_ste_end_guard_7_0	(*(volatile byte xdata *) 0xF622)
#define    p_reg_p_ste_end_guard_7_0	0xF622 
#define	reg_p_ste_end_guard_7_0_pos 0
#define	reg_p_ste_end_guard_7_0_len 8
#define	reg_p_ste_end_guard_7_0_lsb 0
#define xd_p_reg_p_ste_end_guard_9_8	(*(volatile byte xdata *) 0xF623)
#define    p_reg_p_ste_end_guard_9_8	0xF623 
#define	reg_p_ste_end_guard_9_8_pos 0
#define	reg_p_ste_end_guard_9_8_len 2
#define	reg_p_ste_end_guard_9_8_lsb 8
#define xd_r_reg_r_ste_wrong_beacon_count	(*(volatile byte xdata *) 0xF624)
#define    r_reg_r_ste_wrong_beacon_count	0xF624 
#define	reg_r_ste_wrong_beacon_count_pos 0
#define	reg_r_ste_wrong_beacon_count_len 7
#define	reg_r_ste_wrong_beacon_count_lsb 0
#define xd_p_reg_p_fccid_en	(*(volatile byte xdata *) 0xF625)
#define    p_reg_p_fccid_en	0xF625 
#define	reg_p_fccid_en_pos 0
#define	reg_p_fccid_en_len 1
#define	reg_p_fccid_en_lsb 0
#define xd_p_reg_p_fccid_fft_ave_symbol_num	(*(volatile byte xdata *) 0xF626)
#define    p_reg_p_fccid_fft_ave_symbol_num	0xF626 
#define	reg_p_fccid_fft_ave_symbol_num_pos 0
#define	reg_p_fccid_fft_ave_symbol_num_len 6
#define	reg_p_fccid_fft_ave_symbol_num_lsb 0
#define xd_p_reg_p_fccid_fft_work_start_tone_7_0	(*(volatile byte xdata *) 0xF627)
#define    p_reg_p_fccid_fft_work_start_tone_7_0	0xF627 
#define	reg_p_fccid_fft_work_start_tone_7_0_pos 0
#define	reg_p_fccid_fft_work_start_tone_7_0_len 8
#define	reg_p_fccid_fft_work_start_tone_7_0_lsb 0
#define xd_p_reg_p_fccid_fft_work_start_tone_12_8	(*(volatile byte xdata *) 0xF628)
#define    p_reg_p_fccid_fft_work_start_tone_12_8	0xF628 
#define	reg_p_fccid_fft_work_start_tone_12_8_pos 0
#define	reg_p_fccid_fft_work_start_tone_12_8_len 5
#define	reg_p_fccid_fft_work_start_tone_12_8_lsb 8
#define xd_p_reg_p_fccid_fft_work_end_tone_7_0	(*(volatile byte xdata *) 0xF629)
#define    p_reg_p_fccid_fft_work_end_tone_7_0	0xF629 
#define	reg_p_fccid_fft_work_end_tone_7_0_pos 0
#define	reg_p_fccid_fft_work_end_tone_7_0_len 8
#define	reg_p_fccid_fft_work_end_tone_7_0_lsb 0
#define xd_p_reg_p_fccid_fft_work_end_tone_12_8	(*(volatile byte xdata *) 0xF62A)
#define    p_reg_p_fccid_fft_work_end_tone_12_8	0xF62A 
#define	reg_p_fccid_fft_work_end_tone_12_8_pos 0
#define	reg_p_fccid_fft_work_end_tone_12_8_len 5
#define	reg_p_fccid_fft_work_end_tone_12_8_lsb 8
#define xd_p_reg_p_fccid_peak_to_th_divider	(*(volatile byte xdata *) 0xF62B)
#define    p_reg_p_fccid_peak_to_th_divider	0xF62B 
#define	reg_p_fccid_peak_to_th_divider_pos 0
#define	reg_p_fccid_peak_to_th_divider_len 4
#define	reg_p_fccid_peak_to_th_divider_lsb 0
#define xd_p_reg_p_fccid_peak_to_th_mode	(*(volatile byte xdata *) 0xF62C)
#define    p_reg_p_fccid_peak_to_th_mode	0xF62C 
#define	reg_p_fccid_peak_to_th_mode_pos 0
#define	reg_p_fccid_peak_to_th_mode_len 2
#define	reg_p_fccid_peak_to_th_mode_lsb 0
#define xd_p_reg_p_fccid_search_mode	(*(volatile byte xdata *) 0xF62D)
#define    p_reg_p_fccid_search_mode	0xF62D 
#define	reg_p_fccid_search_mode_pos 0
#define	reg_p_fccid_search_mode_len 1
#define	reg_p_fccid_search_mode_lsb 0
#define xd_p_reg_p_fccid_group_th	(*(volatile byte xdata *) 0xF62E)
#define    p_reg_p_fccid_group_th	0xF62E 
#define	reg_p_fccid_group_th_pos 0
#define	reg_p_fccid_group_th_len 7
#define	reg_p_fccid_group_th_lsb 0
#define xd_p_reg_p_fccid_search_rdy	(*(volatile byte xdata *) 0xF62F)
#define    p_reg_p_fccid_search_rdy	0xF62F 
#define	reg_p_fccid_search_rdy_pos 0
#define	reg_p_fccid_search_rdy_len 1
#define	reg_p_fccid_search_rdy_lsb 0
#define xd_r_reg_r_fccid_fft_ave_read_out_7_0	(*(volatile byte xdata *) 0xF630)
#define    r_reg_r_fccid_fft_ave_read_out_7_0	0xF630 
#define	reg_r_fccid_fft_ave_read_out_7_0_pos 0
#define	reg_r_fccid_fft_ave_read_out_7_0_len 8
#define	reg_r_fccid_fft_ave_read_out_7_0_lsb 0
#define xd_r_reg_r_fccid_fft_ave_read_out_15_8	(*(volatile byte xdata *) 0xF631)
#define    r_reg_r_fccid_fft_ave_read_out_15_8	0xF631 
#define	reg_r_fccid_fft_ave_read_out_15_8_pos 0
#define	reg_r_fccid_fft_ave_read_out_15_8_len 8
#define	reg_r_fccid_fft_ave_read_out_15_8_lsb 8
#define xd_r_reg_r_fccid_large_tone_num_7_0	(*(volatile byte xdata *) 0xF632)
#define    r_reg_r_fccid_large_tone_num_7_0	0xF632 
#define	reg_r_fccid_large_tone_num_7_0_pos 0
#define	reg_r_fccid_large_tone_num_7_0_len 8
#define	reg_r_fccid_large_tone_num_7_0_lsb 0
#define xd_r_reg_r_fccid_large_tone_num_12_8	(*(volatile byte xdata *) 0xF633)
#define    r_reg_r_fccid_large_tone_num_12_8	0xF633 
#define	reg_r_fccid_large_tone_num_12_8_pos 0
#define	reg_r_fccid_large_tone_num_12_8_len 5
#define	reg_r_fccid_large_tone_num_12_8_lsb 8
#define xd_r_reg_r_fccid_cci1_start_tone_7_0	(*(volatile byte xdata *) 0xF634)
#define    r_reg_r_fccid_cci1_start_tone_7_0	0xF634 
#define	reg_r_fccid_cci1_start_tone_7_0_pos 0
#define	reg_r_fccid_cci1_start_tone_7_0_len 8
#define	reg_r_fccid_cci1_start_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci1_start_tone_12_8	(*(volatile byte xdata *) 0xF635)
#define    r_reg_r_fccid_cci1_start_tone_12_8	0xF635 
#define	reg_r_fccid_cci1_start_tone_12_8_pos 0
#define	reg_r_fccid_cci1_start_tone_12_8_len 5
#define	reg_r_fccid_cci1_start_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci1_end_tone_7_0	(*(volatile byte xdata *) 0xF636)
#define    r_reg_r_fccid_cci1_end_tone_7_0	0xF636 
#define	reg_r_fccid_cci1_end_tone_7_0_pos 0
#define	reg_r_fccid_cci1_end_tone_7_0_len 8
#define	reg_r_fccid_cci1_end_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci1_end_tone_12_8	(*(volatile byte xdata *) 0xF637)
#define    r_reg_r_fccid_cci1_end_tone_12_8	0xF637 
#define	reg_r_fccid_cci1_end_tone_12_8_pos 0
#define	reg_r_fccid_cci1_end_tone_12_8_len 5
#define	reg_r_fccid_cci1_end_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci1_peak_7_0	(*(volatile byte xdata *) 0xF638)
#define    r_reg_r_fccid_cci1_peak_7_0	0xF638 
#define	reg_r_fccid_cci1_peak_7_0_pos 0
#define	reg_r_fccid_cci1_peak_7_0_len 8
#define	reg_r_fccid_cci1_peak_7_0_lsb 0
#define xd_r_reg_r_fccid_cci1_peak_15_8	(*(volatile byte xdata *) 0xF639)
#define    r_reg_r_fccid_cci1_peak_15_8	0xF639 
#define	reg_r_fccid_cci1_peak_15_8_pos 0
#define	reg_r_fccid_cci1_peak_15_8_len 8
#define	reg_r_fccid_cci1_peak_15_8_lsb 8
#define xd_r_reg_r_fccid_cci2_start_tone_7_0	(*(volatile byte xdata *) 0xF63A)
#define    r_reg_r_fccid_cci2_start_tone_7_0	0xF63A 
#define	reg_r_fccid_cci2_start_tone_7_0_pos 0
#define	reg_r_fccid_cci2_start_tone_7_0_len 8
#define	reg_r_fccid_cci2_start_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci2_start_tone_12_8	(*(volatile byte xdata *) 0xF63B)
#define    r_reg_r_fccid_cci2_start_tone_12_8	0xF63B 
#define	reg_r_fccid_cci2_start_tone_12_8_pos 0
#define	reg_r_fccid_cci2_start_tone_12_8_len 5
#define	reg_r_fccid_cci2_start_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci2_end_tone_7_0	(*(volatile byte xdata *) 0xF63C)
#define    r_reg_r_fccid_cci2_end_tone_7_0	0xF63C 
#define	reg_r_fccid_cci2_end_tone_7_0_pos 0
#define	reg_r_fccid_cci2_end_tone_7_0_len 8
#define	reg_r_fccid_cci2_end_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci2_end_tone_12_8	(*(volatile byte xdata *) 0xF63D)
#define    r_reg_r_fccid_cci2_end_tone_12_8	0xF63D 
#define	reg_r_fccid_cci2_end_tone_12_8_pos 0
#define	reg_r_fccid_cci2_end_tone_12_8_len 5
#define	reg_r_fccid_cci2_end_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci2_peak_7_0	(*(volatile byte xdata *) 0xF63E)
#define    r_reg_r_fccid_cci2_peak_7_0	0xF63E 
#define	reg_r_fccid_cci2_peak_7_0_pos 0
#define	reg_r_fccid_cci2_peak_7_0_len 8
#define	reg_r_fccid_cci2_peak_7_0_lsb 0
#define xd_r_reg_r_fccid_cci2_peak_15_8	(*(volatile byte xdata *) 0xF63F)
#define    r_reg_r_fccid_cci2_peak_15_8	0xF63F 
#define	reg_r_fccid_cci2_peak_15_8_pos 0
#define	reg_r_fccid_cci2_peak_15_8_len 8
#define	reg_r_fccid_cci2_peak_15_8_lsb 8
#define xd_r_reg_r_fccid_cci3_start_tone_7_0	(*(volatile byte xdata *) 0xF640)
#define    r_reg_r_fccid_cci3_start_tone_7_0	0xF640 
#define	reg_r_fccid_cci3_start_tone_7_0_pos 0
#define	reg_r_fccid_cci3_start_tone_7_0_len 8
#define	reg_r_fccid_cci3_start_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci3_start_tone_12_8	(*(volatile byte xdata *) 0xF641)
#define    r_reg_r_fccid_cci3_start_tone_12_8	0xF641 
#define	reg_r_fccid_cci3_start_tone_12_8_pos 0
#define	reg_r_fccid_cci3_start_tone_12_8_len 5
#define	reg_r_fccid_cci3_start_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci3_end_tone_7_0	(*(volatile byte xdata *) 0xF642)
#define    r_reg_r_fccid_cci3_end_tone_7_0	0xF642 
#define	reg_r_fccid_cci3_end_tone_7_0_pos 0
#define	reg_r_fccid_cci3_end_tone_7_0_len 8
#define	reg_r_fccid_cci3_end_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci3_end_tone_12_8	(*(volatile byte xdata *) 0xF643)
#define    r_reg_r_fccid_cci3_end_tone_12_8	0xF643 
#define	reg_r_fccid_cci3_end_tone_12_8_pos 0
#define	reg_r_fccid_cci3_end_tone_12_8_len 5
#define	reg_r_fccid_cci3_end_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci3_peak_7_0	(*(volatile byte xdata *) 0xF644)
#define    r_reg_r_fccid_cci3_peak_7_0	0xF644 
#define	reg_r_fccid_cci3_peak_7_0_pos 0
#define	reg_r_fccid_cci3_peak_7_0_len 8
#define	reg_r_fccid_cci3_peak_7_0_lsb 0
#define xd_r_reg_r_fccid_cci3_peak_15_8	(*(volatile byte xdata *) 0xF645)
#define    r_reg_r_fccid_cci3_peak_15_8	0xF645 
#define	reg_r_fccid_cci3_peak_15_8_pos 0
#define	reg_r_fccid_cci3_peak_15_8_len 8
#define	reg_r_fccid_cci3_peak_15_8_lsb 8
#define xd_r_reg_r_fccid_cci4_start_tone_7_0	(*(volatile byte xdata *) 0xF646)
#define    r_reg_r_fccid_cci4_start_tone_7_0	0xF646 
#define	reg_r_fccid_cci4_start_tone_7_0_pos 0
#define	reg_r_fccid_cci4_start_tone_7_0_len 8
#define	reg_r_fccid_cci4_start_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci4_start_tone_12_8	(*(volatile byte xdata *) 0xF647)
#define    r_reg_r_fccid_cci4_start_tone_12_8	0xF647 
#define	reg_r_fccid_cci4_start_tone_12_8_pos 0
#define	reg_r_fccid_cci4_start_tone_12_8_len 5
#define	reg_r_fccid_cci4_start_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci4_end_tone_7_0	(*(volatile byte xdata *) 0xF648)
#define    r_reg_r_fccid_cci4_end_tone_7_0	0xF648 
#define	reg_r_fccid_cci4_end_tone_7_0_pos 0
#define	reg_r_fccid_cci4_end_tone_7_0_len 8
#define	reg_r_fccid_cci4_end_tone_7_0_lsb 0
#define xd_r_reg_r_fccid_cci4_end_tone_12_8	(*(volatile byte xdata *) 0xF649)
#define    r_reg_r_fccid_cci4_end_tone_12_8	0xF649 
#define	reg_r_fccid_cci4_end_tone_12_8_pos 0
#define	reg_r_fccid_cci4_end_tone_12_8_len 5
#define	reg_r_fccid_cci4_end_tone_12_8_lsb 8
#define xd_r_reg_r_fccid_cci4_peak_7_0	(*(volatile byte xdata *) 0xF64A)
#define    r_reg_r_fccid_cci4_peak_7_0	0xF64A 
#define	reg_r_fccid_cci4_peak_7_0_pos 0
#define	reg_r_fccid_cci4_peak_7_0_len 8
#define	reg_r_fccid_cci4_peak_7_0_lsb 0
#define xd_r_reg_r_fccid_cci4_peak_15_8	(*(volatile byte xdata *) 0xF64B)
#define    r_reg_r_fccid_cci4_peak_15_8	0xF64B 
#define	reg_r_fccid_cci4_peak_15_8_pos 0
#define	reg_r_fccid_cci4_peak_15_8_len 8
#define	reg_r_fccid_cci4_peak_15_8_lsb 8
#define xd_r_reg_r_fccid_cci1_rank	(*(volatile byte xdata *) 0xF64C)
#define    r_reg_r_fccid_cci1_rank	0xF64C 
#define	reg_r_fccid_cci1_rank_pos 0
#define	reg_r_fccid_cci1_rank_len 3
#define	reg_r_fccid_cci1_rank_lsb 0
#define xd_r_reg_r_fccid_cci2_rank	(*(volatile byte xdata *) 0xF64D)
#define    r_reg_r_fccid_cci2_rank	0xF64D 
#define	reg_r_fccid_cci2_rank_pos 0
#define	reg_r_fccid_cci2_rank_len 3
#define	reg_r_fccid_cci2_rank_lsb 0
#define xd_r_reg_r_fccid_cci3_rank	(*(volatile byte xdata *) 0xF64E)
#define    r_reg_r_fccid_cci3_rank	0xF64E 
#define	reg_r_fccid_cci3_rank_pos 0
#define	reg_r_fccid_cci3_rank_len 3
#define	reg_r_fccid_cci3_rank_lsb 0
#define xd_r_reg_r_fccid_cci4_rank	(*(volatile byte xdata *) 0xF64F)
#define    r_reg_r_fccid_cci4_rank	0xF64F 
#define	reg_r_fccid_cci4_rank_pos 0
#define	reg_r_fccid_cci4_rank_len 3
#define	reg_r_fccid_cci4_rank_lsb 0
#define xd_p_reg_p_csi_shift3	(*(volatile byte xdata *) 0xF650)
#define    p_reg_p_csi_shift3	0xF650 
#define	reg_p_csi_shift3_pos 0
#define	reg_p_csi_shift3_len 4
#define	reg_p_csi_shift3_lsb 0
#define xd_p_reg_p_csi_mul3	(*(volatile byte xdata *) 0xF651)
#define    p_reg_p_csi_mul3	0xF651 
#define	reg_p_csi_mul3_pos 0
#define	reg_p_csi_mul3_len 8
#define	reg_p_csi_mul3_lsb 0
#define xd_p_reg_p_csi_level3_7_0	(*(volatile byte xdata *) 0xF652)
#define    p_reg_p_csi_level3_7_0	0xF652 
#define	reg_p_csi_level3_7_0_pos 0
#define	reg_p_csi_level3_7_0_len 8
#define	reg_p_csi_level3_7_0_lsb 0
#define xd_p_reg_p_csi_level3_8	(*(volatile byte xdata *) 0xF653)
#define    p_reg_p_csi_level3_8	0xF653 
#define	reg_p_csi_level3_8_pos 0
#define	reg_p_csi_level3_8_len 1
#define	reg_p_csi_level3_8_lsb 8
#define xd_p_reg_p_csi_fftout_shift_fix_value	(*(volatile byte xdata *) 0xF654)
#define    p_reg_p_csi_fftout_shift_fix_value	0xF654 
#define	reg_p_csi_fftout_shift_fix_value_pos 0
#define	reg_p_csi_fftout_shift_fix_value_len 4
#define	reg_p_csi_fftout_shift_fix_value_lsb 0
#define xd_p_reg_p_feq_scale_pow	(*(volatile byte xdata *) 0xF655)
#define    p_reg_p_feq_scale_pow	0xF655 
#define	reg_p_feq_scale_pow_pos 0
#define	reg_p_feq_scale_pow_len 6
#define	reg_p_feq_scale_pow_lsb 0
#define xd_p_reg_p_csi_cp_idx	(*(volatile byte xdata *) 0xF656)
#define    p_reg_p_csi_cp_idx	0xF656 
#define	reg_p_csi_cp_idx_pos 0
#define	reg_p_csi_cp_idx_len 8
#define	reg_p_csi_cp_idx_lsb 0
#define xd_p_reg_p_csi_outsh_zero_th_7_0	(*(volatile byte xdata *) 0xF657)
#define    p_reg_p_csi_outsh_zero_th_7_0	0xF657 
#define	reg_p_csi_outsh_zero_th_7_0_pos 0
#define	reg_p_csi_outsh_zero_th_7_0_len 8
#define	reg_p_csi_outsh_zero_th_7_0_lsb 0
#define xd_p_reg_p_csi_outsh_zero_th_10_8	(*(volatile byte xdata *) 0xF658)
#define    p_reg_p_csi_outsh_zero_th_10_8	0xF658 
#define	reg_p_csi_outsh_zero_th_10_8_pos 0
#define	reg_p_csi_outsh_zero_th_10_8_len 3
#define	reg_p_csi_outsh_zero_th_10_8_lsb 8
#define xd_p_reg_p_csi_ar_ratio	(*(volatile byte xdata *) 0xF659)
#define    p_reg_p_csi_ar_ratio	0xF659 
#define	reg_p_csi_ar_ratio_pos 0
#define	reg_p_csi_ar_ratio_len 8
#define	reg_p_csi_ar_ratio_lsb 0
#define xd_p_reg_r_csi_cp_vld	(*(volatile byte xdata *) 0xF65A)
#define    p_reg_r_csi_cp_vld	0xF65A 
#define	reg_r_csi_cp_vld_pos 0
#define	reg_r_csi_cp_vld_len 1
#define	reg_r_csi_cp_vld_lsb 0
#define xd_p_reg_r_csi_sp_vld	(*(volatile byte xdata *) 0xF65B)
#define    p_reg_r_csi_sp_vld	0xF65B 
#define	reg_r_csi_sp_vld_pos 0
#define	reg_r_csi_sp_vld_len 1
#define	reg_r_csi_sp_vld_lsb 0
#define xd_p_reg_p_csi_fft_out_shift_en	(*(volatile byte xdata *) 0xF65C)
#define    p_reg_p_csi_fft_out_shift_en	0xF65C 
#define	reg_p_csi_fft_out_shift_en_pos 0
#define	reg_p_csi_fft_out_shift_en_len 1
#define	reg_p_csi_fft_out_shift_en_lsb 0
#define xd_p_reg_p_csi_feq_out_shift_en	(*(volatile byte xdata *) 0xF65D)
#define    p_reg_p_csi_feq_out_shift_en	0xF65D 
#define	reg_p_csi_feq_out_shift_en_pos 0
#define	reg_p_csi_feq_out_shift_en_len 1
#define	reg_p_csi_feq_out_shift_en_lsb 0
#define xd_p_reg_r_csi_cp_fft_out	(*(volatile byte xdata *) 0xF65E)
#define    p_reg_r_csi_cp_fft_out	0xF65E 
#define	reg_r_csi_cp_fft_out_pos 0
#define	reg_r_csi_cp_fft_out_len 1
#define	reg_r_csi_cp_fft_out_lsb 0
#define xd_p_reg_r_csi_sp_feq_log2_out	(*(volatile byte xdata *) 0xF65F)
#define    p_reg_r_csi_sp_feq_log2_out	0xF65F 
#define	reg_r_csi_sp_feq_log2_out_pos 0
#define	reg_r_csi_sp_feq_log2_out_len 8
#define	reg_r_csi_sp_feq_log2_out_lsb 0
#define xd_p_reg_r_csi_sp_fft_out	(*(volatile byte xdata *) 0xF660)
#define    p_reg_r_csi_sp_fft_out	0xF660 
#define	reg_r_csi_sp_fft_out_pos 0
#define	reg_r_csi_sp_fft_out_len 1
#define	reg_r_csi_sp_fft_out_lsb 0
#define xd_p_reg_p_feq_eh2_from_fpcc_en	(*(volatile byte xdata *) 0xF661)
#define    p_reg_p_feq_eh2_from_fpcc_en	0xF661 
#define	reg_p_feq_eh2_from_fpcc_en_pos 0
#define	reg_p_feq_eh2_from_fpcc_en_len 1
#define	reg_p_feq_eh2_from_fpcc_en_lsb 0
#define xd_r_reg_r_fccid_fft_ave_peak_7_0	(*(volatile byte xdata *) 0xF662)
#define    r_reg_r_fccid_fft_ave_peak_7_0	0xF662 
#define	reg_r_fccid_fft_ave_peak_7_0_pos 0
#define	reg_r_fccid_fft_ave_peak_7_0_len 8
#define	reg_r_fccid_fft_ave_peak_7_0_lsb 0
#define xd_r_reg_r_fccid_fft_ave_peak_15_8	(*(volatile byte xdata *) 0xF663)
#define    r_reg_r_fccid_fft_ave_peak_15_8	0xF663 
#define	reg_r_fccid_fft_ave_peak_15_8_pos 0
#define	reg_r_fccid_fft_ave_peak_15_8_len 8
#define	reg_r_fccid_fft_ave_peak_15_8_lsb 8
#define xd_r_reg_r_fccid_fft_ave_peak_23_16	(*(volatile byte xdata *) 0xF664)
#define    r_reg_r_fccid_fft_ave_peak_23_16	0xF664 
#define	reg_r_fccid_fft_ave_peak_23_16_pos 0
#define	reg_r_fccid_fft_ave_peak_23_16_len 8
#define	reg_r_fccid_fft_ave_peak_23_16_lsb 16
#define xd_r_reg_r_fccid_fft_ave_peak_26_24	(*(volatile byte xdata *) 0xF665)
#define    r_reg_r_fccid_fft_ave_peak_26_24	0xF665 
#define	reg_r_fccid_fft_ave_peak_26_24_pos 0
#define	reg_r_fccid_fft_ave_peak_26_24_len 3
#define	reg_r_fccid_fft_ave_peak_26_24_lsb 24
#define xd_p_reg_p_fccid_fft_ave_read_rdy	(*(volatile byte xdata *) 0xF666)
#define    p_reg_p_fccid_fft_ave_read_rdy	0xF666 
#define	reg_p_fccid_fft_ave_read_rdy_pos 0
#define	reg_p_fccid_fft_ave_read_rdy_len 1
#define	reg_p_fccid_fft_ave_read_rdy_lsb 0
#define xd_p_reg_p_fccid_fft_ave_read_index_7_0	(*(volatile byte xdata *) 0xF667)
#define    p_reg_p_fccid_fft_ave_read_index_7_0	0xF667 
#define	reg_p_fccid_fft_ave_read_index_7_0_pos 0
#define	reg_p_fccid_fft_ave_read_index_7_0_len 8
#define	reg_p_fccid_fft_ave_read_index_7_0_lsb 0
#define xd_p_reg_p_fccid_fft_ave_read_index_12_8	(*(volatile byte xdata *) 0xF668)
#define    p_reg_p_fccid_fft_ave_read_index_12_8	0xF668 
#define	reg_p_fccid_fft_ave_read_index_12_8_pos 0
#define	reg_p_fccid_fft_ave_read_index_12_8_len 5
#define	reg_p_fccid_fft_ave_read_index_12_8_lsb 8
#define xd_p_reg_p_csi_mccid_thr	(*(volatile byte xdata *) 0xF66E)
#define    p_reg_p_csi_mccid_thr	0xF66E 
#define	reg_p_csi_mccid_thr_pos 0
#define	reg_p_csi_mccid_thr_len 4
#define	reg_p_csi_mccid_thr_lsb 0
#define xd_p_reg_p_csi_mccid_detectcount	(*(volatile byte xdata *) 0xF66F)
#define    p_reg_p_csi_mccid_detectcount	0xF66F 
#define	reg_p_csi_mccid_detectcount_pos 0
#define	reg_p_csi_mccid_detectcount_len 3
#define	reg_p_csi_mccid_detectcount_lsb 0
#define xd_p_reg_p_csi_mccid_scstrobe	(*(volatile byte xdata *) 0xF670)
#define    p_reg_p_csi_mccid_scstrobe	0xF670 
#define	reg_p_csi_mccid_scstrobe_pos 0
#define	reg_p_csi_mccid_scstrobe_len 3
#define	reg_p_csi_mccid_scstrobe_lsb 0
#define xd_p_reg_p_csi_mccid_accrange	(*(volatile byte xdata *) 0xF671)
#define    p_reg_p_csi_mccid_accrange	0xF671 
#define	reg_p_csi_mccid_accrange_pos 0
#define	reg_p_csi_mccid_accrange_len 3
#define	reg_p_csi_mccid_accrange_lsb 0
#define xd_p_reg_p_mccid_detectfftthr	(*(volatile byte xdata *) 0xF672)
#define    p_reg_p_mccid_detectfftthr	0xF672 
#define	reg_p_mccid_detectfftthr_pos 0
#define	reg_p_mccid_detectfftthr_len 8
#define	reg_p_mccid_detectfftthr_lsb 0
#define xd_p_reg_p_mccid_detectcsithr	(*(volatile byte xdata *) 0xF673)
#define    p_reg_p_mccid_detectcsithr	0xF673 
#define	reg_p_mccid_detectcsithr_pos 0
#define	reg_p_mccid_detectcsithr_len 8
#define	reg_p_mccid_detectcsithr_lsb 0
#define xd_p_reg_p_mccid_maxtonenearrange	(*(volatile byte xdata *) 0xF674)
#define    p_reg_p_mccid_maxtonenearrange	0xF674 
#define	reg_p_mccid_maxtonenearrange_pos 0
#define	reg_p_mccid_maxtonenearrange_len 8
#define	reg_p_mccid_maxtonenearrange_lsb 0
#define xd_p_reg_p_mccid_detectedmaxtonecount	(*(volatile byte xdata *) 0xF675)
#define    p_reg_p_mccid_detectedmaxtonecount	0xF675 
#define	reg_p_mccid_detectedmaxtonecount_pos 0
#define	reg_p_mccid_detectedmaxtonecount_len 8
#define	reg_p_mccid_detectedmaxtonecount_lsb 0
#define xd_p_reg_p_mccid_use_new_ccilocator	(*(volatile byte xdata *) 0xF676)
#define    p_reg_p_mccid_use_new_ccilocator	0xF676 
#define	reg_p_mccid_use_new_ccilocator_pos 0
#define	reg_p_mccid_use_new_ccilocator_len 1
#define	reg_p_mccid_use_new_ccilocator_lsb 0
#define xd_p_reg_p_mccid_block_DC_Range	(*(volatile byte xdata *) 0xF677)
#define    p_reg_p_mccid_block_DC_Range	0xF677 
#define	reg_p_mccid_block_DC_Range_pos 0
#define	reg_p_mccid_block_DC_Range_len 8
#define	reg_p_mccid_block_DC_Range_lsb 0
#define xd_p_reg_p_mccid_FO_sign	(*(volatile byte xdata *) 0xF678)
#define    p_reg_p_mccid_FO_sign	0xF678 
