liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_p_mccid_FO_sign_pos 0
#define	reg_p_mccid_FO_sign_len 1
#define	reg_p_mccid_FO_sign_lsb 0
#define xd_p_reg_p_mccid_block_DC_Center	(*(volatile byte xdata *) 0xF679)
#define    p_reg_p_mccid_block_DC_Center	0xF679 
#define	reg_p_mccid_block_DC_Center_pos 0
#define	reg_p_mccid_block_DC_Center_len 8
#define	reg_p_mccid_block_DC_Center_lsb 0
#define xd_p_reg_p_mccid_select_fft_csi	(*(volatile byte xdata *) 0xF67A)
#define    p_reg_p_mccid_select_fft_csi	0xF67A 
#define	reg_p_mccid_select_fft_csi_pos 0
#define	reg_p_mccid_select_fft_csi_len 1
#define	reg_p_mccid_select_fft_csi_lsb 0
#define xd_r_reg_r_mccid_ccilocator_max_tone_7_0	(*(volatile byte xdata *) 0xF67B)
#define    r_reg_r_mccid_ccilocator_max_tone_7_0	0xF67B 
#define	reg_r_mccid_ccilocator_max_tone_7_0_pos 0
#define	reg_r_mccid_ccilocator_max_tone_7_0_len 8
#define	reg_r_mccid_ccilocator_max_tone_7_0_lsb 0
#define xd_r_reg_r_mccid_ccilocator_max_tone_12_8	(*(volatile byte xdata *) 0xF67C)
#define    r_reg_r_mccid_ccilocator_max_tone_12_8	0xF67C 
#define	reg_r_mccid_ccilocator_max_tone_12_8_pos 0
#define	reg_r_mccid_ccilocator_max_tone_12_8_len 5
#define	reg_r_mccid_ccilocator_max_tone_12_8_lsb 8
#define xd_p_reg_p_ce_cdpf_mode_en	(*(volatile byte xdata *) 0xF680)
#define    p_reg_p_ce_cdpf_mode_en	0xF680 
#define	reg_p_ce_cdpf_mode_en_pos 0
#define	reg_p_ce_cdpf_mode_en_len 1
#define	reg_p_ce_cdpf_mode_en_lsb 0
#define xd_p_reg_p_cdpf_srch_main_th_7_0	(*(volatile byte xdata *) 0xF681)
#define    p_reg_p_cdpf_srch_main_th_7_0	0xF681 
#define	reg_p_cdpf_srch_main_th_7_0_pos 0
#define	reg_p_cdpf_srch_main_th_7_0_len 8
#define	reg_p_cdpf_srch_main_th_7_0_lsb 0
#define xd_p_reg_p_cdpf_srch_main_th_10_8	(*(volatile byte xdata *) 0xF682)
#define    p_reg_p_cdpf_srch_main_th_10_8	0xF682 
#define	reg_p_cdpf_srch_main_th_10_8_pos 0
#define	reg_p_cdpf_srch_main_th_10_8_len 3
#define	reg_p_cdpf_srch_main_th_10_8_lsb 8
#define xd_p_reg_p_cdpf_srch_all_th_7_0	(*(volatile byte xdata *) 0xF683)
#define    p_reg_p_cdpf_srch_all_th_7_0	0xF683 
#define	reg_p_cdpf_srch_all_th_7_0_pos 0
#define	reg_p_cdpf_srch_all_th_7_0_len 8
#define	reg_p_cdpf_srch_all_th_7_0_lsb 0
#define xd_p_reg_p_cdpf_srch_all_th_10_8	(*(volatile byte xdata *) 0xF684)
#define    p_reg_p_cdpf_srch_all_th_10_8	0xF684 
#define	reg_p_cdpf_srch_all_th_10_8_pos 0
#define	reg_p_cdpf_srch_all_th_10_8_len 3
#define	reg_p_cdpf_srch_all_th_10_8_lsb 8
#define xd_p_reg_p_cdpf_srch_interval	(*(volatile byte xdata *) 0xF685)
#define    p_reg_p_cdpf_srch_interval	0xF685 
#define	reg_p_cdpf_srch_interval_pos 0
#define	reg_p_cdpf_srch_interval_len 8
#define	reg_p_cdpf_srch_interval_lsb 0
#define xd_p_reg_p_cdpf_srch_guard_shift	(*(volatile byte xdata *) 0xF686)
#define    p_reg_p_cdpf_srch_guard_shift	0xF686 
#define	reg_p_cdpf_srch_guard_shift_pos 0
#define	reg_p_cdpf_srch_guard_shift_len 8
#define	reg_p_cdpf_srch_guard_shift_lsb 0
#define xd_p_reg_p_cdpf_srch_is_image_th	(*(volatile byte xdata *) 0xF687)
#define    p_reg_p_cdpf_srch_is_image_th	0xF687 
#define	reg_p_cdpf_srch_is_image_th_pos 0
#define	reg_p_cdpf_srch_is_image_th_len 8
#define	reg_p_cdpf_srch_is_image_th_lsb 0
#define xd_p_reg_p_cdpf_tps_acc_num	(*(volatile byte xdata *) 0xF688)
#define    p_reg_p_cdpf_tps_acc_num	0xF688 
#define	reg_p_cdpf_tps_acc_num_pos 0
#define	reg_p_cdpf_tps_acc_num_len 5
#define	reg_p_cdpf_tps_acc_num_lsb 0
#define xd_p_reg_p_cdpf_srch_ch_no	(*(volatile byte xdata *) 0xF689)
#define    p_reg_p_cdpf_srch_ch_no	0xF689 
#define	reg_p_cdpf_srch_ch_no_pos 0
#define	reg_p_cdpf_srch_ch_no_len 2
#define	reg_p_cdpf_srch_ch_no_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_shift_7_0	(*(volatile byte xdata *) 0xF68A)
#define    r_reg_r_cdpf_srch_ch_shift_7_0	0xF68A 
#define	reg_r_cdpf_srch_ch_shift_7_0_pos 0
#define	reg_r_cdpf_srch_ch_shift_7_0_len 8
#define	reg_r_cdpf_srch_ch_shift_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_shift_12_8	(*(volatile byte xdata *) 0xF68B)
#define    r_reg_r_cdpf_srch_ch_shift_12_8	0xF68B 
#define	reg_r_cdpf_srch_ch_shift_12_8_pos 0
#define	reg_r_cdpf_srch_ch_shift_12_8_len 5
#define	reg_r_cdpf_srch_ch_shift_12_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_location_0_7_0	(*(volatile byte xdata *) 0xF68C)
#define    r_reg_r_cdpf_srch_ch_location_0_7_0	0xF68C 
#define	reg_r_cdpf_srch_ch_location_0_7_0_pos 0
#define	reg_r_cdpf_srch_ch_location_0_7_0_len 8
#define	reg_r_cdpf_srch_ch_location_0_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_location_0_12_8	(*(volatile byte xdata *) 0xF68D)
#define    r_reg_r_cdpf_srch_ch_location_0_12_8	0xF68D 
#define	reg_r_cdpf_srch_ch_location_0_12_8_pos 0
#define	reg_r_cdpf_srch_ch_location_0_12_8_len 5
#define	reg_r_cdpf_srch_ch_location_0_12_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_location_1_7_0	(*(volatile byte xdata *) 0xF68E)
#define    r_reg_r_cdpf_srch_ch_location_1_7_0	0xF68E 
#define	reg_r_cdpf_srch_ch_location_1_7_0_pos 0
#define	reg_r_cdpf_srch_ch_location_1_7_0_len 8
#define	reg_r_cdpf_srch_ch_location_1_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_location_1_12_8	(*(volatile byte xdata *) 0xF68F)
#define    r_reg_r_cdpf_srch_ch_location_1_12_8	0xF68F 
#define	reg_r_cdpf_srch_ch_location_1_12_8_pos 0
#define	reg_r_cdpf_srch_ch_location_1_12_8_len 5
#define	reg_r_cdpf_srch_ch_location_1_12_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_location_2_7_0	(*(volatile byte xdata *) 0xF690)
#define    r_reg_r_cdpf_srch_ch_location_2_7_0	0xF690 
#define	reg_r_cdpf_srch_ch_location_2_7_0_pos 0
#define	reg_r_cdpf_srch_ch_location_2_7_0_len 8
#define	reg_r_cdpf_srch_ch_location_2_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_location_2_12_8	(*(volatile byte xdata *) 0xF691)
#define    r_reg_r_cdpf_srch_ch_location_2_12_8	0xF691 
#define	reg_r_cdpf_srch_ch_location_2_12_8_pos 0
#define	reg_r_cdpf_srch_ch_location_2_12_8_len 5
#define	reg_r_cdpf_srch_ch_location_2_12_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_location_3_7_0	(*(volatile byte xdata *) 0xF692)
#define    r_reg_r_cdpf_srch_ch_location_3_7_0	0xF692 
#define	reg_r_cdpf_srch_ch_location_3_7_0_pos 0
#define	reg_r_cdpf_srch_ch_location_3_7_0_len 8
#define	reg_r_cdpf_srch_ch_location_3_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_location_3_12_8	(*(volatile byte xdata *) 0xF693)
#define    r_reg_r_cdpf_srch_ch_location_3_12_8	0xF693 
#define	reg_r_cdpf_srch_ch_location_3_12_8_pos 0
#define	reg_r_cdpf_srch_ch_location_3_12_8_len 5
#define	reg_r_cdpf_srch_ch_location_3_12_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_power_0_7_0	(*(volatile byte xdata *) 0xF694)
#define    r_reg_r_cdpf_srch_ch_power_0_7_0	0xF694 
#define	reg_r_cdpf_srch_ch_power_0_7_0_pos 0
#define	reg_r_cdpf_srch_ch_power_0_7_0_len 8
#define	reg_r_cdpf_srch_ch_power_0_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_power_0_15_8	(*(volatile byte xdata *) 0xF695)
#define    r_reg_r_cdpf_srch_ch_power_0_15_8	0xF695 
#define	reg_r_cdpf_srch_ch_power_0_15_8_pos 0
#define	reg_r_cdpf_srch_ch_power_0_15_8_len 8
#define	reg_r_cdpf_srch_ch_power_0_15_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_power_1_7_0	(*(volatile byte xdata *) 0xF696)
#define    r_reg_r_cdpf_srch_ch_power_1_7_0	0xF696 
#define	reg_r_cdpf_srch_ch_power_1_7_0_pos 0
#define	reg_r_cdpf_srch_ch_power_1_7_0_len 8
#define	reg_r_cdpf_srch_ch_power_1_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_power_1_15_8	(*(volatile byte xdata *) 0xF697)
#define    r_reg_r_cdpf_srch_ch_power_1_15_8	0xF697 
#define	reg_r_cdpf_srch_ch_power_1_15_8_pos 0
#define	reg_r_cdpf_srch_ch_power_1_15_8_len 8
#define	reg_r_cdpf_srch_ch_power_1_15_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_power_2_7_0	(*(volatile byte xdata *) 0xF698)
#define    r_reg_r_cdpf_srch_ch_power_2_7_0	0xF698 
#define	reg_r_cdpf_srch_ch_power_2_7_0_pos 0
#define	reg_r_cdpf_srch_ch_power_2_7_0_len 8
#define	reg_r_cdpf_srch_ch_power_2_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_power_2_15_8	(*(volatile byte xdata *) 0xF699)
#define    r_reg_r_cdpf_srch_ch_power_2_15_8	0xF699 
#define	reg_r_cdpf_srch_ch_power_2_15_8_pos 0
#define	reg_r_cdpf_srch_ch_power_2_15_8_len 8
#define	reg_r_cdpf_srch_ch_power_2_15_8_lsb 8
#define xd_r_reg_r_cdpf_srch_ch_power_3_7_0	(*(volatile byte xdata *) 0xF69A)
#define    r_reg_r_cdpf_srch_ch_power_3_7_0	0xF69A 
#define	reg_r_cdpf_srch_ch_power_3_7_0_pos 0
#define	reg_r_cdpf_srch_ch_power_3_7_0_len 8
#define	reg_r_cdpf_srch_ch_power_3_7_0_lsb 0
#define xd_r_reg_r_cdpf_srch_ch_power_3_15_8	(*(volatile byte xdata *) 0xF69B)
#define    r_reg_r_cdpf_srch_ch_power_3_15_8	0xF69B 
#define	reg_r_cdpf_srch_ch_power_3_15_8_pos 0
#define	reg_r_cdpf_srch_ch_power_3_15_8_len 8
#define	reg_r_cdpf_srch_ch_power_3_15_8_lsb 8
#define xd_p_reg_p_cdpf_tps_test_center0_7_0	(*(volatile byte xdata *) 0xF69C)
#define    p_reg_p_cdpf_tps_test_center0_7_0	0xF69C 
#define	reg_p_cdpf_tps_test_center0_7_0_pos 0
#define	reg_p_cdpf_tps_test_center0_7_0_len 8
#define	reg_p_cdpf_tps_test_center0_7_0_lsb 0
#define xd_p_reg_p_cdpf_tps_test_center0_11_8	(*(volatile byte xdata *) 0xF69D)
#define    p_reg_p_cdpf_tps_test_center0_11_8	0xF69D 
#define	reg_p_cdpf_tps_test_center0_11_8_pos 0
#define	reg_p_cdpf_tps_test_center0_11_8_len 4
#define	reg_p_cdpf_tps_test_center0_11_8_lsb 8
#define xd_p_reg_p_cdpf_tps_test_center1_7_0	(*(volatile byte xdata *) 0xF69E)
#define    p_reg_p_cdpf_tps_test_center1_7_0	0xF69E 
#define	reg_p_cdpf_tps_test_center1_7_0_pos 0
#define	reg_p_cdpf_tps_test_center1_7_0_len 8
#define	reg_p_cdpf_tps_test_center1_7_0_lsb 0
#define xd_p_reg_p_cdpf_tps_test_center1_11_8	(*(volatile byte xdata *) 0xF69F)
#define    p_reg_p_cdpf_tps_test_center1_11_8	0xF69F 
#define	reg_p_cdpf_tps_test_center1_11_8_pos 0
#define	reg_p_cdpf_tps_test_center1_11_8_len 4
#define	reg_p_cdpf_tps_test_center1_11_8_lsb 8
#define xd_p_reg_p_cdpf_tps_test_center2_7_0	(*(volatile byte xdata *) 0xF6A0)
#define    p_reg_p_cdpf_tps_test_center2_7_0	0xF6A0 
#define	reg_p_cdpf_tps_test_center2_7_0_pos 0
#define	reg_p_cdpf_tps_test_center2_7_0_len 8
#define	reg_p_cdpf_tps_test_center2_7_0_lsb 0
#define xd_p_reg_p_cdpf_tps_test_center2_11_8	(*(volatile byte xdata *) 0xF6A1)
#define    p_reg_p_cdpf_tps_test_center2_11_8	0xF6A1 
#define	reg_p_cdpf_tps_test_center2_11_8_pos 0
#define	reg_p_cdpf_tps_test_center2_11_8_len 4
#define	reg_p_cdpf_tps_test_center2_11_8_lsb 8
#define xd_p_reg_p_cdpf_tps_test_center3_7_0	(*(volatile byte xdata *) 0xF6A2)
#define    p_reg_p_cdpf_tps_test_center3_7_0	0xF6A2 
#define	reg_p_cdpf_tps_test_center3_7_0_pos 0
#define	reg_p_cdpf_tps_test_center3_7_0_len 8
#define	reg_p_cdpf_tps_test_center3_7_0_lsb 0
#define xd_p_reg_p_cdpf_tps_test_center3_11_8	(*(volatile byte xdata *) 0xF6A3)
#define    p_reg_p_cdpf_tps_test_center3_11_8	0xF6A3 
#define	reg_p_cdpf_tps_test_center3_11_8_pos 0
#define	reg_p_cdpf_tps_test_center3_11_8_len 4
#define	reg_p_cdpf_tps_test_center3_11_8_lsb 8
#define xd_r_reg_r_cdpf_tps_test_result	(*(volatile byte xdata *) 0xF6A4)
#define    r_reg_r_cdpf_tps_test_result	0xF6A4 
#define	reg_r_cdpf_tps_test_result_pos 0
#define	reg_r_cdpf_tps_test_result_len 2
#define	reg_r_cdpf_tps_test_result_lsb 0
#define xd_r_reg_r_cdpf_srch_ready	(*(volatile byte xdata *) 0xF6A5)
#define    r_reg_r_cdpf_srch_ready	0xF6A5 
#define	reg_r_cdpf_srch_ready_pos 0
#define	reg_r_cdpf_srch_ready_len 1
#define	reg_r_cdpf_srch_ready_lsb 0
#define xd_p_reg_p_feq_cdpf_shift	(*(volatile byte xdata *) 0xF6A6)
#define    p_reg_p_feq_cdpf_shift	0xF6A6 
#define	reg_p_feq_cdpf_shift_pos 0
#define	reg_p_feq_cdpf_shift_len 3
#define	reg_p_feq_cdpf_shift_lsb 0
#define xd_p_reg_p_cdpf_tps_test_mask_start_symbol	(*(volatile byte xdata *) 0xF6A7)
#define    p_reg_p_cdpf_tps_test_mask_start_symbol	0xF6A7 
#define	reg_p_cdpf_tps_test_mask_start_symbol_pos 0
#define	reg_p_cdpf_tps_test_mask_start_symbol_len 7
#define	reg_p_cdpf_tps_test_mask_start_symbol_lsb 0
#define xd_p_reg_p_cdpf_tps_test_mask_end_symbol	(*(volatile byte xdata *) 0xF6A8)
#define    p_reg_p_cdpf_tps_test_mask_end_symbol	0xF6A8 
#define	reg_p_cdpf_tps_test_mask_end_symbol_pos 0
#define	reg_p_cdpf_tps_test_mask_end_symbol_len 7
#define	reg_p_cdpf_tps_test_mask_end_symbol_lsb 0
#define xd_g_reg_tpsd_txmod	(*(volatile byte xdata *) 0xF900)
#define    g_reg_tpsd_txmod	0xF900 
#define	reg_tpsd_txmod_pos 0
#define	reg_tpsd_txmod_len 2
#define	reg_tpsd_txmod_lsb 0
#define xd_g_reg_tpsd_gi	(*(volatile byte xdata *) 0xF901)
#define    g_reg_tpsd_gi	0xF901 
#define	reg_tpsd_gi_pos 0
#define	reg_tpsd_gi_len 2
#define	reg_tpsd_gi_lsb 0
#define xd_g_reg_tpsd_hier	(*(volatile byte xdata *) 0xF902)
#define    g_reg_tpsd_hier	0xF902 
#define	reg_tpsd_hier_pos 0
#define	reg_tpsd_hier_len 3
#define	reg_tpsd_hier_lsb 0
#define xd_g_reg_tpsd_const	(*(volatile byte xdata *) 0xF903)
#define    g_reg_tpsd_const	0xF903 
#define	reg_tpsd_const_pos 0
#define	reg_tpsd_const_len 2
#define	reg_tpsd_const_lsb 0
#define xd_g_reg_bw	(*(volatile byte xdata *) 0xF904)
#define    g_reg_bw	0xF904 
#define	reg_bw_pos 0
#define	reg_bw_len 2
#define	reg_bw_lsb 0
#define xd_g_reg_dec_pri	(*(volatile byte xdata *) 0xF905)
#define    g_reg_dec_pri	0xF905 
#define	reg_dec_pri_pos 0
#define	reg_dec_pri_len 1
#define	reg_dec_pri_lsb 0
#define xd_g_reg_tpsd_hpcr	(*(volatile byte xdata *) 0xF906)
#define    g_reg_tpsd_hpcr	0xF906 
#define	reg_tpsd_hpcr_pos 0
#define	reg_tpsd_hpcr_len 3
#define	reg_tpsd_hpcr_lsb 0
#define xd_g_reg_tpsd_lpcr	(*(volatile byte xdata *) 0xF907)
#define    g_reg_tpsd_lpcr	0xF907 
#define	reg_tpsd_lpcr_pos 0
#define	reg_tpsd_lpcr_len 3
#define	reg_tpsd_lpcr_lsb 0
#define xd_g_reg_tpsd_indep	(*(volatile byte xdata *) 0xF908)
#define    g_reg_tpsd_indep	0xF908 
#define	reg_tpsd_indep_pos 0
#define	reg_tpsd_indep_len 1
#define	reg_tpsd_indep_lsb 0
#define xd_g_reg_tpsd_tslice	(*(volatile byte xdata *) 0xF909)
#define    g_reg_tpsd_tslice	0xF909 
#define	reg_tpsd_tslice_pos 0
#define	reg_tpsd_tslice_len 1
#define	reg_tpsd_tslice_lsb 0
#define xd_g_reg_tpsd_mpefec	(*(volatile byte xdata *) 0xF90A)
#define    g_reg_tpsd_mpefec	0xF90A 
#define	reg_tpsd_mpefec_pos 0
#define	reg_tpsd_mpefec_len 1
#define	reg_tpsd_mpefec_lsb 0
#define xd_g_reg_sntc_en	(*(volatile byte xdata *) 0xF90B)
#define    g_reg_sntc_en	0xF90B 
#define	reg_sntc_en_pos 0
#define	reg_sntc_en_len 1
#define	reg_sntc_en_lsb 0
#define xd_g_reg_intp_sys_div	(*(volatile byte xdata *) 0xF90C)
#define    g_reg_intp_sys_div	0xF90C 
#define	reg_intp_sys_div_pos 0
#define	reg_intp_sys_div_len 1
#define	reg_intp_sys_div_lsb 0
#define xd_g_reg_clk_sntc_sel	(*(volatile byte xdata *) 0xF90D)
#define    g_reg_clk_sntc_sel	0xF90D 
#define	reg_clk_sntc_sel_pos 0
#define	reg_clk_sntc_sel_len 3
#define	reg_clk_sntc_sel_lsb 0
#define xd_p_reg_ce_gs_force	(*(volatile byte xdata *) 0xFD00)
#define    p_reg_ce_gs_force	0xFD00 
#define	reg_ce_gs_force_pos 0
#define	reg_ce_gs_force_len 1
#define	reg_ce_gs_force_lsb 0
#define xd_p_reg_ce_dagcgain_delay	(*(volatile byte xdata *) 0xFD01)
#define    p_reg_ce_dagcgain_delay	0xFD01 
#define	reg_ce_dagcgain_delay_pos 0
#define	reg_ce_dagcgain_delay_len 2
#define	reg_ce_dagcgain_delay_lsb 0
#define xd_p_reg_ce_derot_en	(*(volatile byte xdata *) 0xFD02)
#define    p_reg_ce_derot_en	0xFD02 
#define	reg_ce_derot_en_pos 0
#define	reg_ce_derot_en_len 1
#define	reg_ce_derot_en_lsb 0
#define xd_p_reg_ce_fctrl_en	(*(volatile byte xdata *) 0xFD05)
#define    p_reg_ce_fctrl_en	0xFD05 
#define	reg_ce_fctrl_en_pos 0
#define	reg_ce_fctrl_en_len 1
#define	reg_ce_fctrl_en_lsb 0
#define xd_p_reg_ce_en	(*(volatile byte xdata *) 0xFD06)
#define    p_reg_ce_en	0xFD06 
#define	reg_ce_en_pos 0
#define	reg_ce_en_len 1
#define	reg_ce_en_lsb 0
#define xd_p_reg_ce_sat_wes	(*(volatile byte xdata *) 0xFD07)
#define    p_reg_ce_sat_wes	0xFD07 
#define	reg_ce_sat_wes_pos 0
#define	reg_ce_sat_wes_len 1
#define	reg_ce_sat_wes_lsb 0
#define xd_p_reg_ce_sat_sigma2	(*(volatile byte xdata *) 0xFD08)
#define    p_reg_ce_sat_sigma2	0xFD08 
#define	reg_ce_sat_sigma2_pos 0
#define	reg_ce_sat_sigma2_len 1
#define	reg_ce_sat_sigma2_lsb 0
#define xd_p_reg_ce_sat_tdi_br_re	(*(volatile byte xdata *) 0xFD09)
#define    p_reg_ce_sat_tdi_br_re	0xFD09 
#define	reg_ce_sat_tdi_br_re_pos 0
#define	reg_ce_sat_tdi_br_re_len 1
#define	reg_ce_sat_tdi_br_re_lsb 0
#define xd_p_reg_ce_sat_tdi_br_im	(*(volatile byte xdata *) 0xFD0A)
#define    p_reg_ce_sat_tdi_br_im	0xFD0A 
#define	reg_ce_sat_tdi_br_im_pos 0
#define	reg_ce_sat_tdi_br_im_len 1
#define	reg_ce_sat_tdi_br_im_lsb 0
#define xd_p_reg_ce_sat_tdi_ar_re	(*(volatile byte xdata *) 0xFD0B)
#define    p_reg_ce_sat_tdi_ar_re	0xFD0B 
#define	reg_ce_sat_tdi_ar_re_pos 0
#define	reg_ce_sat_tdi_ar_re_len 1
#define	reg_ce_sat_tdi_ar_re_lsb 0
#define xd_p_reg_ce_sat_tdi_ar_im	(*(volatile byte xdata *) 0xFD0C)
#define    p_reg_ce_sat_tdi_ar_im	0xFD0C 
#define	reg_ce_sat_tdi_ar_im_pos 0
#define	reg_ce_sat_tdi_ar_im_len 1
#define	reg_ce_sat_tdi_ar_im_lsb 0
#define xd_p_reg_ce_sat_fdi_br_re	(*(volatile byte xdata *) 0xFD0D)
#define    p_reg_ce_sat_fdi_br_re	0xFD0D 
#define	reg_ce_sat_fdi_br_re_pos 0
#define	reg_ce_sat_fdi_br_re_len 1
#define	reg_ce_sat_fdi_br_re_lsb 0
#define xd_p_reg_ce_sat_fdi_br_im	(*(volatile byte xdata *) 0xFD0E)
#define    p_reg_ce_sat_fdi_br_im	0xFD0E 
#define	reg_ce_sat_fdi_br_im_pos 0
#define	reg_ce_sat_fdi_br_im_len 1
#define	reg_ce_sat_fdi_br_im_lsb 0
#define xd_p_reg_ce_var_forced_value	(*(volatile byte xdata *) 0xFD0F)
#define    p_reg_ce_var_forced_value	0xFD0F 
#define	reg_ce_var_forced_value_pos 0
#define	reg_ce_var_forced_value_len 3
#define	reg_ce_var_forced_value_lsb 0
#define xd_p_reg_ce_s1	(*(volatile byte xdata *) 0xFD10)
#define    p_reg_ce_s1	0xFD10 
#define	reg_ce_s1_pos 0
#define	reg_ce_s1_len 5
#define	reg_ce_s1_lsb 0
#define xd_r_reg_ce_tdi_flatness_7_0	(*(volatile byte xdata *) 0xFD11)
#define    r_reg_ce_tdi_flatness_7_0	0xFD11 
#define	reg_ce_tdi_flatness_7_0_pos 0
#define	reg_ce_tdi_flatness_7_0_len 8
#define	reg_ce_tdi_flatness_7_0_lsb 0
#define xd_r_reg_ce_tdi_flatness_8	(*(volatile byte xdata *) 0xFD12)
#define    r_reg_ce_tdi_flatness_8	0xFD12 
#define	reg_ce_tdi_flatness_8_pos 0
#define	reg_ce_tdi_flatness_8_len 1
#define	reg_ce_tdi_flatness_8_lsb 8
#define xd_r_reg_ce_tone_7_0	(*(volatile byte xdata *) 0xFD13)
#define    r_reg_ce_tone_7_0	0xFD13 
#define	reg_ce_tone_7_0_pos 0
#define	reg_ce_tone_7_0_len 8
#define	reg_ce_tone_7_0_lsb 0
#define xd_r_reg_ce_tone_12_8	(*(volatile byte xdata *) 0xFD14)
#define    r_reg_ce_tone_12_8	0xFD14 
#define	reg_ce_tone_12_8_pos 0
#define	reg_ce_tone_12_8_len 5
#define	reg_ce_tone_12_8_lsb 8
#define xd_p_reg_ce_centroid_drift_th	(*(volatile byte xdata *) 0xFD15)
#define    p_reg_ce_centroid_drift_th	0xFD15 
#define	reg_ce_centroid_drift_th_pos 0
#define	reg_ce_centroid_drift_th_len 8
#define	reg_ce_centroid_drift_th_lsb 0
#define xd_p_reg_ce_centroid_bias_inc_7_0	(*(volatile byte xdata *) 0xFD16)
#define    p_reg_ce_centroid_bias_inc_7_0	0xFD16 
#define	reg_ce_centroid_bias_inc_7_0_pos 0
#define	reg_ce_centroid_bias_inc_7_0_len 8
#define	reg_ce_centroid_bias_inc_7_0_lsb 0
#define xd_p_reg_ce_centroid_bias_inc_8	(*(volatile byte xdata *) 0xFD17)
#define    p_reg_ce_centroid_bias_inc_8	0xFD17 
#define	reg_ce_centroid_bias_inc_8_pos 0
#define	reg_ce_centroid_bias_inc_8_len 1
#define	reg_ce_centroid_bias_inc_8_lsb 8
#define xd_p_reg_ce_centroid_count_max	(*(volatile byte xdata *) 0xFD18)
#define    p_reg_ce_centroid_count_max	0xFD18 
#define	reg_ce_centroid_count_max_pos 0
#define	reg_ce_centroid_count_max_len 4
#define	reg_ce_centroid_count_max_lsb 0
#define xd_p_reg_ce_var_th0_7_0	(*(volatile byte xdata *) 0xFD19)
#define    p_reg_ce_var_th0_7_0	0xFD19 
#define	reg_ce_var_th0_7_0_pos 0
#define	reg_ce_var_th0_7_0_len 8
#define	reg_ce_var_th0_7_0_lsb 0
#define xd_p_reg_ce_var_th0_15_8	(*(volatile byte xdata *) 0xFD1A)
#define    p_reg_ce_var_th0_15_8	0xFD1A 
#define	reg_ce_var_th0_15_8_pos 0
#define	reg_ce_var_th0_15_8_len 8
#define	reg_ce_var_th0_15_8_lsb 8
#define xd_p_reg_ce_var_th1_7_0	(*(volatile byte xdata *) 0xFD1B)
#define    p_reg_ce_var_th1_7_0	0xFD1B 
#define	reg_ce_var_th1_7_0_pos 0
#define	reg_ce_var_th1_7_0_len 8
#define	reg_ce_var_th1_7_0_lsb 0
#define xd_p_reg_ce_var_th1_15_8	(*(volatile byte xdata *) 0xFD1C)
#define    p_reg_ce_var_th1_15_8	0xFD1C 
#define	reg_ce_var_th1_15_8_pos 0
#define	reg_ce_var_th1_15_8_len 8
#define	reg_ce_var_th1_15_8_lsb 8
#define xd_p_reg_ce_var_th2_7_0	(*(volatile byte xdata *) 0xFD1D)
#define    p_reg_ce_var_th2_7_0	0xFD1D 
#define	reg_ce_var_th2_7_0_pos 0
#define	reg_ce_var_th2_7_0_len 8
#define	reg_ce_var_th2_7_0_lsb 0
#define xd_p_reg_ce_var_th2_15_8	(*(volatile byte xdata *) 0xFD1E)
#define    p_reg_ce_var_th2_15_8	0xFD1E 
#define	reg_ce_var_th2_15_8_pos 0
#define	reg_ce_var_th2_15_8_len 8
#define	reg_ce_var_th2_15_8_lsb 8
#define xd_p_reg_ce_var_th3_7_0	(*(volatile byte xdata *) 0xFD1F)
#define    p_reg_ce_var_th3_7_0	0xFD1F 
#define	reg_ce_var_th3_7_0_pos 0
#define	reg_ce_var_th3_7_0_len 8
#define	reg_ce_var_th3_7_0_lsb 0
#define xd_p_reg_ce_var_th3_15_8	(*(volatile byte xdata *) 0xFD20)
#define    p_reg_ce_var_th3_15_8	0xFD20 
#define	reg_ce_var_th3_15_8_pos 0
#define	reg_ce_var_th3_15_8_len 8
#define	reg_ce_var_th3_15_8_lsb 8
#define xd_p_reg_ce_var_th4_7_0	(*(volatile byte xdata *) 0xFD21)
#define    p_reg_ce_var_th4_7_0	0xFD21 
#define	reg_ce_var_th4_7_0_pos 0
#define	reg_ce_var_th4_7_0_len 8
#define	reg_ce_var_th4_7_0_lsb 0
#define xd_p_reg_ce_var_th4_15_8	(*(volatile byte xdata *) 0xFD22)
#define    p_reg_ce_var_th4_15_8	0xFD22 
#define	reg_ce_var_th4_15_8_pos 0
#define	reg_ce_var_th4_15_8_len 8
#define	reg_ce_var_th4_15_8_lsb 8
#define xd_p_reg_ce_var_th5_7_0	(*(volatile byte xdata *) 0xFD23)
#define    p_reg_ce_var_th5_7_0	0xFD23 
#define	reg_ce_var_th5_7_0_pos 0
#define	reg_ce_var_th5_7_0_len 8
#define	reg_ce_var_th5_7_0_lsb 0
#define xd_p_reg_ce_var_th5_15_8	(*(volatile byte xdata *) 0xFD24)
#define    p_reg_ce_var_th5_15_8	0xFD24 
#define	reg_ce_var_th5_15_8_pos 0
#define	reg_ce_var_th5_15_8_len 8
#define	reg_ce_var_th5_15_8_lsb 8
#define xd_p_reg_ce_var_th6_7_0	(*(volatile byte xdata *) 0xFD25)
#define    p_reg_ce_var_th6_7_0	0xFD25 
#define	reg_ce_var_th6_7_0_pos 0
#define	reg_ce_var_th6_7_0_len 8
#define	reg_ce_var_th6_7_0_lsb 0
#define xd_p_reg_ce_var_th6_15_8	(*(volatile byte xdata *) 0xFD26)
#define    p_reg_ce_var_th6_15_8	0xFD26 
#define	reg_ce_var_th6_15_8_pos 0
#define	reg_ce_var_th6_15_8_len 8
#define	reg_ce_var_th6_15_8_lsb 8
#define xd_p_reg_ce_var_max	(*(volatile byte xdata *) 0xFD27)
#define    p_reg_ce_var_max	0xFD27 
#define	reg_ce_var_max_pos 0
#define	reg_ce_var_max_len 3
#define	reg_ce_var_max_lsb 0
#define xd_p_reg_ce_cent_forced_en	(*(volatile byte xdata *) 0xFD28)
#define    p_reg_ce_cent_forced_en	0xFD28 
#define	reg_ce_cent_forced_en_pos 0
#define	reg_ce_cent_forced_en_len 1
#define	reg_ce_cent_forced_en_lsb 0
#define xd_p_reg_ce_var_forced_en	(*(volatile byte xdata *) 0xFD29)
#define    p_reg_ce_var_forced_en	0xFD29 
#define	reg_ce_var_forced_en_pos 0
#define	reg_ce_var_forced_en_len 1
#define	reg_ce_var_forced_en_lsb 0
#define xd_p_reg_ce_fctrl_auto_reset_en	(*(volatile byte xdata *) 0xFD2A)
#define    p_reg_ce_fctrl_auto_reset_en	0xFD2A 
#define	reg_ce_fctrl_auto_reset_en_pos 0
#define	reg_ce_fctrl_auto_reset_en_len 1
#define	reg_ce_fctrl_auto_reset_en_lsb 0
#define xd_p_reg_ce_cent_auto_clr_en	(*(volatile byte xdata *) 0xFD2B)
#define    p_reg_ce_cent_auto_clr_en	0xFD2B 
#define	reg_ce_cent_auto_clr_en_pos 0
#define	reg_ce_cent_auto_clr_en_len 1
#define	reg_ce_cent_auto_clr_en_lsb 0
#define xd_p_reg_ce_fctrl_reset	(*(volatile byte xdata *) 0xFD2C)
#define    p_reg_ce_fctrl_reset	0xFD2C 
#define	reg_ce_fctrl_reset_pos 0
#define	reg_ce_fctrl_reset_len 1
#define	reg_ce_fctrl_reset_lsb 0
#define xd_p_reg_ce_cent_forced_value_7_0	(*(volatile byte xdata *) 0xFD2D)
#define    p_reg_ce_cent_forced_value_7_0	0xFD2D 
#define	reg_ce_cent_forced_value_7_0_pos 0
#define	reg_ce_cent_forced_value_7_0_len 8
#define	reg_ce_cent_forced_value_7_0_lsb 0
#define xd_p_reg_ce_cent_forced_value_11_8	(*(volatile byte xdata *) 0xFD2E)
#define    p_reg_ce_cent_forced_value_11_8	0xFD2E 
#define	reg_ce_cent_forced_value_11_8_pos 0
#define	reg_ce_cent_forced_value_11_8_len 4
