liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_ce_cent_forced_value_11_8_lsb 8
#define xd_p_reg_ce_cent_auto_clr_value_7_0	(*(volatile byte xdata *) 0xFD2F)
#define    p_reg_ce_cent_auto_clr_value_7_0	0xFD2F 
#define	reg_ce_cent_auto_clr_value_7_0_pos 0
#define	reg_ce_cent_auto_clr_value_7_0_len 8
#define	reg_ce_cent_auto_clr_value_7_0_lsb 0
#define xd_p_reg_ce_cent_auto_clr_value_11_8	(*(volatile byte xdata *) 0xFD30)
#define    p_reg_ce_cent_auto_clr_value_11_8	0xFD30 
#define	reg_ce_cent_auto_clr_value_11_8_pos 0
#define	reg_ce_cent_auto_clr_value_11_8_len 4
#define	reg_ce_cent_auto_clr_value_11_8_lsb 8
#define xd_p_reg_ce_centroid_max_7_0	(*(volatile byte xdata *) 0xFD31)
#define    p_reg_ce_centroid_max_7_0	0xFD31 
#define	reg_ce_centroid_max_7_0_pos 0
#define	reg_ce_centroid_max_7_0_len 8
#define	reg_ce_centroid_max_7_0_lsb 0
#define xd_p_reg_ce_centroid_max_11_8	(*(volatile byte xdata *) 0xFD32)
#define    p_reg_ce_centroid_max_11_8	0xFD32 
#define	reg_ce_centroid_max_11_8_pos 0
#define	reg_ce_centroid_max_11_8_len 4
#define	reg_ce_centroid_max_11_8_lsb 8
#define xd_p_reg_ce_fctrl_rd	(*(volatile byte xdata *) 0xFD33)
#define    p_reg_ce_fctrl_rd	0xFD33 
#define	reg_ce_fctrl_rd_pos 0
#define	reg_ce_fctrl_rd_len 1
#define	reg_ce_fctrl_rd_lsb 0
#define xd_r_reg_ce_centroid_out_7_0	(*(volatile byte xdata *) 0xFD34)
#define    r_reg_ce_centroid_out_7_0	0xFD34 
#define	reg_ce_centroid_out_7_0_pos 0
#define	reg_ce_centroid_out_7_0_len 8
#define	reg_ce_centroid_out_7_0_lsb 0
#define xd_r_reg_ce_centroid_out_11_8	(*(volatile byte xdata *) 0xFD35)
#define    r_reg_ce_centroid_out_11_8	0xFD35 
#define	reg_ce_centroid_out_11_8_pos 0
#define	reg_ce_centroid_out_11_8_len 4
#define	reg_ce_centroid_out_11_8_lsb 8
#define xd_r_reg_ce_fctrl_rdy	(*(volatile byte xdata *) 0xFD36)
#define    r_reg_ce_fctrl_rdy	0xFD36 
#define	reg_ce_fctrl_rdy_pos 0
#define	reg_ce_fctrl_rdy_len 1
#define	reg_ce_fctrl_rdy_lsb 0
#define xd_r_reg_ce_var	(*(volatile byte xdata *) 0xFD37)
#define    r_reg_ce_var	0xFD37 
#define	reg_ce_var_pos 0
#define	reg_ce_var_len 3
#define	reg_ce_var_lsb 0
#define xd_r_reg_ce_bias_7_0	(*(volatile byte xdata *) 0xFD38)
#define    r_reg_ce_bias_7_0	0xFD38 
#define	reg_ce_bias_7_0_pos 0
#define	reg_ce_bias_7_0_len 8
#define	reg_ce_bias_7_0_lsb 0
#define xd_r_reg_ce_bias_11_8	(*(volatile byte xdata *) 0xFD39)
#define    r_reg_ce_bias_11_8	0xFD39 
#define	reg_ce_bias_11_8_pos 0
#define	reg_ce_bias_11_8_len 4
#define	reg_ce_bias_11_8_lsb 8
#define xd_r_reg_ce_m1_7_0	(*(volatile byte xdata *) 0xFD3A)
#define    r_reg_ce_m1_7_0	0xFD3A 
#define	reg_ce_m1_7_0_pos 0
#define	reg_ce_m1_7_0_len 8
#define	reg_ce_m1_7_0_lsb 0
#define xd_r_reg_ce_m1_11_8	(*(volatile byte xdata *) 0xFD3B)
#define    r_reg_ce_m1_11_8	0xFD3B 
#define	reg_ce_m1_11_8_pos 0
#define	reg_ce_m1_11_8_len 4
#define	reg_ce_m1_11_8_lsb 8
#define xd_r_reg_ce_rh0_7_0	(*(volatile byte xdata *) 0xFD3C)
#define    r_reg_ce_rh0_7_0	0xFD3C 
#define	reg_ce_rh0_7_0_pos 0
#define	reg_ce_rh0_7_0_len 8
#define	reg_ce_rh0_7_0_lsb 0
#define xd_r_reg_ce_rh0_15_8	(*(volatile byte xdata *) 0xFD3D)
#define    r_reg_ce_rh0_15_8	0xFD3D 
#define	reg_ce_rh0_15_8_pos 0
#define	reg_ce_rh0_15_8_len 8
#define	reg_ce_rh0_15_8_lsb 8
#define xd_r_reg_ce_rh0_23_16	(*(volatile byte xdata *) 0xFD3E)
#define    r_reg_ce_rh0_23_16	0xFD3E 
#define	reg_ce_rh0_23_16_pos 0
#define	reg_ce_rh0_23_16_len 8
#define	reg_ce_rh0_23_16_lsb 16
#define xd_r_reg_ce_rh0_31_24	(*(volatile byte xdata *) 0xFD3F)
#define    r_reg_ce_rh0_31_24	0xFD3F 
#define	reg_ce_rh0_31_24_pos 0
#define	reg_ce_rh0_31_24_len 8
#define	reg_ce_rh0_31_24_lsb 24
#define xd_p_reg_ce_tdi_delta	(*(volatile byte xdata *) 0xFD40)
#define    p_reg_ce_tdi_delta	0xFD40 
#define	reg_ce_tdi_delta_pos 0
#define	reg_ce_tdi_delta_len 3
#define	reg_ce_tdi_delta_lsb 0
#define xd_p_reg_ce_fdi_delta	(*(volatile byte xdata *) 0xFD41)
#define    p_reg_ce_fdi_delta	0xFD41 
#define	reg_ce_fdi_delta_pos 0
#define	reg_ce_fdi_delta_len 3
#define	reg_ce_fdi_delta_lsb 0
#define xd_p_reg_ce_fste_delta	(*(volatile byte xdata *) 0xFD42)
#define    p_reg_ce_fste_delta	0xFD42 
#define	reg_ce_fste_delta_pos 0
#define	reg_ce_fste_delta_len 3
#define	reg_ce_fste_delta_lsb 0
#define xd_r_reg_ce_fft_s1	(*(volatile byte xdata *) 0xFD43)
#define    r_reg_ce_fft_s1	0xFD43 
#define	reg_ce_fft_s1_pos 0
#define	reg_ce_fft_s1_len 4
#define	reg_ce_fft_s1_lsb 0
#define xd_r_reg_feq_fix_eh2_7_0	(*(volatile byte xdata *) 0xFD44)
#define    r_reg_feq_fix_eh2_7_0	0xFD44 
#define	reg_feq_fix_eh2_7_0_pos 0
#define	reg_feq_fix_eh2_7_0_len 8
#define	reg_feq_fix_eh2_7_0_lsb 0
#define xd_r_reg_feq_fix_eh2_15_8	(*(volatile byte xdata *) 0xFD45)
#define    r_reg_feq_fix_eh2_15_8	0xFD45 
#define	reg_feq_fix_eh2_15_8_pos 0
#define	reg_feq_fix_eh2_15_8_len 8
#define	reg_feq_fix_eh2_15_8_lsb 8
#define xd_r_reg_feq_fix_eh2_23_16	(*(volatile byte xdata *) 0xFD46)
#define    r_reg_feq_fix_eh2_23_16	0xFD46 
#define	reg_feq_fix_eh2_23_16_pos 0
#define	reg_feq_fix_eh2_23_16_len 8
#define	reg_feq_fix_eh2_23_16_lsb 16
#define xd_r_reg_feq_fix_eh2_31_24	(*(volatile byte xdata *) 0xFD47)
#define    r_reg_feq_fix_eh2_31_24	0xFD47 
#define	reg_feq_fix_eh2_31_24_pos 0
#define	reg_feq_fix_eh2_31_24_len 8
#define	reg_feq_fix_eh2_31_24_lsb 24
#define xd_r_reg_ce_m2_central_7_0	(*(volatile byte xdata *) 0xFD48)
#define    r_reg_ce_m2_central_7_0	0xFD48 
#define	reg_ce_m2_central_7_0_pos 0
#define	reg_ce_m2_central_7_0_len 8
#define	reg_ce_m2_central_7_0_lsb 0
#define xd_r_reg_ce_m2_central_15_8	(*(volatile byte xdata *) 0xFD49)
#define    r_reg_ce_m2_central_15_8	0xFD49 
#define	reg_ce_m2_central_15_8_pos 0
#define	reg_ce_m2_central_15_8_len 8
#define	reg_ce_m2_central_15_8_lsb 8
#define xd_r_reg_ce_sigma2_7_0	(*(volatile byte xdata *) 0xFD4A)
#define    r_reg_ce_sigma2_7_0	0xFD4A 
#define	reg_ce_sigma2_7_0_pos 0
#define	reg_ce_sigma2_7_0_len 8
#define	reg_ce_sigma2_7_0_lsb 0
#define xd_r_reg_ce_sigma2_15_8	(*(volatile byte xdata *) 0xFD4B)
#define    r_reg_ce_sigma2_15_8	0xFD4B 
#define	reg_ce_sigma2_15_8_pos 0
#define	reg_ce_sigma2_15_8_len 8
#define	reg_ce_sigma2_15_8_lsb 8
#define xd_r_reg_ce_sigma2_19_16	(*(volatile byte xdata *) 0xFD4C)
#define    r_reg_ce_sigma2_19_16	0xFD4C 
#define	reg_ce_sigma2_19_16_pos 0
#define	reg_ce_sigma2_19_16_len 4
#define	reg_ce_sigma2_19_16_lsb 16
#define xd_r_reg_ce_data_im_7_0	(*(volatile byte xdata *) 0xFD4D)
#define    r_reg_ce_data_im_7_0	0xFD4D 
#define	reg_ce_data_im_7_0_pos 0
#define	reg_ce_data_im_7_0_len 8
#define	reg_ce_data_im_7_0_lsb 0
#define xd_r_reg_ce_data_im_14_8	(*(volatile byte xdata *) 0xFD4E)
#define    r_reg_ce_data_im_14_8	0xFD4E 
#define	reg_ce_data_im_14_8_pos 0
#define	reg_ce_data_im_14_8_len 7
#define	reg_ce_data_im_14_8_lsb 8
#define xd_r_reg_ce_data_re_7_0	(*(volatile byte xdata *) 0xFD4F)
#define    r_reg_ce_data_re_7_0	0xFD4F 
#define	reg_ce_data_re_7_0_pos 0
#define	reg_ce_data_re_7_0_len 8
#define	reg_ce_data_re_7_0_lsb 0
#define xd_r_reg_ce_data_re_14_8	(*(volatile byte xdata *) 0xFD50)
#define    r_reg_ce_data_re_14_8	0xFD50 
#define	reg_ce_data_re_14_8_pos 0
#define	reg_ce_data_re_14_8_len 7
#define	reg_ce_data_re_14_8_lsb 8
#define xd_p_reg_ce_var_default_value	(*(volatile byte xdata *) 0xFD51)
#define    p_reg_ce_var_default_value	0xFD51 
#define	reg_ce_var_default_value_pos 0
#define	reg_ce_var_default_value_len 3
#define	reg_ce_var_default_value_lsb 0
#define xd_p_reg_ce_cent_default_value_7_0	(*(volatile byte xdata *) 0xFD52)
#define    p_reg_ce_cent_default_value_7_0	0xFD52 
#define	reg_ce_cent_default_value_7_0_pos 0
#define	reg_ce_cent_default_value_7_0_len 8
#define	reg_ce_cent_default_value_7_0_lsb 0
#define xd_p_reg_ce_cent_default_value_11_8	(*(volatile byte xdata *) 0xFD53)
#define    p_reg_ce_cent_default_value_11_8	0xFD53 
#define	reg_ce_cent_default_value_11_8_pos 0
#define	reg_ce_cent_default_value_11_8_len 4
#define	reg_ce_cent_default_value_11_8_lsb 8
#define xd_r_reg_ce_var_hw	(*(volatile byte xdata *) 0xFD54)
#define    r_reg_ce_var_hw	0xFD54 
#define	reg_ce_var_hw_pos 0
#define	reg_ce_var_hw_len 3
#define	reg_ce_var_hw_lsb 0
#define xd_r_reg_ce_cent_hw_7_0	(*(volatile byte xdata *) 0xFD55)
#define    r_reg_ce_cent_hw_7_0	0xFD55 
#define	reg_ce_cent_hw_7_0_pos 0
#define	reg_ce_cent_hw_7_0_len 8
#define	reg_ce_cent_hw_7_0_lsb 0
#define xd_r_reg_ce_cent_hw_11_8	(*(volatile byte xdata *) 0xFD56)
#define    r_reg_ce_cent_hw_11_8	0xFD56 
#define	reg_ce_cent_hw_11_8_pos 0
#define	reg_ce_cent_hw_11_8_len 4
#define	reg_ce_cent_hw_11_8_lsb 8
#define xd_p_reg_ce_fdi_cp_test_en	(*(volatile byte xdata *) 0xFD57)
#define    p_reg_ce_fdi_cp_test_en	0xFD57 
#define	reg_ce_fdi_cp_test_en_pos 0
#define	reg_ce_fdi_cp_test_en_len 1
#define	reg_ce_fdi_cp_test_en_lsb 0
#define xd_p_reg_ce_cptestindex0_7_0	(*(volatile byte xdata *) 0xFD58)
#define    p_reg_ce_cptestindex0_7_0	0xFD58 
#define	reg_ce_cptestindex0_7_0_pos 0
#define	reg_ce_cptestindex0_7_0_len 8
#define	reg_ce_cptestindex0_7_0_lsb 0
#define xd_p_reg_ce_cptestindex0_12_8	(*(volatile byte xdata *) 0xFD59)
#define    p_reg_ce_cptestindex0_12_8	0xFD59 
#define	reg_ce_cptestindex0_12_8_pos 0
#define	reg_ce_cptestindex0_12_8_len 5
#define	reg_ce_cptestindex0_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi0	(*(volatile byte xdata *) 0xFD5A)
#define    p_reg_ce_cptestfdi0	0xFD5A 
#define	reg_ce_cptestfdi0_pos 0
#define	reg_ce_cptestfdi0_len 3
#define	reg_ce_cptestfdi0_lsb 0
#define xd_p_reg_ce_cptestindex1_7_0	(*(volatile byte xdata *) 0xFD5B)
#define    p_reg_ce_cptestindex1_7_0	0xFD5B 
#define	reg_ce_cptestindex1_7_0_pos 0
#define	reg_ce_cptestindex1_7_0_len 8
#define	reg_ce_cptestindex1_7_0_lsb 0
#define xd_p_reg_ce_cptestindex1_12_8	(*(volatile byte xdata *) 0xFD5C)
#define    p_reg_ce_cptestindex1_12_8	0xFD5C 
#define	reg_ce_cptestindex1_12_8_pos 0
#define	reg_ce_cptestindex1_12_8_len 5
#define	reg_ce_cptestindex1_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi1	(*(volatile byte xdata *) 0xFD5D)
#define    p_reg_ce_cptestfdi1	0xFD5D 
#define	reg_ce_cptestfdi1_pos 0
#define	reg_ce_cptestfdi1_len 3
#define	reg_ce_cptestfdi1_lsb 0
#define xd_p_reg_ce_cptestindex2_7_0	(*(volatile byte xdata *) 0xFD5E)
#define    p_reg_ce_cptestindex2_7_0	0xFD5E 
#define	reg_ce_cptestindex2_7_0_pos 0
#define	reg_ce_cptestindex2_7_0_len 8
#define	reg_ce_cptestindex2_7_0_lsb 0
#define xd_p_reg_ce_cptestindex2_12_8	(*(volatile byte xdata *) 0xFD5F)
#define    p_reg_ce_cptestindex2_12_8	0xFD5F 
#define	reg_ce_cptestindex2_12_8_pos 0
#define	reg_ce_cptestindex2_12_8_len 5
#define	reg_ce_cptestindex2_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi2	(*(volatile byte xdata *) 0xFD60)
#define    p_reg_ce_cptestfdi2	0xFD60 
#define	reg_ce_cptestfdi2_pos 0
#define	reg_ce_cptestfdi2_len 3
#define	reg_ce_cptestfdi2_lsb 0
#define xd_p_reg_ce_cptestindex3_7_0	(*(volatile byte xdata *) 0xFD61)
#define    p_reg_ce_cptestindex3_7_0	0xFD61 
#define	reg_ce_cptestindex3_7_0_pos 0
#define	reg_ce_cptestindex3_7_0_len 8
#define	reg_ce_cptestindex3_7_0_lsb 0
#define xd_p_reg_ce_cptestindex3_12_8	(*(volatile byte xdata *) 0xFD62)
#define    p_reg_ce_cptestindex3_12_8	0xFD62 
#define	reg_ce_cptestindex3_12_8_pos 0
#define	reg_ce_cptestindex3_12_8_len 5
#define	reg_ce_cptestindex3_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi3	(*(volatile byte xdata *) 0xFD63)
#define    p_reg_ce_cptestfdi3	0xFD63 
#define	reg_ce_cptestfdi3_pos 0
#define	reg_ce_cptestfdi3_len 3
#define	reg_ce_cptestfdi3_lsb 0
#define xd_p_reg_ce_cptestindex4_7_0	(*(volatile byte xdata *) 0xFD64)
#define    p_reg_ce_cptestindex4_7_0	0xFD64 
#define	reg_ce_cptestindex4_7_0_pos 0
#define	reg_ce_cptestindex4_7_0_len 8
#define	reg_ce_cptestindex4_7_0_lsb 0
#define xd_p_reg_ce_cptestindex4_12_8	(*(volatile byte xdata *) 0xFD65)
#define    p_reg_ce_cptestindex4_12_8	0xFD65 
#define	reg_ce_cptestindex4_12_8_pos 0
#define	reg_ce_cptestindex4_12_8_len 5
#define	reg_ce_cptestindex4_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi4	(*(volatile byte xdata *) 0xFD66)
#define    p_reg_ce_cptestfdi4	0xFD66 
#define	reg_ce_cptestfdi4_pos 0
#define	reg_ce_cptestfdi4_len 3
#define	reg_ce_cptestfdi4_lsb 0
#define xd_p_reg_ce_cptestindex5_7_0	(*(volatile byte xdata *) 0xFD67)
#define    p_reg_ce_cptestindex5_7_0	0xFD67 
#define	reg_ce_cptestindex5_7_0_pos 0
#define	reg_ce_cptestindex5_7_0_len 8
#define	reg_ce_cptestindex5_7_0_lsb 0
#define xd_p_reg_ce_cptestindex5_12_8	(*(volatile byte xdata *) 0xFD68)
#define    p_reg_ce_cptestindex5_12_8	0xFD68 
#define	reg_ce_cptestindex5_12_8_pos 0
#define	reg_ce_cptestindex5_12_8_len 5
#define	reg_ce_cptestindex5_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi5	(*(volatile byte xdata *) 0xFD69)
#define    p_reg_ce_cptestfdi5	0xFD69 
#define	reg_ce_cptestfdi5_pos 0
#define	reg_ce_cptestfdi5_len 3
#define	reg_ce_cptestfdi5_lsb 0
#define xd_p_reg_ce_cptestindex6_7_0	(*(volatile byte xdata *) 0xFD6A)
#define    p_reg_ce_cptestindex6_7_0	0xFD6A 
#define	reg_ce_cptestindex6_7_0_pos 0
#define	reg_ce_cptestindex6_7_0_len 8
#define	reg_ce_cptestindex6_7_0_lsb 0
#define xd_p_reg_ce_cptestindex6_12_8	(*(volatile byte xdata *) 0xFD6B)
#define    p_reg_ce_cptestindex6_12_8	0xFD6B 
#define	reg_ce_cptestindex6_12_8_pos 0
#define	reg_ce_cptestindex6_12_8_len 5
#define	reg_ce_cptestindex6_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi6	(*(volatile byte xdata *) 0xFD6C)
#define    p_reg_ce_cptestfdi6	0xFD6C 
#define	reg_ce_cptestfdi6_pos 0
#define	reg_ce_cptestfdi6_len 3
#define	reg_ce_cptestfdi6_lsb 0
#define xd_p_reg_ce_cptestindex7_7_0	(*(volatile byte xdata *) 0xFD6D)
#define    p_reg_ce_cptestindex7_7_0	0xFD6D 
#define	reg_ce_cptestindex7_7_0_pos 0
#define	reg_ce_cptestindex7_7_0_len 8
#define	reg_ce_cptestindex7_7_0_lsb 0
#define xd_p_reg_ce_cptestindex7_12_8	(*(volatile byte xdata *) 0xFD6E)
#define    p_reg_ce_cptestindex7_12_8	0xFD6E 
#define	reg_ce_cptestindex7_12_8_pos 0
#define	reg_ce_cptestindex7_12_8_len 5
#define	reg_ce_cptestindex7_12_8_lsb 8
#define xd_p_reg_ce_cptestfdi7	(*(volatile byte xdata *) 0xFD6F)
#define    p_reg_ce_cptestfdi7	0xFD6F 
#define	reg_ce_cptestfdi7_pos 0
#define	reg_ce_cptestfdi7_len 3
#define	reg_ce_cptestfdi7_lsb 0
#define xd_p_reg_ce_cp_replace_tdiout_en	(*(volatile byte xdata *) 0xFD74)
#define    p_reg_ce_cp_replace_tdiout_en	0xFD74 
#define	reg_ce_cp_replace_tdiout_en_pos 0
#define	reg_ce_cp_replace_tdiout_en_len 1
#define	reg_ce_cp_replace_tdiout_en_lsb 0
#define xd_p_reg_ce_tdi_mask0_en	(*(volatile byte xdata *) 0xFD7D)
#define    p_reg_ce_tdi_mask0_en	0xFD7D 
#define	reg_ce_tdi_mask0_en_pos 0
#define	reg_ce_tdi_mask0_en_len 1
#define	reg_ce_tdi_mask0_en_lsb 0
#define xd_p_reg_ce_tdi_mask_from0_7_0	(*(volatile byte xdata *) 0xFD7E)
#define    p_reg_ce_tdi_mask_from0_7_0	0xFD7E 
#define	reg_ce_tdi_mask_from0_7_0_pos 0
#define	reg_ce_tdi_mask_from0_7_0_len 8
#define	reg_ce_tdi_mask_from0_7_0_lsb 0
#define xd_p_reg_ce_tdi_mask_from0_12_8	(*(volatile byte xdata *) 0xFD7F)
#define    p_reg_ce_tdi_mask_from0_12_8	0xFD7F 
#define	reg_ce_tdi_mask_from0_12_8_pos 0
#define	reg_ce_tdi_mask_from0_12_8_len 5
#define	reg_ce_tdi_mask_from0_12_8_lsb 8
#define xd_p_reg_ce_tdi_mask_to0_7_0	(*(volatile byte xdata *) 0xFD80)
#define    p_reg_ce_tdi_mask_to0_7_0	0xFD80 
#define	reg_ce_tdi_mask_to0_7_0_pos 0
#define	reg_ce_tdi_mask_to0_7_0_len 8
#define	reg_ce_tdi_mask_to0_7_0_lsb 0
#define xd_p_reg_ce_tdi_mask_to0_12_8	(*(volatile byte xdata *) 0xFD81)
#define    p_reg_ce_tdi_mask_to0_12_8	0xFD81 
#define	reg_ce_tdi_mask_to0_12_8_pos 0
#define	reg_ce_tdi_mask_to0_12_8_len 5
#define	reg_ce_tdi_mask_to0_12_8_lsb 8
#define xd_p_reg_ce_tdi_mask1_en	(*(volatile byte xdata *) 0xFD82)
#define    p_reg_ce_tdi_mask1_en	0xFD82 
#define	reg_ce_tdi_mask1_en_pos 0
#define	reg_ce_tdi_mask1_en_len 1
#define	reg_ce_tdi_mask1_en_lsb 0
#define xd_p_reg_ce_tdi_mask_from1_7_0	(*(volatile byte xdata *) 0xFD83)
#define    p_reg_ce_tdi_mask_from1_7_0	0xFD83 
#define	reg_ce_tdi_mask_from1_7_0_pos 0
#define	reg_ce_tdi_mask_from1_7_0_len 8
#define	reg_ce_tdi_mask_from1_7_0_lsb 0
#define xd_p_reg_ce_tdi_mask_from1_12_8	(*(volatile byte xdata *) 0xFD84)
#define    p_reg_ce_tdi_mask_from1_12_8	0xFD84 
#define	reg_ce_tdi_mask_from1_12_8_pos 0
#define	reg_ce_tdi_mask_from1_12_8_len 5
#define	reg_ce_tdi_mask_from1_12_8_lsb 8
#define xd_p_reg_ce_tdi_mask_to1_7_0	(*(volatile byte xdata *) 0xFD85)
#define    p_reg_ce_tdi_mask_to1_7_0	0xFD85 
#define	reg_ce_tdi_mask_to1_7_0_pos 0
#define	reg_ce_tdi_mask_to1_7_0_len 8
#define	reg_ce_tdi_mask_to1_7_0_lsb 0
#define xd_p_reg_ce_tdi_mask_to1_12_8	(*(volatile byte xdata *) 0xFD86)
#define    p_reg_ce_tdi_mask_to1_12_8	0xFD86 
#define	reg_ce_tdi_mask_to1_12_8_pos 0
#define	reg_ce_tdi_mask_to1_12_8_len 5
#define	reg_ce_tdi_mask_to1_12_8_lsb 8
#define xd_p_reg_ce_2nd_var_max	(*(volatile byte xdata *) 0xFD87)
#define    p_reg_ce_2nd_var_max	0xFD87 
#define	reg_ce_2nd_var_max_pos 0
#define	reg_ce_2nd_var_max_len 3
#define	reg_ce_2nd_var_max_lsb 0
#define xd_p_reg_ce_2nd_cent_forced_en	(*(volatile byte xdata *) 0xFD88)
#define    p_reg_ce_2nd_cent_forced_en	0xFD88 
#define	reg_ce_2nd_cent_forced_en_pos 0
#define	reg_ce_2nd_cent_forced_en_len 1
#define	reg_ce_2nd_cent_forced_en_lsb 0
#define xd_p_reg_ce_2nd_var_forced_en	(*(volatile byte xdata *) 0xFD89)
#define    p_reg_ce_2nd_var_forced_en	0xFD89 
#define	reg_ce_2nd_var_forced_en_pos 0
#define	reg_ce_2nd_var_forced_en_len 1
#define	reg_ce_2nd_var_forced_en_lsb 0
#define xd_p_reg_ce_2nd_fctrl_auto_reset_en	(*(volatile byte xdata *) 0xFD8A)
#define    p_reg_ce_2nd_fctrl_auto_reset_en	0xFD8A 
#define	reg_ce_2nd_fctrl_auto_reset_en_pos 0
#define	reg_ce_2nd_fctrl_auto_reset_en_len 1
#define	reg_ce_2nd_fctrl_auto_reset_en_lsb 0
#define xd_p_reg_ce_2nd_cent_auto_clr_en	(*(volatile byte xdata *) 0xFD8B)
#define    p_reg_ce_2nd_cent_auto_clr_en	0xFD8B 
#define	reg_ce_2nd_cent_auto_clr_en_pos 0
#define	reg_ce_2nd_cent_auto_clr_en_len 1
#define	reg_ce_2nd_cent_auto_clr_en_lsb 0
#define xd_p_reg_ce_2nd_cent_forced_value_7_0	(*(volatile byte xdata *) 0xFD8C)
#define    p_reg_ce_2nd_cent_forced_value_7_0	0xFD8C 
#define	reg_ce_2nd_cent_forced_value_7_0_pos 0
#define	reg_ce_2nd_cent_forced_value_7_0_len 8
#define	reg_ce_2nd_cent_forced_value_7_0_lsb 0
#define xd_p_reg_ce_2nd_cent_forced_value_11_8	(*(volatile byte xdata *) 0xFD8D)
#define    p_reg_ce_2nd_cent_forced_value_11_8	0xFD8D 
#define	reg_ce_2nd_cent_forced_value_11_8_pos 0
#define	reg_ce_2nd_cent_forced_value_11_8_len 4
#define	reg_ce_2nd_cent_forced_value_11_8_lsb 8
#define xd_p_reg_ce_2nd_cent_auto_clr_value_7_0	(*(volatile byte xdata *) 0xFD8E)
#define    p_reg_ce_2nd_cent_auto_clr_value_7_0	0xFD8E 
#define	reg_ce_2nd_cent_auto_clr_value_7_0_pos 0
#define	reg_ce_2nd_cent_auto_clr_value_7_0_len 8
#define	reg_ce_2nd_cent_auto_clr_value_7_0_lsb 0
#define xd_p_reg_ce_2nd_cent_auto_clr_value_11_8	(*(volatile byte xdata *) 0xFD8F)
#define    p_reg_ce_2nd_cent_auto_clr_value_11_8	0xFD8F 
#define	reg_ce_2nd_cent_auto_clr_value_11_8_pos 0
#define	reg_ce_2nd_cent_auto_clr_value_11_8_len 4
#define	reg_ce_2nd_cent_auto_clr_value_11_8_lsb 8
#define xd_p_reg_ce_gs_s1_var	(*(volatile byte xdata *) 0xFD90)
#define    p_reg_ce_gs_s1_var	0xFD90 
#define	reg_ce_gs_s1_var_pos 0
#define	reg_ce_gs_s1_var_len 4
#define	reg_ce_gs_s1_var_lsb 0
#define xd_p_reg_ce_2nd_centroid_max_7_0	(*(volatile byte xdata *) 0xFD91)
#define    p_reg_ce_2nd_centroid_max_7_0	0xFD91 
#define	reg_ce_2nd_centroid_max_7_0_pos 0
#define	reg_ce_2nd_centroid_max_7_0_len 8
#define	reg_ce_2nd_centroid_max_7_0_lsb 0
#define xd_p_reg_ce_2nd_centroid_max_11_8	(*(volatile byte xdata *) 0xFD92)
#define    p_reg_ce_2nd_centroid_max_11_8	0xFD92 
#define	reg_ce_2nd_centroid_max_11_8_pos 0
#define	reg_ce_2nd_centroid_max_11_8_len 4
#define	reg_ce_2nd_centroid_max_11_8_lsb 8
#define xd_r_reg_ce_2nd_centroid_out_7_0	(*(volatile byte xdata *) 0xFD93)
#define    r_reg_ce_2nd_centroid_out_7_0	0xFD93 
#define	reg_ce_2nd_centroid_out_7_0_pos 0
#define	reg_ce_2nd_centroid_out_7_0_len 8
#define	reg_ce_2nd_centroid_out_7_0_lsb 0
#define xd_r_reg_ce_2nd_centroid_out_11_8	(*(volatile byte xdata *) 0xFD94)
#define    r_reg_ce_2nd_centroid_out_11_8	0xFD94 
#define	reg_ce_2nd_centroid_out_11_8_pos 0
#define	reg_ce_2nd_centroid_out_11_8_len 4
#define	reg_ce_2nd_centroid_out_11_8_lsb 8
#define xd_r_reg_ce_2nd_fctrl_rdy	(*(volatile byte xdata *) 0xFD95)
#define    r_reg_ce_2nd_fctrl_rdy	0xFD95 
#define	reg_ce_2nd_fctrl_rdy_pos 0
#define	reg_ce_2nd_fctrl_rdy_len 1
#define	reg_ce_2nd_fctrl_rdy_lsb 0
#define xd_r_reg_ce_2nd_var	(*(volatile byte xdata *) 0xFD96)
#define    r_reg_ce_2nd_var	0xFD96 
#define	reg_ce_2nd_var_pos 0
#define	reg_ce_2nd_var_len 3
#define	reg_ce_2nd_var_lsb 0
#define xd_r_reg_ce_2nd_bias_7_0	(*(volatile byte xdata *) 0xFD97)
#define    r_reg_ce_2nd_bias_7_0	0xFD97 
#define	reg_ce_2nd_bias_7_0_pos 0
#define	reg_ce_2nd_bias_7_0_len 8
#define	reg_ce_2nd_bias_7_0_lsb 0
#define xd_r_reg_ce_2nd_bias_11_8	(*(volatile byte xdata *) 0xFD98)
#define    r_reg_ce_2nd_bias_11_8	0xFD98 
#define	reg_ce_2nd_bias_11_8_pos 0
#define	reg_ce_2nd_bias_11_8_len 4
#define	reg_ce_2nd_bias_11_8_lsb 8
#define xd_r_reg_ce_2nd_m1_7_0	(*(volatile byte xdata *) 0xFD99)
#define    r_reg_ce_2nd_m1_7_0	0xFD99 
#define	reg_ce_2nd_m1_7_0_pos 0
#define	reg_ce_2nd_m1_7_0_len 8
#define	reg_ce_2nd_m1_7_0_lsb 0
#define xd_r_reg_ce_2nd_m1_11_8	(*(volatile byte xdata *) 0xFD9A)
#define    r_reg_ce_2nd_m1_11_8	0xFD9A 
#define	reg_ce_2nd_m1_11_8_pos 0
#define	reg_ce_2nd_m1_11_8_len 4
#define	reg_ce_2nd_m1_11_8_lsb 8
#define xd_p_reg_ce_2nd_var_forced_value	(*(volatile byte xdata *) 0xFD9B)
#define    p_reg_ce_2nd_var_forced_value	0xFD9B 
#define	reg_ce_2nd_var_forced_value_pos 0
#define	reg_ce_2nd_var_forced_value_len 3
#define	reg_ce_2nd_var_forced_value_lsb 0
#define xd_r_reg_ce_2nd_m2_central_7_0	(*(volatile byte xdata *) 0xFD9C)
#define    r_reg_ce_2nd_m2_central_7_0	0xFD9C 
#define	reg_ce_2nd_m2_central_7_0_pos 0
#define	reg_ce_2nd_m2_central_7_0_len 8
#define	reg_ce_2nd_m2_central_7_0_lsb 0
#define xd_r_reg_ce_2nd_m2_central_15_8	(*(volatile byte xdata *) 0xFD9D)
#define    r_reg_ce_2nd_m2_central_15_8	0xFD9D 
#define	reg_ce_2nd_m2_central_15_8_pos 0
#define	reg_ce_2nd_m2_central_15_8_len 8
#define	reg_ce_2nd_m2_central_15_8_lsb 8
#define xd_p_reg_ce_2nd_var_default_value	(*(volatile byte xdata *) 0xFD9E)
#define    p_reg_ce_2nd_var_default_value	0xFD9E 
#define	reg_ce_2nd_var_default_value_pos 0
#define	reg_ce_2nd_var_default_value_len 3
#define	reg_ce_2nd_var_default_value_lsb 0
#define xd_p_reg_ce_2nd_cent_default_value_7_0	(*(volatile byte xdata *) 0xFD9F)
#define    p_reg_ce_2nd_cent_default_value_7_0	0xFD9F 
#define	reg_ce_2nd_cent_default_value_7_0_pos 0
#define	reg_ce_2nd_cent_default_value_7_0_len 8
#define	reg_ce_2nd_cent_default_value_7_0_lsb 0
#define xd_p_reg_ce_2nd_cent_default_value_11_8	(*(volatile byte xdata *) 0xFDA0)
#define    p_reg_ce_2nd_cent_default_value_11_8	0xFDA0 
#define	reg_ce_2nd_cent_default_value_11_8_pos 0
#define	reg_ce_2nd_cent_default_value_11_8_len 4
#define	reg_ce_2nd_cent_default_value_11_8_lsb 8
#define xd_p_reg_ce_use_fdi_long	(*(volatile byte xdata *) 0xFDA1)
#define    p_reg_ce_use_fdi_long	0xFDA1 
#define	reg_ce_use_fdi_long_pos 0
#define	reg_ce_use_fdi_long_len 1
#define	reg_ce_use_fdi_long_lsb 0
#define xd_p_reg_p_ce_tdi_lms_en	(*(volatile byte xdata *) 0xFDA2)
#define    p_reg_p_ce_tdi_lms_en	0xFDA2 
#define	reg_p_ce_tdi_lms_en_pos 0
#define	reg_p_ce_tdi_lms_en_len 1
#define	reg_p_ce_tdi_lms_en_lsb 0
#define xd_p_reg_p_ce_tdi_lms_bufshift	(*(volatile byte xdata *) 0xFDA3)
#define    p_reg_p_ce_tdi_lms_bufshift	0xFDA3 
#define	reg_p_ce_tdi_lms_bufshift_pos 0
#define	reg_p_ce_tdi_lms_bufshift_len 2
#define	reg_p_ce_tdi_lms_bufshift_lsb 0
#define xd_p_reg_p_ce_tdi_lms_ave_ratio	(*(volatile byte xdata *) 0xFDA4)
#define    p_reg_p_ce_tdi_lms_ave_ratio	0xFDA4 
#define	reg_p_ce_tdi_lms_ave_ratio_pos 0
#define	reg_p_ce_tdi_lms_ave_ratio_len 5
#define	reg_p_ce_tdi_lms_ave_ratio_lsb 0
#define xd_p_reg_p_ce_conf2_in_con0_en	(*(volatile byte xdata *) 0xFDA5)
#define    p_reg_p_ce_conf2_in_con0_en	0xFDA5 
#define	reg_p_ce_conf2_in_con0_en_pos 0
#define	reg_p_ce_conf2_in_con0_en_len 1
