liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_p_ce_conf2_in_con0_en_lsb 0
#define xd_p_fec_rsd_packet_unit_7_0	(*(volatile byte xdata *) 0xF700)
#define    p_fec_rsd_packet_unit_7_0	0xF700 
#define	fec_rsd_packet_unit_7_0_pos 0
#define	fec_rsd_packet_unit_7_0_len 8
#define	fec_rsd_packet_unit_7_0_lsb 0
#define xd_p_fec_rsd_packet_unit_15_8	(*(volatile byte xdata *) 0xF701)
#define    p_fec_rsd_packet_unit_15_8	0xF701 
#define	fec_rsd_packet_unit_15_8_pos 0
#define	fec_rsd_packet_unit_15_8_len 8
#define	fec_rsd_packet_unit_15_8_lsb 8
#define xd_r_reg_rsd_bit_err_cnt_7_0	(*(volatile byte xdata *) 0xF702)
#define    r_reg_rsd_bit_err_cnt_7_0	0xF702 
#define	reg_rsd_bit_err_cnt_7_0_pos 0
#define	reg_rsd_bit_err_cnt_7_0_len 8
#define	reg_rsd_bit_err_cnt_7_0_lsb 0
#define xd_r_reg_rsd_bit_err_cnt_15_8	(*(volatile byte xdata *) 0xF703)
#define    r_reg_rsd_bit_err_cnt_15_8	0xF703 
#define	reg_rsd_bit_err_cnt_15_8_pos 0
#define	reg_rsd_bit_err_cnt_15_8_len 8
#define	reg_rsd_bit_err_cnt_15_8_lsb 8
#define xd_r_reg_rsd_bit_err_cnt_23_16	(*(volatile byte xdata *) 0xF704)
#define    r_reg_rsd_bit_err_cnt_23_16	0xF704 
#define	reg_rsd_bit_err_cnt_23_16_pos 0
#define	reg_rsd_bit_err_cnt_23_16_len 8
#define	reg_rsd_bit_err_cnt_23_16_lsb 16
#define xd_r_reg_rsd_abort_packet_cnt_7_0	(*(volatile byte xdata *) 0xF705)
#define    r_reg_rsd_abort_packet_cnt_7_0	0xF705 
#define	reg_rsd_abort_packet_cnt_7_0_pos 0
#define	reg_rsd_abort_packet_cnt_7_0_len 8
#define	reg_rsd_abort_packet_cnt_7_0_lsb 0
#define xd_r_reg_rsd_abort_packet_cnt_15_8	(*(volatile byte xdata *) 0xF706)
#define    r_reg_rsd_abort_packet_cnt_15_8	0xF706 
#define	reg_rsd_abort_packet_cnt_15_8_pos 0
#define	reg_rsd_abort_packet_cnt_15_8_len 8
#define	reg_rsd_abort_packet_cnt_15_8_lsb 8
#define xd_p_fec_RSD_PKT_NUM_PER_UNIT_7_0	(*(volatile byte xdata *) 0xF707)
#define    p_fec_RSD_PKT_NUM_PER_UNIT_7_0	0xF707 
#define	fec_RSD_PKT_NUM_PER_UNIT_7_0_pos 0
#define	fec_RSD_PKT_NUM_PER_UNIT_7_0_len 8
#define	fec_RSD_PKT_NUM_PER_UNIT_7_0_lsb 0
#define xd_p_fec_RSD_PKT_NUM_PER_UNIT_15_8	(*(volatile byte xdata *) 0xF708)
#define    p_fec_RSD_PKT_NUM_PER_UNIT_15_8	0xF708 
#define	fec_RSD_PKT_NUM_PER_UNIT_15_8_pos 0
#define	fec_RSD_PKT_NUM_PER_UNIT_15_8_len 8
#define	fec_RSD_PKT_NUM_PER_UNIT_15_8_lsb 8
#define xd_p_fec_RS_TH_1_7_0	(*(volatile byte xdata *) 0xF709)
#define    p_fec_RS_TH_1_7_0	0xF709 
#define	fec_RS_TH_1_7_0_pos 0
#define	fec_RS_TH_1_7_0_len 8
#define	fec_RS_TH_1_7_0_lsb 0
#define xd_p_fec_RS_TH_1_15_8	(*(volatile byte xdata *) 0xF70A)
#define    p_fec_RS_TH_1_15_8	0xF70A 
#define	fec_RS_TH_1_15_8_pos 0
#define	fec_RS_TH_1_15_8_len 8
#define	fec_RS_TH_1_15_8_lsb 8
#define xd_p_fec_RS_TH_2	(*(volatile byte xdata *) 0xF70B)
#define    p_fec_RS_TH_2	0xF70B 
#define	fec_RS_TH_2_pos 0
#define	fec_RS_TH_2_len 8
#define	fec_RS_TH_2_lsb 0
#define xd_p_fec_rsd_ber_rst	(*(volatile byte xdata *) 0xF70C)
#define    p_fec_rsd_ber_rst	0xF70C 
#define	fec_rsd_ber_rst_pos 0
#define	fec_rsd_ber_rst_len 1
#define	fec_rsd_ber_rst_lsb 0
#define xd_p_reg_rsd_ber_rdy	(*(volatile byte xdata *) 0xF70D)
#define    p_reg_rsd_ber_rdy	0xF70D 
#define	reg_rsd_ber_rdy_pos 0
#define	reg_rsd_ber_rdy_len 1
#define	reg_rsd_ber_rdy_lsb 0
#define xd_p_reg_rsd_trigger_retrain	(*(volatile byte xdata *) 0xF70E)
#define    p_reg_rsd_trigger_retrain	0xF70E 
#define	reg_rsd_trigger_retrain_pos 0
#define	reg_rsd_trigger_retrain_len 1
#define	reg_rsd_trigger_retrain_lsb 0
#define xd_p_reg_sync_recover	(*(volatile byte xdata *) 0xF70F)
#define    p_reg_sync_recover	0xF70F 
#define	reg_sync_recover_pos 0
#define	reg_sync_recover_len 1
#define	reg_sync_recover_lsb 0
#define xd_p_fec_crc_en	(*(volatile byte xdata *) 0xF710)
#define    p_fec_crc_en	0xF710 
#define	fec_crc_en_pos 0
#define	fec_crc_en_len 1
#define	fec_crc_en_lsb 0
#define xd_p_fec_mon_en	(*(volatile byte xdata *) 0xF711)
#define    p_fec_mon_en	0xF711 
#define	fec_mon_en_pos 0
#define	fec_mon_en_len 1
#define	fec_mon_en_lsb 0
#define xd_p_reg_sync_chk	(*(volatile byte xdata *) 0xF712)
#define    p_reg_sync_chk	0xF712 
#define	reg_sync_chk_pos 0
#define	reg_sync_chk_len 1
#define	reg_sync_chk_lsb 0
#define xd_p_fec_dummy_reg_2	(*(volatile byte xdata *) 0xF713)
#define    p_fec_dummy_reg_2	0xF713 
#define	fec_dummy_reg_2_pos 0
#define	fec_dummy_reg_2_len 3
#define	fec_dummy_reg_2_lsb 0
#define xd_p_reg_fec_data_en	(*(volatile byte xdata *) 0xF714)
#define    p_reg_fec_data_en	0xF714 
#define	reg_fec_data_en_pos 0
#define	reg_fec_data_en_len 1
#define	reg_fec_data_en_lsb 0
#define xd_p_fec_vtb_rsd_mon_en	(*(volatile byte xdata *) 0xF715)
#define    p_fec_vtb_rsd_mon_en	0xF715 
#define	fec_vtb_rsd_mon_en_pos 0
#define	fec_vtb_rsd_mon_en_len 1
#define	fec_vtb_rsd_mon_en_lsb 0
#define xd_p_reg_fec_sw_rst	(*(volatile byte xdata *) 0xF716)
#define    p_reg_fec_sw_rst	0xF716 
#define	reg_fec_sw_rst_pos 0
#define	reg_fec_sw_rst_len 1
#define	reg_fec_sw_rst_lsb 0
#define xd_r_fec_vtb_pm_crc	(*(volatile byte xdata *) 0xF717)
#define    r_fec_vtb_pm_crc	0xF717 
#define	fec_vtb_pm_crc_pos 0
#define	fec_vtb_pm_crc_len 8
#define	fec_vtb_pm_crc_lsb 0
#define xd_r_fec_vtb_tb_7_crc	(*(volatile byte xdata *) 0xF718)
#define    r_fec_vtb_tb_7_crc	0xF718 
#define	fec_vtb_tb_7_crc_pos 0
#define	fec_vtb_tb_7_crc_len 8
#define	fec_vtb_tb_7_crc_lsb 0
#define xd_r_fec_vtb_tb_6_crc	(*(volatile byte xdata *) 0xF719)
#define    r_fec_vtb_tb_6_crc	0xF719 
#define	fec_vtb_tb_6_crc_pos 0
#define	fec_vtb_tb_6_crc_len 8
#define	fec_vtb_tb_6_crc_lsb 0
#define xd_r_fec_vtb_tb_5_crc	(*(volatile byte xdata *) 0xF71A)
#define    r_fec_vtb_tb_5_crc	0xF71A 
#define	fec_vtb_tb_5_crc_pos 0
#define	fec_vtb_tb_5_crc_len 8
#define	fec_vtb_tb_5_crc_lsb 0
#define xd_r_fec_vtb_tb_4_crc	(*(volatile byte xdata *) 0xF71B)
#define    r_fec_vtb_tb_4_crc	0xF71B 
#define	fec_vtb_tb_4_crc_pos 0
#define	fec_vtb_tb_4_crc_len 8
#define	fec_vtb_tb_4_crc_lsb 0
#define xd_r_fec_vtb_tb_3_crc	(*(volatile byte xdata *) 0xF71C)
#define    r_fec_vtb_tb_3_crc	0xF71C 
#define	fec_vtb_tb_3_crc_pos 0
#define	fec_vtb_tb_3_crc_len 8
#define	fec_vtb_tb_3_crc_lsb 0
#define xd_r_fec_vtb_tb_2_crc	(*(volatile byte xdata *) 0xF71D)
#define    r_fec_vtb_tb_2_crc	0xF71D 
#define	fec_vtb_tb_2_crc_pos 0
#define	fec_vtb_tb_2_crc_len 8
#define	fec_vtb_tb_2_crc_lsb 0
#define xd_r_fec_vtb_tb_1_crc	(*(volatile byte xdata *) 0xF71E)
#define    r_fec_vtb_tb_1_crc	0xF71E 
#define	fec_vtb_tb_1_crc_pos 0
#define	fec_vtb_tb_1_crc_len 8
#define	fec_vtb_tb_1_crc_lsb 0
#define xd_r_fec_vtb_tb_0_crc	(*(volatile byte xdata *) 0xF71F)
#define    r_fec_vtb_tb_0_crc	0xF71F 
#define	fec_vtb_tb_0_crc_pos 0
#define	fec_vtb_tb_0_crc_len 8
#define	fec_vtb_tb_0_crc_lsb 0
#define xd_r_fec_rsd_bank0_crc	(*(volatile byte xdata *) 0xF720)
#define    r_fec_rsd_bank0_crc	0xF720 
#define	fec_rsd_bank0_crc_pos 0
#define	fec_rsd_bank0_crc_len 8
#define	fec_rsd_bank0_crc_lsb 0
#define xd_r_fec_rsd_bank1_crc	(*(volatile byte xdata *) 0xF721)
#define    r_fec_rsd_bank1_crc	0xF721 
#define	fec_rsd_bank1_crc_pos 0
#define	fec_rsd_bank1_crc_len 8
#define	fec_rsd_bank1_crc_lsb 0
#define xd_r_fec_idi_vtb_crc	(*(volatile byte xdata *) 0xF722)
#define    r_fec_idi_vtb_crc	0xF722 
#define	fec_idi_vtb_crc_pos 0
#define	fec_idi_vtb_crc_len 8
#define	fec_idi_vtb_crc_lsb 0
#define xd_p_reg_fec_rsd_packet_unit_exp	(*(volatile byte xdata *) 0xF723)
#define    p_reg_fec_rsd_packet_unit_exp	0xF723 
#define	reg_fec_rsd_packet_unit_exp_pos 0
#define	reg_fec_rsd_packet_unit_exp_len 4
#define	reg_fec_rsd_packet_unit_exp_lsb 0
#define xd_p_reg_rsd_bit_err_exp_rdy	(*(volatile byte xdata *) 0xF724)
#define    p_reg_rsd_bit_err_exp_rdy	0xF724 
#define	reg_rsd_bit_err_exp_rdy_pos 0
#define	reg_rsd_bit_err_exp_rdy_len 1
#define	reg_rsd_bit_err_exp_rdy_lsb 0
#define xd_r_reg_rsd_bit_err_exp	(*(volatile byte xdata *) 0xF725)
#define    r_reg_rsd_bit_err_exp	0xF725 
#define	reg_rsd_bit_err_exp_pos 0
#define	reg_rsd_bit_err_exp_len 5
#define	reg_rsd_bit_err_exp_lsb 0
#define xd_p_fec_rsd_packet_unit1_7_0	(*(volatile byte xdata *) 0xF726)
#define    p_fec_rsd_packet_unit1_7_0	0xF726 
#define	fec_rsd_packet_unit1_7_0_pos 0
#define	fec_rsd_packet_unit1_7_0_len 8
#define	fec_rsd_packet_unit1_7_0_lsb 0
#define xd_p_fec_rsd_packet_unit1_15_8	(*(volatile byte xdata *) 0xF727)
#define    p_fec_rsd_packet_unit1_15_8	0xF727 
#define	fec_rsd_packet_unit1_15_8_pos 0
#define	fec_rsd_packet_unit1_15_8_len 8
#define	fec_rsd_packet_unit1_15_8_lsb 8
#define xd_r_reg_rsd_bit_err_cnt1_7_0	(*(volatile byte xdata *) 0xF728)
#define    r_reg_rsd_bit_err_cnt1_7_0	0xF728 
#define	reg_rsd_bit_err_cnt1_7_0_pos 0
#define	reg_rsd_bit_err_cnt1_7_0_len 8
#define	reg_rsd_bit_err_cnt1_7_0_lsb 0
#define xd_r_reg_rsd_bit_err_cnt1_15_8	(*(volatile byte xdata *) 0xF729)
#define    r_reg_rsd_bit_err_cnt1_15_8	0xF729 
#define	reg_rsd_bit_err_cnt1_15_8_pos 0
#define	reg_rsd_bit_err_cnt1_15_8_len 8
#define	reg_rsd_bit_err_cnt1_15_8_lsb 8
#define xd_r_reg_rsd_bit_err_cnt1_23_16	(*(volatile byte xdata *) 0xF72A)
#define    r_reg_rsd_bit_err_cnt1_23_16	0xF72A 
#define	reg_rsd_bit_err_cnt1_23_16_pos 0
#define	reg_rsd_bit_err_cnt1_23_16_len 8
#define	reg_rsd_bit_err_cnt1_23_16_lsb 16
#define xd_r_reg_rsd_abort_packet_cnt1_7_0	(*(volatile byte xdata *) 0xF72B)
#define    r_reg_rsd_abort_packet_cnt1_7_0	0xF72B 
#define	reg_rsd_abort_packet_cnt1_7_0_pos 0
#define	reg_rsd_abort_packet_cnt1_7_0_len 8
#define	reg_rsd_abort_packet_cnt1_7_0_lsb 0
#define xd_r_reg_rsd_abort_packet_cnt1_15_8	(*(volatile byte xdata *) 0xF72C)
#define    r_reg_rsd_abort_packet_cnt1_15_8	0xF72C 
#define	reg_rsd_abort_packet_cnt1_15_8_pos 0
#define	reg_rsd_abort_packet_cnt1_15_8_len 8
#define	reg_rsd_abort_packet_cnt1_15_8_lsb 8
#define xd_p_fec_rsd_ber_rst1	(*(volatile byte xdata *) 0xF72D)
#define    p_fec_rsd_ber_rst1	0xF72D 
#define	fec_rsd_ber_rst1_pos 0
#define	fec_rsd_ber_rst1_len 1
#define	fec_rsd_ber_rst1_lsb 0
#define xd_p_reg_rsd_ber_rdy1	(*(volatile byte xdata *) 0xF72E)
#define    p_reg_rsd_ber_rdy1	0xF72E 
#define	reg_rsd_ber_rdy1_pos 0
#define	reg_rsd_ber_rdy1_len 1
#define	reg_rsd_ber_rdy1_lsb 0
#define xd_p_reg_dca_txmod_sel	(*(volatile byte xdata *) 0xF72F)
#define    p_reg_dca_txmod_sel	0xF72F 
#define	reg_dca_txmod_sel_pos 0
#define	reg_dca_txmod_sel_len 1
#define	reg_dca_txmod_sel_lsb 0
#define xd_p_reg_dca_platch	(*(volatile byte xdata *) 0xF730)
#define    p_reg_dca_platch	0xF730 
#define	reg_dca_platch_pos 0
#define	reg_dca_platch_len 1
#define	reg_dca_platch_lsb 0
#define xd_p_reg_dca_upper_chip	(*(volatile byte xdata *) 0xF731)
#define    p_reg_dca_upper_chip	0xF731 
#define	reg_dca_upper_chip_pos 0
#define	reg_dca_upper_chip_len 1
#define	reg_dca_upper_chip_lsb 0
#define xd_p_reg_dca_lower_chip	(*(volatile byte xdata *) 0xF732)
#define    p_reg_dca_lower_chip	0xF732 
#define	reg_dca_lower_chip_pos 0
#define	reg_dca_lower_chip_len 1
#define	reg_dca_lower_chip_lsb 0
#define xd_p_reg_dca_enl	(*(volatile byte xdata *) 0xF733)
#define    p_reg_dca_enl	0xF733 
#define	reg_dca_enl_pos 0
#define	reg_dca_enl_len 1
#define	reg_dca_enl_lsb 0
#define xd_p_reg_dca_enu	(*(volatile byte xdata *) 0xF734)
#define    p_reg_dca_enu	0xF734 
#define	reg_dca_enu_pos 0
#define	reg_dca_enu_len 1
#define	reg_dca_enu_lsb 0
#define xd_p_reg_dca_th	(*(volatile byte xdata *) 0xF735)
#define    p_reg_dca_th	0xF735 
#define	reg_dca_th_pos 0
#define	reg_dca_th_len 5
#define	reg_dca_th_lsb 0
#define xd_p_reg_dca_scale	(*(volatile byte xdata *) 0xF736)
#define    p_reg_dca_scale	0xF736 
#define	reg_dca_scale_pos 0
#define	reg_dca_scale_len 4
#define	reg_dca_scale_lsb 0
#define xd_p_reg_dca_tone_7_0	(*(volatile byte xdata *) 0xF737)
#define    p_reg_dca_tone_7_0	0xF737 
#define	reg_dca_tone_7_0_pos 0
#define	reg_dca_tone_7_0_len 8
#define	reg_dca_tone_7_0_lsb 0
#define xd_p_reg_dca_tone_12_8	(*(volatile byte xdata *) 0xF738)
#define    p_reg_dca_tone_12_8	0xF738 
#define	reg_dca_tone_12_8_pos 0
#define	reg_dca_tone_12_8_len 5
#define	reg_dca_tone_12_8_lsb 8
#define xd_p_reg_dca_time_7_0	(*(volatile byte xdata *) 0xF739)
#define    p_reg_dca_time_7_0	0xF739 
#define	reg_dca_time_7_0_pos 0
#define	reg_dca_time_7_0_len 8
#define	reg_dca_time_7_0_lsb 0
#define xd_p_reg_dca_time_15_8	(*(volatile byte xdata *) 0xF73A)
#define    p_reg_dca_time_15_8	0xF73A 
#define	reg_dca_time_15_8_pos 0
#define	reg_dca_time_15_8_len 8
#define	reg_dca_time_15_8_lsb 8
#define xd_r_fec_dcasm	(*(volatile byte xdata *) 0xF73B)
#define    r_fec_dcasm	0xF73B 
#define	fec_dcasm_pos 0
#define	fec_dcasm_len 3
#define	fec_dcasm_lsb 0
#define xd_p_reg_dca_stand_alone	(*(volatile byte xdata *) 0xF73C)
#define    p_reg_dca_stand_alone	0xF73C 
#define	reg_dca_stand_alone_pos 0
#define	reg_dca_stand_alone_len 1
#define	reg_dca_stand_alone_lsb 0
#define xd_p_reg_dca_upper_out_en	(*(volatile byte xdata *) 0xF73D)
#define    p_reg_dca_upper_out_en	0xF73D 
#define	reg_dca_upper_out_en_pos 0
#define	reg_dca_upper_out_en_len 1
#define	reg_dca_upper_out_en_lsb 0
#define xd_p_reg_dca_rc_en	(*(volatile byte xdata *) 0xF73E)
#define    p_reg_dca_rc_en	0xF73E 
#define	reg_dca_rc_en_pos 0
#define	reg_dca_rc_en_len 1
#define	reg_dca_rc_en_lsb 0
#define xd_p_reg_dca_retrain_send	(*(volatile byte xdata *) 0xF73F)
#define    p_reg_dca_retrain_send	0xF73F 
#define	reg_dca_retrain_send_pos 0
#define	reg_dca_retrain_send_len 1
#define	reg_dca_retrain_send_lsb 0
#define xd_p_reg_dca_retrain_rec	(*(volatile byte xdata *) 0xF740)
#define    p_reg_dca_retrain_rec	0xF740 
#define	reg_dca_retrain_rec_pos 0
#define	reg_dca_retrain_rec_len 1
#define	reg_dca_retrain_rec_lsb 0
#define xd_p_reg_dca_gi_gap	(*(volatile byte xdata *) 0xF741)
#define    p_reg_dca_gi_gap	0xF741 
#define	reg_dca_gi_gap_pos 0
#define	reg_dca_gi_gap_len 8
#define	reg_dca_gi_gap_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_txmod	(*(volatile byte xdata *) 0xF742)
#define    r_reg_dca_rec_up_tpsd_txmod	0xF742 
#define	reg_dca_rec_up_tpsd_txmod_pos 0
#define	reg_dca_rec_up_tpsd_txmod_len 2
#define	reg_dca_rec_up_tpsd_txmod_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_const	(*(volatile byte xdata *) 0xF743)
#define    r_reg_dca_rec_up_tpsd_const	0xF743 
#define	reg_dca_rec_up_tpsd_const_pos 0
#define	reg_dca_rec_up_tpsd_const_len 2
#define	reg_dca_rec_up_tpsd_const_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_indep	(*(volatile byte xdata *) 0xF744)
#define    r_reg_dca_rec_up_tpsd_indep	0xF744 
#define	reg_dca_rec_up_tpsd_indep_pos 0
#define	reg_dca_rec_up_tpsd_indep_len 1
#define	reg_dca_rec_up_tpsd_indep_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_hier	(*(volatile byte xdata *) 0xF745)
#define    r_reg_dca_rec_up_tpsd_hier	0xF745 
#define	reg_dca_rec_up_tpsd_hier_pos 0
#define	reg_dca_rec_up_tpsd_hier_len 2
#define	reg_dca_rec_up_tpsd_hier_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_hpcr	(*(volatile byte xdata *) 0xF746)
#define    r_reg_dca_rec_up_tpsd_hpcr	0xF746 
#define	reg_dca_rec_up_tpsd_hpcr_pos 0
#define	reg_dca_rec_up_tpsd_hpcr_len 3
#define	reg_dca_rec_up_tpsd_hpcr_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_lpcr	(*(volatile byte xdata *) 0xF747)
#define    r_reg_dca_rec_up_tpsd_lpcr	0xF747 
#define	reg_dca_rec_up_tpsd_lpcr_pos 0
#define	reg_dca_rec_up_tpsd_lpcr_len 3
#define	reg_dca_rec_up_tpsd_lpcr_lsb 0
#define xd_r_reg_dca_rec_up_tpsd_lock	(*(volatile byte xdata *) 0xF748)
#define    r_reg_dca_rec_up_tpsd_lock	0xF748 
#define	reg_dca_rec_up_tpsd_lock_pos 0
#define	reg_dca_rec_up_tpsd_lock_len 1
#define	reg_dca_rec_up_tpsd_lock_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_txmod	(*(volatile byte xdata *) 0xF749)
#define    r_reg_dca_rec_lo_tpsd_txmod	0xF749 
#define	reg_dca_rec_lo_tpsd_txmod_pos 0
#define	reg_dca_rec_lo_tpsd_txmod_len 2
#define	reg_dca_rec_lo_tpsd_txmod_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_const	(*(volatile byte xdata *) 0xF74A)
#define    r_reg_dca_rec_lo_tpsd_const	0xF74A 
#define	reg_dca_rec_lo_tpsd_const_pos 0
#define	reg_dca_rec_lo_tpsd_const_len 2
#define	reg_dca_rec_lo_tpsd_const_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_indep	(*(volatile byte xdata *) 0xF74B)
#define    r_reg_dca_rec_lo_tpsd_indep	0xF74B 
#define	reg_dca_rec_lo_tpsd_indep_pos 0
#define	reg_dca_rec_lo_tpsd_indep_len 1
#define	reg_dca_rec_lo_tpsd_indep_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_hier	(*(volatile byte xdata *) 0xF74C)
#define    r_reg_dca_rec_lo_tpsd_hier	0xF74C 
#define	reg_dca_rec_lo_tpsd_hier_pos 0
#define	reg_dca_rec_lo_tpsd_hier_len 2
#define	reg_dca_rec_lo_tpsd_hier_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_hpcr	(*(volatile byte xdata *) 0xF74D)
#define    r_reg_dca_rec_lo_tpsd_hpcr	0xF74D 
#define	reg_dca_rec_lo_tpsd_hpcr_pos 0
#define	reg_dca_rec_lo_tpsd_hpcr_len 3
#define	reg_dca_rec_lo_tpsd_hpcr_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_lpcr	(*(volatile byte xdata *) 0xF74E)
#define    r_reg_dca_rec_lo_tpsd_lpcr	0xF74E 
#define	reg_dca_rec_lo_tpsd_lpcr_pos 0
#define	reg_dca_rec_lo_tpsd_lpcr_len 3
#define	reg_dca_rec_lo_tpsd_lpcr_lsb 0
#define xd_r_reg_dca_rec_lo_tpsd_lock	(*(volatile byte xdata *) 0xF74F)
#define    r_reg_dca_rec_lo_tpsd_lock	0xF74F 
#define	reg_dca_rec_lo_tpsd_lock_pos 0
#define	reg_dca_rec_lo_tpsd_lock_len 1
#define	reg_dca_rec_lo_tpsd_lock_lsb 0
#define xd_p_reg_dca_gpr_ctr_up_send	(*(volatile byte xdata *) 0xF750)
#define    p_reg_dca_gpr_ctr_up_send	0xF750 
#define	reg_dca_gpr_ctr_up_send_pos 0
#define	reg_dca_gpr_ctr_up_send_len 8
#define	reg_dca_gpr_ctr_up_send_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_0	(*(volatile byte xdata *) 0xF751)
#define    p_reg_dca_gpr_dat_up_send_0	0xF751 
#define	reg_dca_gpr_dat_up_send_0_pos 0
#define	reg_dca_gpr_dat_up_send_0_len 8
#define	reg_dca_gpr_dat_up_send_0_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_1	(*(volatile byte xdata *) 0xF752)
#define    p_reg_dca_gpr_dat_up_send_1	0xF752 
#define	reg_dca_gpr_dat_up_send_1_pos 0
#define	reg_dca_gpr_dat_up_send_1_len 8
#define	reg_dca_gpr_dat_up_send_1_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_2	(*(volatile byte xdata *) 0xF753)
#define    p_reg_dca_gpr_dat_up_send_2	0xF753 
#define	reg_dca_gpr_dat_up_send_2_pos 0
#define	reg_dca_gpr_dat_up_send_2_len 8
#define	reg_dca_gpr_dat_up_send_2_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_3	(*(volatile byte xdata *) 0xF754)
#define    p_reg_dca_gpr_dat_up_send_3	0xF754 
#define	reg_dca_gpr_dat_up_send_3_pos 0
#define	reg_dca_gpr_dat_up_send_3_len 8
#define	reg_dca_gpr_dat_up_send_3_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_4	(*(volatile byte xdata *) 0xF755)
#define    p_reg_dca_gpr_dat_up_send_4	0xF755 
#define	reg_dca_gpr_dat_up_send_4_pos 0
#define	reg_dca_gpr_dat_up_send_4_len 8
#define	reg_dca_gpr_dat_up_send_4_lsb 0
#define xd_p_reg_dca_gpr_dat_up_send_5	(*(volatile byte xdata *) 0xF756)
#define    p_reg_dca_gpr_dat_up_send_5	0xF756 
#define	reg_dca_gpr_dat_up_send_5_pos 0
#define	reg_dca_gpr_dat_up_send_5_len 8
#define	reg_dca_gpr_dat_up_send_5_lsb 0
#define xd_p_reg_dca_over_wr_up_send	(*(volatile byte xdata *) 0xF757)
#define    p_reg_dca_over_wr_up_send	0xF757 
#define	reg_dca_over_wr_up_send_pos 0
#define	reg_dca_over_wr_up_send_len 1
#define	reg_dca_over_wr_up_send_lsb 0
#define xd_p_reg_dca_int_up_send	(*(volatile byte xdata *) 0xF758)
#define    p_reg_dca_int_up_send	0xF758 
#define	reg_dca_int_up_send_pos 0
#define	reg_dca_int_up_send_len 1
#define	reg_dca_int_up_send_lsb 0
#define xd_p_reg_dca_gpr_ctr_lo_send	(*(volatile byte xdata *) 0xF759)
#define    p_reg_dca_gpr_ctr_lo_send	0xF759 
#define	reg_dca_gpr_ctr_lo_send_pos 0
#define	reg_dca_gpr_ctr_lo_send_len 8
#define	reg_dca_gpr_ctr_lo_send_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_0	(*(volatile byte xdata *) 0xF75A)
#define    p_reg_dca_gpr_dat_lo_send_0	0xF75A 
#define	reg_dca_gpr_dat_lo_send_0_pos 0
#define	reg_dca_gpr_dat_lo_send_0_len 8
#define	reg_dca_gpr_dat_lo_send_0_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_1	(*(volatile byte xdata *) 0xF75B)
#define    p_reg_dca_gpr_dat_lo_send_1	0xF75B 
#define	reg_dca_gpr_dat_lo_send_1_pos 0
#define	reg_dca_gpr_dat_lo_send_1_len 8
#define	reg_dca_gpr_dat_lo_send_1_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_2	(*(volatile byte xdata *) 0xF75C)
#define    p_reg_dca_gpr_dat_lo_send_2	0xF75C 
#define	reg_dca_gpr_dat_lo_send_2_pos 0
#define	reg_dca_gpr_dat_lo_send_2_len 8
#define	reg_dca_gpr_dat_lo_send_2_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_3	(*(volatile byte xdata *) 0xF75D)
#define    p_reg_dca_gpr_dat_lo_send_3	0xF75D 
#define	reg_dca_gpr_dat_lo_send_3_pos 0
#define	reg_dca_gpr_dat_lo_send_3_len 8
#define	reg_dca_gpr_dat_lo_send_3_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_4	(*(volatile byte xdata *) 0xF75E)
#define    p_reg_dca_gpr_dat_lo_send_4	0xF75E 
#define	reg_dca_gpr_dat_lo_send_4_pos 0
#define	reg_dca_gpr_dat_lo_send_4_len 8
#define	reg_dca_gpr_dat_lo_send_4_lsb 0
#define xd_p_reg_dca_gpr_dat_lo_send_5	(*(volatile byte xdata *) 0xF75F)
#define    p_reg_dca_gpr_dat_lo_send_5	0xF75F 
#define	reg_dca_gpr_dat_lo_send_5_pos 0
#define	reg_dca_gpr_dat_lo_send_5_len 8
#define	reg_dca_gpr_dat_lo_send_5_lsb 0
#define xd_p_reg_dca_over_wr_lo_send	(*(volatile byte xdata *) 0xF760)
#define    p_reg_dca_over_wr_lo_send	0xF760 
#define	reg_dca_over_wr_lo_send_pos 0
#define	reg_dca_over_wr_lo_send_len 1
#define	reg_dca_over_wr_lo_send_lsb 0
#define xd_p_reg_dca_int_lo_send	(*(volatile byte xdata *) 0xF761)
#define    p_reg_dca_int_lo_send	0xF761 
#define	reg_dca_int_lo_send_pos 0
#define	reg_dca_int_lo_send_len 1
#define	reg_dca_int_lo_send_lsb 0
#define xd_r_reg_dca_gpr_ctr_up_rec	(*(volatile byte xdata *) 0xF762)
#define    r_reg_dca_gpr_ctr_up_rec	0xF762 
#define	reg_dca_gpr_ctr_up_rec_pos 0
#define	reg_dca_gpr_ctr_up_rec_len 8
#define	reg_dca_gpr_ctr_up_rec_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_0	(*(volatile byte xdata *) 0xF763)
#define    r_reg_dca_gpr_dat_up_rec_0	0xF763 
#define	reg_dca_gpr_dat_up_rec_0_pos 0
#define	reg_dca_gpr_dat_up_rec_0_len 8
#define	reg_dca_gpr_dat_up_rec_0_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_1	(*(volatile byte xdata *) 0xF764)
#define    r_reg_dca_gpr_dat_up_rec_1	0xF764 
#define	reg_dca_gpr_dat_up_rec_1_pos 0
#define	reg_dca_gpr_dat_up_rec_1_len 8
#define	reg_dca_gpr_dat_up_rec_1_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_2	(*(volatile byte xdata *) 0xF765)
#define    r_reg_dca_gpr_dat_up_rec_2	0xF765 
#define	reg_dca_gpr_dat_up_rec_2_pos 0
#define	reg_dca_gpr_dat_up_rec_2_len 8
#define	reg_dca_gpr_dat_up_rec_2_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_3	(*(volatile byte xdata *) 0xF766)
#define    r_reg_dca_gpr_dat_up_rec_3	0xF766 
#define	reg_dca_gpr_dat_up_rec_3_pos 0
#define	reg_dca_gpr_dat_up_rec_3_len 8
#define	reg_dca_gpr_dat_up_rec_3_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_4	(*(volatile byte xdata *) 0xF767)
#define    r_reg_dca_gpr_dat_up_rec_4	0xF767 
#define	reg_dca_gpr_dat_up_rec_4_pos 0
#define	reg_dca_gpr_dat_up_rec_4_len 8
#define	reg_dca_gpr_dat_up_rec_4_lsb 0
#define xd_r_reg_dca_gpr_dat_up_rec_5	(*(volatile byte xdata *) 0xF768)
#define    r_reg_dca_gpr_dat_up_rec_5	0xF768 
#define	reg_dca_gpr_dat_up_rec_5_pos 0
#define	reg_dca_gpr_dat_up_rec_5_len 8
#define	reg_dca_gpr_dat_up_rec_5_lsb 0
#define xd_r_reg_dca_over_wr_up_rec	(*(volatile byte xdata *) 0xF769)
#define    r_reg_dca_over_wr_up_rec	0xF769 
#define	reg_dca_over_wr_up_rec_pos 0
#define	reg_dca_over_wr_up_rec_len 1
#define	reg_dca_over_wr_up_rec_lsb 0
#define xd_p_reg_dca_int_up_rec	(*(volatile byte xdata *) 0xF76A)
#define    p_reg_dca_int_up_rec	0xF76A 
#define	reg_dca_int_up_rec_pos 0
#define	reg_dca_int_up_rec_len 1
#define	reg_dca_int_up_rec_lsb 0
#define xd_p_reg_dca_fw_read_yet_up	(*(volatile byte xdata *) 0xF76B)
#define    p_reg_dca_fw_read_yet_up	0xF76B 
#define	reg_dca_fw_read_yet_up_pos 0
#define	reg_dca_fw_read_yet_up_len 1
#define	reg_dca_fw_read_yet_up_lsb 0
#define xd_r_reg_dca_gpr_ctr_lo_rec	(*(volatile byte xdata *) 0xF76C)
#define    r_reg_dca_gpr_ctr_lo_rec	0xF76C 
#define	reg_dca_gpr_ctr_lo_rec_pos 0
#define	reg_dca_gpr_ctr_lo_rec_len 8
#define	reg_dca_gpr_ctr_lo_rec_lsb 0
#define xd_r_reg_dca_gpr_dat_lo_rec_0	(*(volatile byte xdata *) 0xF76D)
#define    r_reg_dca_gpr_dat_lo_rec_0	0xF76D 
#define	reg_dca_gpr_dat_lo_rec_0_pos 0
#define	reg_dca_gpr_dat_lo_rec_0_len 8
#define	reg_dca_gpr_dat_lo_rec_0_lsb 0
