liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_r_reg_dca_gpr_dat_lo_rec_1	(*(volatile byte xdata *) 0xF76E)
#define    r_reg_dca_gpr_dat_lo_rec_1	0xF76E 
#define	reg_dca_gpr_dat_lo_rec_1_pos 0
#define	reg_dca_gpr_dat_lo_rec_1_len 8
#define	reg_dca_gpr_dat_lo_rec_1_lsb 0
#define xd_r_reg_dca_gpr_dat_lo_rec_2	(*(volatile byte xdata *) 0xF76F)
#define    r_reg_dca_gpr_dat_lo_rec_2	0xF76F 
#define	reg_dca_gpr_dat_lo_rec_2_pos 0
#define	reg_dca_gpr_dat_lo_rec_2_len 8
#define	reg_dca_gpr_dat_lo_rec_2_lsb 0
#define xd_r_reg_dca_gpr_dat_lo_rec_3	(*(volatile byte xdata *) 0xF770)
#define    r_reg_dca_gpr_dat_lo_rec_3	0xF770 
#define	reg_dca_gpr_dat_lo_rec_3_pos 0
#define	reg_dca_gpr_dat_lo_rec_3_len 8
#define	reg_dca_gpr_dat_lo_rec_3_lsb 0
#define xd_r_reg_dca_gpr_dat_lo_rec_4	(*(volatile byte xdata *) 0xF771)
#define    r_reg_dca_gpr_dat_lo_rec_4	0xF771 
#define	reg_dca_gpr_dat_lo_rec_4_pos 0
#define	reg_dca_gpr_dat_lo_rec_4_len 8
#define	reg_dca_gpr_dat_lo_rec_4_lsb 0
#define xd_r_reg_dca_gpr_dat_lo_rec_5	(*(volatile byte xdata *) 0xF772)
#define    r_reg_dca_gpr_dat_lo_rec_5	0xF772 
#define	reg_dca_gpr_dat_lo_rec_5_pos 0
#define	reg_dca_gpr_dat_lo_rec_5_len 8
#define	reg_dca_gpr_dat_lo_rec_5_lsb 0
#define xd_r_reg_dca_over_wr_lo_rec	(*(volatile byte xdata *) 0xF773)
#define    r_reg_dca_over_wr_lo_rec	0xF773 
#define	reg_dca_over_wr_lo_rec_pos 0
#define	reg_dca_over_wr_lo_rec_len 1
#define	reg_dca_over_wr_lo_rec_lsb 0
#define xd_p_reg_dca_int_lo_rec	(*(volatile byte xdata *) 0xF774)
#define    p_reg_dca_int_lo_rec	0xF774 
#define	reg_dca_int_lo_rec_pos 0
#define	reg_dca_int_lo_rec_len 1
#define	reg_dca_int_lo_rec_lsb 0
#define xd_p_reg_dca_fw_read_yet_lo	(*(volatile byte xdata *) 0xF775)
#define    p_reg_dca_fw_read_yet_lo	0xF775 
#define	reg_dca_fw_read_yet_lo_pos 0
#define	reg_dca_fw_read_yet_lo_len 1
#define	reg_dca_fw_read_yet_lo_lsb 0
#define xd_p_reg_dca_en	(*(volatile byte xdata *) 0xF776)
#define    p_reg_dca_en	0xF776 
#define	reg_dca_en_pos 0
#define	reg_dca_en_len 1
#define	reg_dca_en_lsb 0
#define xd_p_reg_dca_ulrdy_delay	(*(volatile byte xdata *) 0xF777)
#define    p_reg_dca_ulrdy_delay	0xF777 
#define	reg_dca_ulrdy_delay_pos 0
#define	reg_dca_ulrdy_delay_len 8
#define	reg_dca_ulrdy_delay_lsb 0
#define xd_p_reg_dca_fpga_latch	(*(volatile byte xdata *) 0xF778)
#define    p_reg_dca_fpga_latch	0xF778 
#define	reg_dca_fpga_latch_pos 0
#define	reg_dca_fpga_latch_len 8
#define	reg_dca_fpga_latch_lsb 0
#define xd_p_reg_dca_vldld_err	(*(volatile byte xdata *) 0xF779)
#define    p_reg_dca_vldld_err	0xF779 
#define	reg_dca_vldld_err_pos 0
#define	reg_dca_vldld_err_len 1
#define	reg_dca_vldld_err_lsb 0
#define xd_p_reg_dca_vldud_err	(*(volatile byte xdata *) 0xF77A)
#define    p_reg_dca_vldud_err	0xF77A 
#define	reg_dca_vldud_err_pos 0
#define	reg_dca_vldud_err_len 1
#define	reg_dca_vldud_err_lsb 0
#define xd_p_reg_dca_modeu_err	(*(volatile byte xdata *) 0xF77B)
#define    p_reg_dca_modeu_err	0xF77B 
#define	reg_dca_modeu_err_pos 0
#define	reg_dca_modeu_err_len 1
#define	reg_dca_modeu_err_lsb 0
#define xd_p_reg_dca_model_err	(*(volatile byte xdata *) 0xF77C)
#define    p_reg_dca_model_err	0xF77C 
#define	reg_dca_model_err_pos 0
#define	reg_dca_model_err_len 1
#define	reg_dca_model_err_lsb 0
#define xd_p_reg_dca_interrupt	(*(volatile byte xdata *) 0xF77D)
#define    p_reg_dca_interrupt	0xF77D 
#define	reg_dca_interrupt_pos 0
#define	reg_dca_interrupt_len 1
#define	reg_dca_interrupt_lsb 0
#define xd_p_reg_dca_auto_reset_en	(*(volatile byte xdata *) 0xF77E)
#define    p_reg_dca_auto_reset_en	0xF77E 
#define	reg_dca_auto_reset_en_pos 0
#define	reg_dca_auto_reset_en_len 1
#define	reg_dca_auto_reset_en_lsb 0
#define xd_p_reg_qnt_valuew_7_0	(*(volatile byte xdata *) 0xF77F)
#define    p_reg_qnt_valuew_7_0	0xF77F 
#define	reg_qnt_valuew_7_0_pos 0
#define	reg_qnt_valuew_7_0_len 8
#define	reg_qnt_valuew_7_0_lsb 0
#define xd_p_reg_qnt_valuew_10_8	(*(volatile byte xdata *) 0xF780)
#define    p_reg_qnt_valuew_10_8	0xF780 
#define	reg_qnt_valuew_10_8_pos 0
#define	reg_qnt_valuew_10_8_len 3
#define	reg_qnt_valuew_10_8_lsb 8
#define xd_p_reg_qnt_nfvaluew_7_0	(*(volatile byte xdata *) 0xF781)
#define    p_reg_qnt_nfvaluew_7_0	0xF781 
#define	reg_qnt_nfvaluew_7_0_pos 0
#define	reg_qnt_nfvaluew_7_0_len 8
#define	reg_qnt_nfvaluew_7_0_lsb 0
#define xd_p_reg_qnt_nfvaluew_10_8	(*(volatile byte xdata *) 0xF782)
#define    p_reg_qnt_nfvaluew_10_8	0xF782 
#define	reg_qnt_nfvaluew_10_8_pos 0
#define	reg_qnt_nfvaluew_10_8_len 3
#define	reg_qnt_nfvaluew_10_8_lsb 8
#define xd_p_reg_qnt_flatness_thr_7_0	(*(volatile byte xdata *) 0xF783)
#define    p_reg_qnt_flatness_thr_7_0	0xF783 
#define	reg_qnt_flatness_thr_7_0_pos 0
#define	reg_qnt_flatness_thr_7_0_len 8
#define	reg_qnt_flatness_thr_7_0_lsb 0
#define xd_p_reg_qnt_flatness_thr_8	(*(volatile byte xdata *) 0xF784)
#define    p_reg_qnt_flatness_thr_8	0xF784 
#define	reg_qnt_flatness_thr_8_pos 0
#define	reg_qnt_flatness_thr_8_len 1
#define	reg_qnt_flatness_thr_8_lsb 8
#define xd_p_reg_llr_to_be_monitor	(*(volatile byte xdata *) 0xF785)
#define    p_reg_llr_to_be_monitor	0xF785 
#define	reg_llr_to_be_monitor_pos 0
#define	reg_llr_to_be_monitor_len 1
#define	reg_llr_to_be_monitor_lsb 0
#define xd_p_reg_qnt_vbc_rdy	(*(volatile byte xdata *) 0xF786)
#define    p_reg_qnt_vbc_rdy	0xF786 
#define	reg_qnt_vbc_rdy_pos 0
#define	reg_qnt_vbc_rdy_len 1
#define	reg_qnt_vbc_rdy_lsb 0
#define xd_p_reg_qnt_noncmb_vbc_rdy	(*(volatile byte xdata *) 0xF787)
#define    p_reg_qnt_noncmb_vbc_rdy	0xF787 
#define	reg_qnt_noncmb_vbc_rdy_pos 0
#define	reg_qnt_noncmb_vbc_rdy_len 1
#define	reg_qnt_noncmb_vbc_rdy_lsb 0
#define xd_p_reg_use_eh2_mean	(*(volatile byte xdata *) 0xF788)
#define    p_reg_use_eh2_mean	0xF788 
#define	reg_use_eh2_mean_pos 0
#define	reg_use_eh2_mean_len 1
#define	reg_use_eh2_mean_lsb 0
#define xd_p_reg_qnt_vbc_ccid_mode	(*(volatile byte xdata *) 0xF789)
#define    p_reg_qnt_vbc_ccid_mode	0xF789 
#define	reg_qnt_vbc_ccid_mode_pos 0
#define	reg_qnt_vbc_ccid_mode_len 1
#define	reg_qnt_vbc_ccid_mode_lsb 0
#define xd_p_reg_qnt_cci_bandsize	(*(volatile byte xdata *) 0xF78A)
#define    p_reg_qnt_cci_bandsize	0xF78A 
#define	reg_qnt_cci_bandsize_pos 0
#define	reg_qnt_cci_bandsize_len 4
#define	reg_qnt_cci_bandsize_lsb 0
#define xd_p_reg_qnt_vbc_sframe_num	(*(volatile byte xdata *) 0xF78B)
#define    p_reg_qnt_vbc_sframe_num	0xF78B 
#define	reg_qnt_vbc_sframe_num_pos 0
#define	reg_qnt_vbc_sframe_num_len 8
#define	reg_qnt_vbc_sframe_num_lsb 0
#define xd_p_reg_sbx_gain_diff_7_0	(*(volatile byte xdata *) 0xF78C)
#define    p_reg_sbx_gain_diff_7_0	0xF78C 
#define	reg_sbx_gain_diff_7_0_pos 0
#define	reg_sbx_gain_diff_7_0_len 8
#define	reg_sbx_gain_diff_7_0_lsb 0
#define xd_p_reg_sbx_gain_diff_8	(*(volatile byte xdata *) 0xF78D)
#define    p_reg_sbx_gain_diff_8	0xF78D 
#define	reg_sbx_gain_diff_8_pos 0
#define	reg_sbx_gain_diff_8_len 1
#define	reg_sbx_gain_diff_8_lsb 8
#define xd_p_reg_sbx_gain_diff_rdy	(*(volatile byte xdata *) 0xF78E)
#define    p_reg_sbx_gain_diff_rdy	0xF78E 
#define	reg_sbx_gain_diff_rdy_pos 0
#define	reg_sbx_gain_diff_rdy_len 1
#define	reg_sbx_gain_diff_rdy_lsb 0
#define xd_p_reg_sbx_noncmb_gain_diff_7_0	(*(volatile byte xdata *) 0xF78F)
#define    p_reg_sbx_noncmb_gain_diff_7_0	0xF78F 
#define	reg_sbx_noncmb_gain_diff_7_0_pos 0
#define	reg_sbx_noncmb_gain_diff_7_0_len 8
#define	reg_sbx_noncmb_gain_diff_7_0_lsb 0
#define xd_p_reg_sbx_noncmb_gain_diff_8	(*(volatile byte xdata *) 0xF790)
#define    p_reg_sbx_noncmb_gain_diff_8	0xF790 
#define	reg_sbx_noncmb_gain_diff_8_pos 0
#define	reg_sbx_noncmb_gain_diff_8_len 1
#define	reg_sbx_noncmb_gain_diff_8_lsb 8
#define xd_p_reg_sbx_noncmb_gain_diff_rdy	(*(volatile byte xdata *) 0xF791)
#define    p_reg_sbx_noncmb_gain_diff_rdy	0xF791 
#define	reg_sbx_noncmb_gain_diff_rdy_pos 0
#define	reg_sbx_noncmb_gain_diff_rdy_len 1
#define	reg_sbx_noncmb_gain_diff_rdy_lsb 0
#define xd_r_reg_qnt_vbc_err_7_0	(*(volatile byte xdata *) 0xF792)
#define    r_reg_qnt_vbc_err_7_0	0xF792 
#define	reg_qnt_vbc_err_7_0_pos 0
#define	reg_qnt_vbc_err_7_0_len 8
#define	reg_qnt_vbc_err_7_0_lsb 0
#define xd_r_reg_qnt_vbc_err_15_8	(*(volatile byte xdata *) 0xF793)
#define    r_reg_qnt_vbc_err_15_8	0xF793 
#define	reg_qnt_vbc_err_15_8_pos 0
#define	reg_qnt_vbc_err_15_8_len 8
#define	reg_qnt_vbc_err_15_8_lsb 8
#define xd_r_reg_qnt_vbc_err_23_16	(*(volatile byte xdata *) 0xF794)
#define    r_reg_qnt_vbc_err_23_16	0xF794 
#define	reg_qnt_vbc_err_23_16_pos 0
#define	reg_qnt_vbc_err_23_16_len 8
#define	reg_qnt_vbc_err_23_16_lsb 16
#define xd_r_reg_qnt_noncmb_vbc_err_7_0	(*(volatile byte xdata *) 0xF795)
#define    r_reg_qnt_noncmb_vbc_err_7_0	0xF795 
#define	reg_qnt_noncmb_vbc_err_7_0_pos 0
#define	reg_qnt_noncmb_vbc_err_7_0_len 8
#define	reg_qnt_noncmb_vbc_err_7_0_lsb 0
#define xd_r_reg_qnt_noncmb_vbc_err_15_8	(*(volatile byte xdata *) 0xF796)
#define    r_reg_qnt_noncmb_vbc_err_15_8	0xF796 
#define	reg_qnt_noncmb_vbc_err_15_8_pos 0
#define	reg_qnt_noncmb_vbc_err_15_8_len 8
#define	reg_qnt_noncmb_vbc_err_15_8_lsb 8
#define xd_r_reg_qnt_noncmb_vbc_err_23_16	(*(volatile byte xdata *) 0xF797)
#define    r_reg_qnt_noncmb_vbc_err_23_16	0xF797 
#define	reg_qnt_noncmb_vbc_err_23_16_pos 0
#define	reg_qnt_noncmb_vbc_err_23_16_len 8
#define	reg_qnt_noncmb_vbc_err_23_16_lsb 16
#define xd_p_reg_sbx_signalquality_threshold	(*(volatile byte xdata *) 0xF798)
#define    p_reg_sbx_signalquality_threshold	0xF798 
#define	reg_sbx_signalquality_threshold_pos 0
#define	reg_sbx_signalquality_threshold_len 4
#define	reg_sbx_signalquality_threshold_lsb 0
#define xd_r_reg_sbx_signalquality_ind	(*(volatile byte xdata *) 0xF799)
#define    r_reg_sbx_signalquality_ind	0xF799 
#define	reg_sbx_signalquality_ind_pos 0
#define	reg_sbx_signalquality_ind_len 1
#define	reg_sbx_signalquality_ind_lsb 0
#define xd_p_reg_p_sbxqnt_vzh2_th0	(*(volatile byte xdata *) 0xF80C)
#define    p_reg_p_sbxqnt_vzh2_th0	0xF80C 
#define	reg_p_sbxqnt_vzh2_th0_pos 0
#define	reg_p_sbxqnt_vzh2_th0_len 8
#define	reg_p_sbxqnt_vzh2_th0_lsb 0
#define xd_p_reg_p_sbxqnt_vzh2_th1	(*(volatile byte xdata *) 0xF80D)
#define    p_reg_p_sbxqnt_vzh2_th1	0xF80D 
#define	reg_p_sbxqnt_vzh2_th1_pos 0
#define	reg_p_sbxqnt_vzh2_th1_len 8
#define	reg_p_sbxqnt_vzh2_th1_lsb 0
#define xd_p_reg_p_sbxqnt_vzh2_th2	(*(volatile byte xdata *) 0xF80E)
#define    p_reg_p_sbxqnt_vzh2_th2	0xF80E 
#define	reg_p_sbxqnt_vzh2_th2_pos 0
#define	reg_p_sbxqnt_vzh2_th2_len 8
#define	reg_p_sbxqnt_vzh2_th2_lsb 0
#define xd_p_reg_p_qnt_w_comp1	(*(volatile byte xdata *) 0xF80F)
#define    p_reg_p_qnt_w_comp1	0xF80F 
#define	reg_p_qnt_w_comp1_pos 0
#define	reg_p_qnt_w_comp1_len 8
#define	reg_p_qnt_w_comp1_lsb 0
#define xd_p_reg_p_qnt_w_comp2	(*(volatile byte xdata *) 0xF810)
#define    p_reg_p_qnt_w_comp2	0xF810 
#define	reg_p_qnt_w_comp2_pos 0
#define	reg_p_qnt_w_comp2_len 8
#define	reg_p_qnt_w_comp2_lsb 0
#define xd_p_reg_p_qnt_w_comp3	(*(volatile byte xdata *) 0xF811)
#define    p_reg_p_qnt_w_comp3	0xF811 
#define	reg_p_qnt_w_comp3_pos 0
#define	reg_p_qnt_w_comp3_len 8
#define	reg_p_qnt_w_comp3_lsb 0
#define xd_p_reg_p_vtb_in_0	(*(volatile byte xdata *) 0xF821)
#define    p_reg_p_vtb_in_0	0xF821 
#define	reg_p_vtb_in_0_pos 0
#define	reg_p_vtb_in_0_len 6
#define	reg_p_vtb_in_0_lsb 0
#define xd_p_reg_p_vtb_in_1	(*(volatile byte xdata *) 0xF822)
#define    p_reg_p_vtb_in_1	0xF822 
#define	reg_p_vtb_in_1_pos 0
#define	reg_p_vtb_in_1_len 6
#define	reg_p_vtb_in_1_lsb 0
#define xd_p_reg_p_vtb_in_2	(*(volatile byte xdata *) 0xF823)
#define    p_reg_p_vtb_in_2	0xF823 
#define	reg_p_vtb_in_2_pos 0
#define	reg_p_vtb_in_2_len 6
#define	reg_p_vtb_in_2_lsb 0
#define xd_p_reg_p_vtb_in_3	(*(volatile byte xdata *) 0xF824)
#define    p_reg_p_vtb_in_3	0xF824 
#define	reg_p_vtb_in_3_pos 0
#define	reg_p_vtb_in_3_len 6
#define	reg_p_vtb_in_3_lsb 0
#define xd_p_reg_p_vtb_in_4	(*(volatile byte xdata *) 0xF825)
#define    p_reg_p_vtb_in_4	0xF825 
#define	reg_p_vtb_in_4_pos 0
#define	reg_p_vtb_in_4_len 6
#define	reg_p_vtb_in_4_lsb 0
#define xd_p_reg_p_vtb_in_5	(*(volatile byte xdata *) 0xF826)
#define    p_reg_p_vtb_in_5	0xF826 
#define	reg_p_vtb_in_5_pos 0
#define	reg_p_vtb_in_5_len 6
#define	reg_p_vtb_in_5_lsb 0
#define xd_p_reg_p_vtb_in_6	(*(volatile byte xdata *) 0xF827)
#define    p_reg_p_vtb_in_6	0xF827 
#define	reg_p_vtb_in_6_pos 0
#define	reg_p_vtb_in_6_len 6
#define	reg_p_vtb_in_6_lsb 0
#define xd_p_reg_p_vtb_in_7	(*(volatile byte xdata *) 0xF828)
#define    p_reg_p_vtb_in_7	0xF828 
#define	reg_p_vtb_in_7_pos 0
#define	reg_p_vtb_in_7_len 6
#define	reg_p_vtb_in_7_lsb 0
#define xd_p_reg_p_vtb_in_8	(*(volatile byte xdata *) 0xF829)
#define    p_reg_p_vtb_in_8	0xF829 
#define	reg_p_vtb_in_8_pos 0
#define	reg_p_vtb_in_8_len 6
#define	reg_p_vtb_in_8_lsb 0
#define xd_p_reg_p_vtb_in_9	(*(volatile byte xdata *) 0xF82A)
#define    p_reg_p_vtb_in_9	0xF82A 
#define	reg_p_vtb_in_9_pos 0
#define	reg_p_vtb_in_9_len 6
#define	reg_p_vtb_in_9_lsb 0
#define xd_p_reg_p_vtb_in_10	(*(volatile byte xdata *) 0xF82B)
#define    p_reg_p_vtb_in_10	0xF82B 
#define	reg_p_vtb_in_10_pos 0
#define	reg_p_vtb_in_10_len 6
#define	reg_p_vtb_in_10_lsb 0
#define xd_p_reg_p_vtb_in_11	(*(volatile byte xdata *) 0xF82C)
#define    p_reg_p_vtb_in_11	0xF82C 
#define	reg_p_vtb_in_11_pos 0
#define	reg_p_vtb_in_11_len 6
#define	reg_p_vtb_in_11_lsb 0
#define xd_p_reg_p_vtb_in_12	(*(volatile byte xdata *) 0xF82D)
#define    p_reg_p_vtb_in_12	0xF82D 
#define	reg_p_vtb_in_12_pos 0
#define	reg_p_vtb_in_12_len 6
#define	reg_p_vtb_in_12_lsb 0
#define xd_p_reg_p_vtb_in_13	(*(volatile byte xdata *) 0xF82E)
#define    p_reg_p_vtb_in_13	0xF82E 
#define	reg_p_vtb_in_13_pos 0
#define	reg_p_vtb_in_13_len 6
#define	reg_p_vtb_in_13_lsb 0
#define xd_p_reg_p_vtb_in_14	(*(volatile byte xdata *) 0xF82F)
#define    p_reg_p_vtb_in_14	0xF82F 
#define	reg_p_vtb_in_14_pos 0
#define	reg_p_vtb_in_14_len 6
#define	reg_p_vtb_in_14_lsb 0
#define xd_p_reg_p_vtb_in_15	(*(volatile byte xdata *) 0xF830)
#define    p_reg_p_vtb_in_15	0xF830 
#define	reg_p_vtb_in_15_pos 0
#define	reg_p_vtb_in_15_len 6
#define	reg_p_vtb_in_15_lsb 0
#define xd_I2C_i2c_m_slave_addr	(*(volatile byte xdata *) 0xF940)
#define    I2C_i2c_m_slave_addr	0xF940 
#define	i2c_m_slave_addr_pos 0
#define	i2c_m_slave_addr_len 8
#define	i2c_m_slave_addr_lsb 0
#define xd_I2C_i2c_m_data1	(*(volatile byte xdata *) 0xF941)
#define    I2C_i2c_m_data1	0xF941 
#define	i2c_m_data1_pos 0
#define	i2c_m_data1_len 8
#define	i2c_m_data1_lsb 0
#define xd_I2C_i2c_m_data2	(*(volatile byte xdata *) 0xF942)
#define    I2C_i2c_m_data2	0xF942 
#define	i2c_m_data2_pos 0
#define	i2c_m_data2_len 8
#define	i2c_m_data2_lsb 0
#define xd_I2C_i2c_m_data3	(*(volatile byte xdata *) 0xF943)
#define    I2C_i2c_m_data3	0xF943 
#define	i2c_m_data3_pos 0
#define	i2c_m_data3_len 8
#define	i2c_m_data3_lsb 0
#define xd_I2C_i2c_m_data4	(*(volatile byte xdata *) 0xF944)
#define    I2C_i2c_m_data4	0xF944 
#define	i2c_m_data4_pos 0
#define	i2c_m_data4_len 8
#define	i2c_m_data4_lsb 0
#define xd_I2C_i2c_m_data5	(*(volatile byte xdata *) 0xF945)
#define    I2C_i2c_m_data5	0xF945 
#define	i2c_m_data5_pos 0
#define	i2c_m_data5_len 8
#define	i2c_m_data5_lsb 0
#define xd_I2C_i2c_m_data6	(*(volatile byte xdata *) 0xF946)
#define    I2C_i2c_m_data6	0xF946 
#define	i2c_m_data6_pos 0
#define	i2c_m_data6_len 8
#define	i2c_m_data6_lsb 0
#define xd_I2C_i2c_m_data7	(*(volatile byte xdata *) 0xF947)
#define    I2C_i2c_m_data7	0xF947 
#define	i2c_m_data7_pos 0
#define	i2c_m_data7_len 8
#define	i2c_m_data7_lsb 0
#define xd_I2C_i2c_m_data8	(*(volatile byte xdata *) 0xF948)
#define    I2C_i2c_m_data8	0xF948 
#define	i2c_m_data8_pos 0
#define	i2c_m_data8_len 8
#define	i2c_m_data8_lsb 0
#define xd_I2C_i2c_m_data9	(*(volatile byte xdata *) 0xF949)
#define    I2C_i2c_m_data9	0xF949 
#define	i2c_m_data9_pos 0
#define	i2c_m_data9_len 8
#define	i2c_m_data9_lsb 0
#define xd_I2C_i2c_m_data10	(*(volatile byte xdata *) 0xF94A)
#define    I2C_i2c_m_data10	0xF94A 
#define	i2c_m_data10_pos 0
#define	i2c_m_data10_len 8
#define	i2c_m_data10_lsb 0
#define xd_I2C_i2c_m_data11	(*(volatile byte xdata *) 0xF94B)
#define    I2C_i2c_m_data11	0xF94B 
#define	i2c_m_data11_pos 0
#define	i2c_m_data11_len 8
#define	i2c_m_data11_lsb 0
#define xd_I2C_i2c_m_data12	(*(volatile byte xdata *) 0xF94C)
#define    I2C_i2c_m_data12	0xF94C 
#define	i2c_m_data12_pos 0
#define	i2c_m_data12_len 8
#define	i2c_m_data12_lsb 0
#define xd_I2C_i2c_m_data13	(*(volatile byte xdata *) 0xF94D)
#define    I2C_i2c_m_data13	0xF94D 
#define	i2c_m_data13_pos 0
#define	i2c_m_data13_len 8
#define	i2c_m_data13_lsb 0
#define xd_I2C_i2c_m_data14	(*(volatile byte xdata *) 0xF94E)
#define    I2C_i2c_m_data14	0xF94E 
#define	i2c_m_data14_pos 0
#define	i2c_m_data14_len 8
#define	i2c_m_data14_lsb 0
#define xd_I2C_i2c_m_data15	(*(volatile byte xdata *) 0xF94F)
#define    I2C_i2c_m_data15	0xF94F 
#define	i2c_m_data15_pos 0
#define	i2c_m_data15_len 8
#define	i2c_m_data15_lsb 0
#define xd_I2C_i2c_m_data16	(*(volatile byte xdata *) 0xF950)
#define    I2C_i2c_m_data16	0xF950 
#define	i2c_m_data16_pos 0
#define	i2c_m_data16_len 8
#define	i2c_m_data16_lsb 0
#define xd_I2C_i2c_m_data17	(*(volatile byte xdata *) 0xF951)
#define    I2C_i2c_m_data17	0xF951 
#define	i2c_m_data17_pos 0
#define	i2c_m_data17_len 8
#define	i2c_m_data17_lsb 0
#define xd_I2C_i2c_m_data18	(*(volatile byte xdata *) 0xF952)
#define    I2C_i2c_m_data18	0xF952 
#define	i2c_m_data18_pos 0
#define	i2c_m_data18_len 8
#define	i2c_m_data18_lsb 0
#define xd_I2C_i2c_m_data19	(*(volatile byte xdata *) 0xF953)
#define    I2C_i2c_m_data19	0xF953 
#define	i2c_m_data19_pos 0
#define	i2c_m_data19_len 8
#define	i2c_m_data19_lsb 0
#define xd_I2C_i2c_m_cmd_rw	(*(volatile byte xdata *) 0xF954)
#define    I2C_i2c_m_cmd_rw	0xF954 
#define	i2c_m_cmd_rw_pos 0
#define	i2c_m_cmd_rw_len 1
#define	i2c_m_cmd_rw_lsb 0
#define xd_I2C_i2c_m_cmd_rwlen	(*(volatile byte xdata *) 0xF954)
#define    I2C_i2c_m_cmd_rwlen	0xF954 
#define	i2c_m_cmd_rwlen_pos 3
#define	i2c_m_cmd_rwlen_len 4
#define	i2c_m_cmd_rwlen_lsb 0
#define xd_I2C_i2c_m_status_cmd_exe	(*(volatile byte xdata *) 0xF955)
#define    I2C_i2c_m_status_cmd_exe	0xF955 
#define	i2c_m_status_cmd_exe_pos 0
#define	i2c_m_status_cmd_exe_len 1
#define	i2c_m_status_cmd_exe_lsb 0
#define xd_I2C_i2c_m_status_wdat_done	(*(volatile byte xdata *) 0xF955)
#define    I2C_i2c_m_status_wdat_done	0xF955 
#define	i2c_m_status_wdat_done_pos 1
#define	i2c_m_status_wdat_done_len 1
#define	i2c_m_status_wdat_done_lsb 0
#define xd_I2C_i2c_m_status_wdat_fail	(*(volatile byte xdata *) 0xF955)
#define    I2C_i2c_m_status_wdat_fail	0xF955 
#define	i2c_m_status_wdat_fail_pos 2
#define	i2c_m_status_wdat_fail_len 1
#define	i2c_m_status_wdat_fail_lsb 0
#define xd_I2C_i2c_m_status_rdat_rdy	(*(volatile byte xdata *) 0xF955)
#define    I2C_i2c_m_status_rdat_rdy	0xF955 
#define	i2c_m_status_rdat_rdy_pos 3
#define	i2c_m_status_rdat_rdy_len 1
#define	i2c_m_status_rdat_rdy_lsb 0
#define xd_I2C_i2c_m_period	(*(volatile byte xdata *) 0xF956)
#define    I2C_i2c_m_period	0xF956 
#define	i2c_m_period_pos 0
#define	i2c_m_period_len 8
#define	i2c_m_period_lsb 0
#define xd_I2C_i2c_m_reg_msb_lsb	(*(volatile byte xdata *) 0xF957)
#define    I2C_i2c_m_reg_msb_lsb	0xF957 
#define	i2c_m_reg_msb_lsb_pos 0
#define	i2c_m_reg_msb_lsb_len 1
#define	i2c_m_reg_msb_lsb_lsb 0
#define xd_I2C_reg_ofdm_rst	(*(volatile byte xdata *) 0xF957)
#define    I2C_reg_ofdm_rst	0xF957 
#define	reg_ofdm_rst_pos 1
#define	reg_ofdm_rst_len 1
#define	reg_ofdm_rst_lsb 0
#define xd_I2C_reg_sample_period_on_tuner	(*(volatile byte xdata *) 0xF957)
#define    I2C_reg_sample_period_on_tuner	0xF957 
#define	reg_sample_period_on_tuner_pos 2
#define	reg_sample_period_on_tuner_len 1
#define	reg_sample_period_on_tuner_lsb 0
#define xd_I2C_reg_sel_tuner	(*(volatile byte xdata *) 0xF957)
#define    I2C_reg_sel_tuner	0xF957 
#define	reg_sel_tuner_pos 3
#define	reg_sel_tuner_len 1
#define	reg_sel_tuner_lsb 0
#define xd_I2C_reg_ofdm_rst_en	(*(volatile byte xdata *) 0xF957)
#define    I2C_reg_ofdm_rst_en	0xF957 
#define	reg_ofdm_rst_en_pos 4
#define	reg_ofdm_rst_en_len 1
#define	reg_ofdm_rst_en_lsb 0
#define xd_p_mp2if_psb_overflow	(*(volatile byte xdata *) 0xF980)
#define    p_mp2if_psb_overflow	0xF980 
#define	mp2if_psb_overflow_pos 0
#define	mp2if_psb_overflow_len 1
#define	mp2if_psb_overflow_lsb 0
#define xd_p_mp2if_no_modify_tei_bit	(*(volatile byte xdata *) 0xF981)
#define    p_mp2if_no_modify_tei_bit	0xF981 
#define	mp2if_no_modify_tei_bit_pos 0
#define	mp2if_no_modify_tei_bit_len 1
#define	mp2if_no_modify_tei_bit_lsb 0
#define xd_p_mp2if_keep_sf_sync_byte	(*(volatile byte xdata *) 0xF982)
#define    p_mp2if_keep_sf_sync_byte	0xF982 
#define	mp2if_keep_sf_sync_byte_pos 0
#define	mp2if_keep_sf_sync_byte_len 1
#define	mp2if_keep_sf_sync_byte_lsb 0
#define xd_p_mp2if_data_access_disable	(*(volatile byte xdata *) 0xF983)
#define    p_mp2if_data_access_disable	0xF983 
#define	mp2if_data_access_disable_pos 0
#define	mp2if_data_access_disable_len 1
#define	mp2if_data_access_disable_lsb 0
#define xd_p_mp2if_mpeg_ser_do7	(*(volatile byte xdata *) 0xF984)
#define    p_mp2if_mpeg_ser_do7	0xF984 
#define	mp2if_mpeg_ser_do7_pos 0
#define	mp2if_mpeg_ser_do7_len 1
#define	mp2if_mpeg_ser_do7_lsb 0
#define xd_p_mp2if_mpeg_ser_mode	(*(volatile byte xdata *) 0xF985)
#define    p_mp2if_mpeg_ser_mode	0xF985 
#define	mp2if_mpeg_ser_mode_pos 0
#define	mp2if_mpeg_ser_mode_len 1
#define	mp2if_mpeg_ser_mode_lsb 0
#define xd_p_mp2if_mpeg_par_mode	(*(volatile byte xdata *) 0xF986)
#define    p_mp2if_mpeg_par_mode	0xF986 
#define	mp2if_mpeg_par_mode_pos 0
#define	mp2if_mpeg_par_mode_len 1
#define	mp2if_mpeg_par_mode_lsb 0
#define xd_r_mp2if_psb_empty	(*(volatile byte xdata *) 0xF987)
#define    r_mp2if_psb_empty	0xF987 
#define	mp2if_psb_empty_pos 0
#define	mp2if_psb_empty_len 1
#define	mp2if_psb_empty_lsb 0
#define xd_r_mp2if_ts_not_188	(*(volatile byte xdata *) 0xF988)
#define    r_mp2if_ts_not_188	0xF988 
#define	mp2if_ts_not_188_pos 0
#define	mp2if_ts_not_188_len 1
#define	mp2if_ts_not_188_lsb 0
#define xd_p_mp2if_mssync_len	(*(volatile byte xdata *) 0xF989)
#define    p_mp2if_mssync_len	0xF989 
#define	mp2if_mssync_len_pos 0
#define	mp2if_mssync_len_len 1
#define	mp2if_mssync_len_lsb 0
#define xd_p_mp2if_msdo_msb	(*(volatile byte xdata *) 0xF98A)
#define    p_mp2if_msdo_msb	0xF98A 
#define	mp2if_msdo_msb_pos 0
#define	mp2if_msdo_msb_len 1
#define	mp2if_msdo_msb_lsb 0
#define xd_p_mp2if_mpeg_clk_gated	(*(volatile byte xdata *) 0xF98B)
#define    p_mp2if_mpeg_clk_gated	0xF98B 
#define	mp2if_mpeg_clk_gated_pos 0
#define	mp2if_mpeg_clk_gated_len 1
#define	mp2if_mpeg_clk_gated_lsb 0
#define xd_p_mp2if_mpeg_err_pol	(*(volatile byte xdata *) 0xF98C)
#define    p_mp2if_mpeg_err_pol	0xF98C 
#define	mp2if_mpeg_err_pol_pos 0
#define	mp2if_mpeg_err_pol_len 1
#define	mp2if_mpeg_err_pol_lsb 0
#define xd_p_mp2if_mpeg_sync_pol	(*(volatile byte xdata *) 0xF98D)
#define    p_mp2if_mpeg_sync_pol	0xF98D 
#define	mp2if_mpeg_sync_pol_pos 0
#define	mp2if_mpeg_sync_pol_len 1
#define	mp2if_mpeg_sync_pol_lsb 0
#define xd_p_mp2if_mpeg_vld_pol	(*(volatile byte xdata *) 0xF98E)
#define    p_mp2if_mpeg_vld_pol	0xF98E 
#define	mp2if_mpeg_vld_pol_pos 0
#define	mp2if_mpeg_vld_pol_len 1
#define	mp2if_mpeg_vld_pol_lsb 0
#define xd_p_mp2if_mpeg_clk_pol	(*(volatile byte xdata *) 0xF98F)
#define    p_mp2if_mpeg_clk_pol	0xF98F 
#define	mp2if_mpeg_clk_pol_pos 0
#define	mp2if_mpeg_clk_pol_len 1
#define	mp2if_mpeg_clk_pol_lsb 0
#define xd_p_reg_mpeg_full_speed	(*(volatile byte xdata *) 0xF990)
#define    p_reg_mpeg_full_speed	0xF990 
#define	reg_mpeg_full_speed_pos 0
#define	reg_mpeg_full_speed_len 1
#define	reg_mpeg_full_speed_lsb 0
#define xd_p_mp2if_pid_complement	(*(volatile byte xdata *) 0xF991)
#define    p_mp2if_pid_complement	0xF991 
#define	mp2if_pid_complement_pos 0
#define	mp2if_pid_complement_len 1
#define	mp2if_pid_complement_lsb 0
#define xd_p_mp2if_pid_rst	(*(volatile byte xdata *) 0xF992)
#define    p_mp2if_pid_rst	0xF992 
#define	mp2if_pid_rst_pos 0
#define	mp2if_pid_rst_len 1
#define	mp2if_pid_rst_lsb 0
