liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_p_mp2if_pid_en	(*(volatile byte xdata *) 0xF993)
#define    p_mp2if_pid_en	0xF993 
#define	mp2if_pid_en_pos 0
#define	mp2if_pid_en_len 1
#define	mp2if_pid_en_lsb 0
#define xd_p_mp2if_pid_index_en	(*(volatile byte xdata *) 0xF994)
#define    p_mp2if_pid_index_en	0xF994 
#define	mp2if_pid_index_en_pos 0
#define	mp2if_pid_index_en_len 1
#define	mp2if_pid_index_en_lsb 0
#define xd_p_mp2if_pid_index	(*(volatile byte xdata *) 0xF995)
#define    p_mp2if_pid_index	0xF995 
#define	mp2if_pid_index_pos 0
#define	mp2if_pid_index_len 5
#define	mp2if_pid_index_lsb 0
#define xd_p_mp2if_pid_dat_l	(*(volatile byte xdata *) 0xF996)
#define    p_mp2if_pid_dat_l	0xF996 
#define	mp2if_pid_dat_l_pos 0
#define	mp2if_pid_dat_l_len 8
#define	mp2if_pid_dat_l_lsb 0
#define xd_p_mp2if_pid_dat_h	(*(volatile byte xdata *) 0xF997)
#define    p_mp2if_pid_dat_h	0xF997 
#define	mp2if_pid_dat_h_pos 0
#define	mp2if_pid_dat_h_len 5
#define	mp2if_pid_dat_h_lsb 0
#define xd_p_reg_latch_clk	(*(volatile byte xdata *) 0xF998)
#define    p_reg_latch_clk	0xF998 
#define	reg_latch_clk_pos 0
#define	reg_latch_clk_len 1
#define	reg_latch_clk_lsb 0
#define xd_r_mp2if_sync_byte_locked	(*(volatile byte xdata *) 0xF999)
#define    r_mp2if_sync_byte_locked	0xF999 
#define	mp2if_sync_byte_locked_pos 0
#define	mp2if_sync_byte_locked_len 1
#define	mp2if_sync_byte_locked_lsb 0
#define xd_p_mp2if_ignore_sync_byte	(*(volatile byte xdata *) 0xF99A)
#define    p_mp2if_ignore_sync_byte	0xF99A 
#define	mp2if_ignore_sync_byte_pos 0
#define	mp2if_ignore_sync_byte_len 1
#define	mp2if_ignore_sync_byte_lsb 0
#define xd_p_reg_mp2if_clk_en	(*(volatile byte xdata *) 0xF99B)
#define    p_reg_mp2if_clk_en	0xF99B 
#define	reg_mp2if_clk_en_pos 0
#define	reg_mp2if_clk_en_len 1
#define	reg_mp2if_clk_en_lsb 0
#define xd_p_reg_mpeg_vld_tgl	(*(volatile byte xdata *) 0xF99C)
#define    p_reg_mpeg_vld_tgl	0xF99C 
#define	reg_mpeg_vld_tgl_pos 0
#define	reg_mpeg_vld_tgl_len 1
#define	reg_mpeg_vld_tgl_lsb 0
#define xd_p_reg_mp2_sw_rst	(*(volatile byte xdata *) 0xF99D)
#define    p_reg_mp2_sw_rst	0xF99D 
#define	reg_mp2_sw_rst_pos 0
#define	reg_mp2_sw_rst_len 1
#define	reg_mp2_sw_rst_lsb 0
#define xd_p_mp2if_psb_en	(*(volatile byte xdata *) 0xF99E)
#define    p_mp2if_psb_en	0xF99E 
#define	mp2if_psb_en_pos 0
#define	mp2if_psb_en_len 1
#define	mp2if_psb_en_lsb 0
#define xd_r_mp2if_usb20_mode	(*(volatile byte xdata *) 0xF99F)
#define    r_mp2if_usb20_mode	0xF99F 
#define	mp2if_usb20_mode_pos 0
#define	mp2if_usb20_mode_len 1
#define	mp2if_usb20_mode_lsb 0
#define xd_r_mp2if_strap_usb20_mode	(*(volatile byte xdata *) 0xF9A0)
#define    r_mp2if_strap_usb20_mode	0xF9A0 
#define	mp2if_strap_usb20_mode_pos 0
#define	mp2if_strap_usb20_mode_len 1
#define	mp2if_strap_usb20_mode_lsb 0
#define xd_r_mp2if_lost_pkt_cnt_l	(*(volatile byte xdata *) 0xF9A1)
#define    r_mp2if_lost_pkt_cnt_l	0xF9A1 
#define	mp2if_lost_pkt_cnt_l_pos 0
#define	mp2if_lost_pkt_cnt_l_len 8
#define	mp2if_lost_pkt_cnt_l_lsb 0
#define xd_r_mp2if_lost_pkt_cnt_h	(*(volatile byte xdata *) 0xF9A2)
#define    r_mp2if_lost_pkt_cnt_h	0xF9A2 
#define	mp2if_lost_pkt_cnt_h_pos 0
#define	mp2if_lost_pkt_cnt_h_len 8
#define	mp2if_lost_pkt_cnt_h_lsb 0
#define xd_p_reg_mp2if2_en	(*(volatile byte xdata *) 0xF9A3)
#define    p_reg_mp2if2_en	0xF9A3 
#define	reg_mp2if2_en_pos 0
#define	reg_mp2if2_en_len 1
#define	reg_mp2if2_en_lsb 0
#define xd_p_reg_mp2if2_sw_rst	(*(volatile byte xdata *) 0xF9A4)
#define    p_reg_mp2if2_sw_rst	0xF9A4 
#define	reg_mp2if2_sw_rst_pos 0
#define	reg_mp2if2_sw_rst_len 1
#define	reg_mp2if2_sw_rst_lsb 0
#define xd_p_reg_mp2if2_half_psb	(*(volatile byte xdata *) 0xF9A5)
#define    p_reg_mp2if2_half_psb	0xF9A5 
#define	reg_mp2if2_half_psb_pos 0
#define	reg_mp2if2_half_psb_len 1
#define	reg_mp2if2_half_psb_lsb 0
#define xd_p_reg_ts_byte_endian	(*(volatile byte xdata *) 0xF9A6)
#define    p_reg_ts_byte_endian	0xF9A6 
#define	reg_ts_byte_endian_pos 0
#define	reg_ts_byte_endian_len 1
#define	reg_ts_byte_endian_lsb 0
#define xd_p_reg_mp2_dioif	(*(volatile byte xdata *) 0xF9A7)
#define    p_reg_mp2_dioif	0xF9A7 
#define	reg_mp2_dioif_pos 0
#define	reg_mp2_dioif_len 1
#define	reg_mp2_dioif_lsb 0
#define xd_p_reg_mp2_dioif_fast	(*(volatile byte xdata *) 0xF9A8)
#define    p_reg_mp2_dioif_fast	0xF9A8 
#define	reg_mp2_dioif_fast_pos 0
#define	reg_mp2_dioif_fast_len 1
#define	reg_mp2_dioif_fast_lsb 0
#define xd_p_reg_tpsd_bw_mp2if	(*(volatile byte xdata *) 0xF9A9)
#define    p_reg_tpsd_bw_mp2if	0xF9A9 
#define	reg_tpsd_bw_mp2if_pos 0
#define	reg_tpsd_bw_mp2if_len 2
#define	reg_tpsd_bw_mp2if_lsb 0
#define xd_p_reg_tpsd_gi_mp2if	(*(volatile byte xdata *) 0xF9AA)
#define    p_reg_tpsd_gi_mp2if	0xF9AA 
#define	reg_tpsd_gi_mp2if_pos 0
#define	reg_tpsd_gi_mp2if_len 2
#define	reg_tpsd_gi_mp2if_lsb 0
#define xd_p_reg_tpsd_cr_mp2if	(*(volatile byte xdata *) 0xF9AB)
#define    p_reg_tpsd_cr_mp2if	0xF9AB 
#define	reg_tpsd_cr_mp2if_pos 0
#define	reg_tpsd_cr_mp2if_len 3
#define	reg_tpsd_cr_mp2if_lsb 0
#define xd_p_reg_tpsd_cons_mp2if	(*(volatile byte xdata *) 0xF9AC)
#define    p_reg_tpsd_cons_mp2if	0xF9AC 
#define	reg_tpsd_cons_mp2if_pos 0
#define	reg_tpsd_cons_mp2if_len 2
#define	reg_tpsd_cons_mp2if_lsb 0
#define xd_p_reg_fw_table_en	(*(volatile byte xdata *) 0xF9AD)
#define    p_reg_fw_table_en	0xF9AD 
#define	reg_fw_table_en_pos 0
#define	reg_fw_table_en_len 1
#define	reg_fw_table_en_lsb 0
#define xd_p_mp2if_psb_num_blk	(*(volatile byte xdata *) 0xF9AE)
#define    p_mp2if_psb_num_blk	0xF9AE 
#define	mp2if_psb_num_blk_pos 0
#define	mp2if_psb_num_blk_len 6
#define	mp2if_psb_num_blk_lsb 0
#define xd_p_reg_fec_fake	(*(volatile byte xdata *) 0xF9AF)
#define    p_reg_fec_fake	0xF9AF 
#define	reg_fec_fake_pos 0
#define	reg_fec_fake_len 1
#define	reg_fec_fake_lsb 0
#define xd_p_reg_packet_gap	(*(volatile byte xdata *) 0xF9B0)
#define    p_reg_packet_gap	0xF9B0 
#define	reg_packet_gap_pos 0
#define	reg_packet_gap_len 8
#define	reg_packet_gap_lsb 0
#define xd_p_reg_ts_dat_inv	(*(volatile byte xdata *) 0xF9B2)
#define    p_reg_ts_dat_inv	0xF9B2 
#define	reg_ts_dat_inv_pos 0
#define	reg_ts_dat_inv_len 1
#define	reg_ts_dat_inv_lsb 0
#define xd_p_reg_ts_lsb_1st	(*(volatile byte xdata *) 0xF9B3)
#define    p_reg_ts_lsb_1st	0xF9B3 
#define	reg_ts_lsb_1st_pos 0
#define	reg_ts_lsb_1st_len 1
#define	reg_ts_lsb_1st_lsb 0
#define xd_p_reg_ts_capt_bg_sel	(*(volatile byte xdata *) 0xF9B4)
#define    p_reg_ts_capt_bg_sel	0xF9B4 
#define	reg_ts_capt_bg_sel_pos 0
#define	reg_ts_capt_bg_sel_len 1
#define	reg_ts_capt_bg_sel_lsb 0
#define xd_p_reg_mp2if_stop_en	(*(volatile byte xdata *) 0xF9B5)
#define    p_reg_mp2if_stop_en	0xF9B5 
#define	reg_mp2if_stop_en_pos 0
#define	reg_mp2if_stop_en_len 1
#define	reg_mp2if_stop_en_lsb 0
#define xd_p_reg_mp2if2_pes_base	(*(volatile byte xdata *) 0xF9B6)
#define    p_reg_mp2if2_pes_base	0xF9B6 
#define	reg_mp2if2_pes_base_pos 0
#define	reg_mp2if2_pes_base_len 1
#define	reg_mp2if2_pes_base_lsb 0
#define xd_p_reg_ts_sync_inv	(*(volatile byte xdata *) 0xF9B7)
#define    p_reg_ts_sync_inv	0xF9B7 
#define	reg_ts_sync_inv_pos 0
#define	reg_ts_sync_inv_len 1
#define	reg_ts_sync_inv_lsb 0
#define xd_p_reg_ts_vld_inv	(*(volatile byte xdata *) 0xF9B8)
#define    p_reg_ts_vld_inv	0xF9B8 
#define	reg_ts_vld_inv_pos 0
#define	reg_ts_vld_inv_len 1
#define	reg_ts_vld_inv_lsb 0
#define xd_p_reg_sys_buf_overflow	(*(volatile byte xdata *) 0xF9B9)
#define    p_reg_sys_buf_overflow	0xF9B9 
#define	reg_sys_buf_overflow_pos 0
#define	reg_sys_buf_overflow_len 1
#define	reg_sys_buf_overflow_lsb 0
#define xd_p_reg_p_dioif_adc_en	(*(volatile byte xdata *) 0xF9BA)
#define    p_reg_p_dioif_adc_en	0xF9BA 
#define	reg_p_dioif_adc_en_pos 0
#define	reg_p_dioif_adc_en_len 1
#define	reg_p_dioif_adc_en_lsb 0
#define xd_p_reg_top_dummy0	(*(volatile byte xdata *) 0xF9BB)
#define    p_reg_top_dummy0	0xF9BB 
#define	reg_top_dummy0_pos 0
#define	reg_top_dummy0_len 8
#define	reg_top_dummy0_lsb 0
#define xd_p_reg_top_dummy1	(*(volatile byte xdata *) 0xF9BC)
#define    p_reg_top_dummy1	0xF9BC 
#define	reg_top_dummy1_pos 0
#define	reg_top_dummy1_len 8
#define	reg_top_dummy1_lsb 0
#define xd_p_reg_top_dummy2	(*(volatile byte xdata *) 0xF9BD)
#define    p_reg_top_dummy2	0xF9BD 
#define	reg_top_dummy2_pos 0
#define	reg_top_dummy2_len 8
#define	reg_top_dummy2_lsb 0
#define xd_p_reg_top_dummy3	(*(volatile byte xdata *) 0xF9BE)
#define    p_reg_top_dummy3	0xF9BE 
#define	reg_top_dummy3_pos 0
#define	reg_top_dummy3_len 8
#define	reg_top_dummy3_lsb 0
#define xd_p_reg_top_dummy4	(*(volatile byte xdata *) 0xF9BF)
#define    p_reg_top_dummy4	0xF9BF 
#define	reg_top_dummy4_pos 0
#define	reg_top_dummy4_len 8
#define	reg_top_dummy4_lsb 0
#define xd_p_reg_top_dummy5	(*(volatile byte xdata *) 0xF9C0)
#define    p_reg_top_dummy5	0xF9C0 
#define	reg_top_dummy5_pos 0
#define	reg_top_dummy5_len 8
#define	reg_top_dummy5_lsb 0
#define xd_p_reg_top_dummy6	(*(volatile byte xdata *) 0xF9C1)
#define    p_reg_top_dummy6	0xF9C1 
#define	reg_top_dummy6_pos 0
#define	reg_top_dummy6_len 8
#define	reg_top_dummy6_lsb 0
#define xd_p_reg_top_dummy7	(*(volatile byte xdata *) 0xF9C2)
#define    p_reg_top_dummy7	0xF9C2 
#define	reg_top_dummy7_pos 0
#define	reg_top_dummy7_len 8
#define	reg_top_dummy7_lsb 0
#define xd_p_reg_top_dummy8	(*(volatile byte xdata *) 0xF9C3)
#define    p_reg_top_dummy8	0xF9C3 
#define	reg_top_dummy8_pos 0
#define	reg_top_dummy8_len 8
#define	reg_top_dummy8_lsb 0
#define xd_p_reg_top_dummy9	(*(volatile byte xdata *) 0xF9C4)
#define    p_reg_top_dummy9	0xF9C4 
#define	reg_top_dummy9_pos 0
#define	reg_top_dummy9_len 8
#define	reg_top_dummy9_lsb 0
#define xd_p_reg_top_dummyA	(*(volatile byte xdata *) 0xF9C5)
#define    p_reg_top_dummyA	0xF9C5 
#define	reg_top_dummyA_pos 0
#define	reg_top_dummyA_len 8
#define	reg_top_dummyA_lsb 0
#define xd_p_reg_top_dummyB	(*(volatile byte xdata *) 0xF9C6)
#define    p_reg_top_dummyB	0xF9C6 
#define	reg_top_dummyB_pos 0
#define	reg_top_dummyB_len 8
#define	reg_top_dummyB_lsb 0
#define xd_p_reg_top_dummyC	(*(volatile byte xdata *) 0xF9C7)
#define    p_reg_top_dummyC	0xF9C7 
#define	reg_top_dummyC_pos 0
#define	reg_top_dummyC_len 8
#define	reg_top_dummyC_lsb 0
#define xd_p_reg_top_dummyD	(*(volatile byte xdata *) 0xF9C8)
#define    p_reg_top_dummyD	0xF9C8 
#define	reg_top_dummyD_pos 0
#define	reg_top_dummyD_len 8
#define	reg_top_dummyD_lsb 0
#define xd_p_reg_top_dummyE	(*(volatile byte xdata *) 0xF9C9)
#define    p_reg_top_dummyE	0xF9C9 
#define	reg_top_dummyE_pos 0
#define	reg_top_dummyE_len 8
#define	reg_top_dummyE_lsb 0
#define xd_p_reg_top_dummyF	(*(volatile byte xdata *) 0xF9CA)
#define    p_reg_top_dummyF	0xF9CA 
#define	reg_top_dummyF_pos 0
#define	reg_top_dummyF_len 8
#define	reg_top_dummyF_lsb 0
#define xd_p_reg_mp2if_clk_coeff	(*(volatile byte xdata *) 0xF9CB)
#define    p_reg_mp2if_clk_coeff	0xF9CB 
#define	reg_mp2if_clk_coeff_pos 0
#define	reg_mp2if_clk_coeff_len 7
#define	reg_mp2if_clk_coeff_lsb 0
#define xd_p_reg_tsip_en	(*(volatile byte xdata *) 0xF9CC)
#define    p_reg_tsip_en	0xF9CC 
#define	reg_tsip_en_pos 0
#define	reg_tsip_en_len 1
#define	reg_tsip_en_lsb 0
#define xd_p_reg_tsis_en	(*(volatile byte xdata *) 0xF9CD)
#define    p_reg_tsis_en	0xF9CD 
#define	reg_tsis_en_pos 0
#define	reg_tsis_en_len 1
#define	reg_tsis_en_lsb 0
#define xd_p_reg_tsip_br	(*(volatile byte xdata *) 0xF9CE)
#define    p_reg_tsip_br	0xF9CE 
#define	reg_tsip_br_pos 0
#define	reg_tsip_br_len 1
#define	reg_tsip_br_lsb 0
#define xd_p_reg_tsip_frm_inv	(*(volatile byte xdata *) 0xF9D0)
#define    p_reg_tsip_frm_inv	0xF9D0 
#define	reg_tsip_frm_inv_pos 0
#define	reg_tsip_frm_inv_len 1
#define	reg_tsip_frm_inv_lsb 0
#define xd_p_reg_tsip_str_inv	(*(volatile byte xdata *) 0xF9D1)
#define    p_reg_tsip_str_inv	0xF9D1 
#define	reg_tsip_str_inv_pos 0
#define	reg_tsip_str_inv_len 1
#define	reg_tsip_str_inv_lsb 0
#define xd_p_reg_tsip_fail_inv	(*(volatile byte xdata *) 0xF9D2)
#define    p_reg_tsip_fail_inv	0xF9D2 
#define	reg_tsip_fail_inv_pos 0
#define	reg_tsip_fail_inv_len 1
#define	reg_tsip_fail_inv_lsb 0
#define xd_p_reg_tsip_frm_ignore	(*(volatile byte xdata *) 0xF9D3)
#define    p_reg_tsip_frm_ignore	0xF9D3 
#define	reg_tsip_frm_ignore_pos 0
#define	reg_tsip_frm_ignore_len 1
#define	reg_tsip_frm_ignore_lsb 0
#define xd_p_reg_tsip_str_ignore	(*(volatile byte xdata *) 0xF9D4)
#define    p_reg_tsip_str_ignore	0xF9D4 
#define	reg_tsip_str_ignore_pos 0
#define	reg_tsip_str_ignore_len 1
#define	reg_tsip_str_ignore_lsb 0
#define xd_p_reg_tsip_fail_ignore	(*(volatile byte xdata *) 0xF9D5)
#define    p_reg_tsip_fail_ignore	0xF9D5 
#define	reg_tsip_fail_ignore_pos 0
#define	reg_tsip_fail_ignore_len 1
#define	reg_tsip_fail_ignore_lsb 0
#define xd_p_reg_tsip_endian	(*(volatile byte xdata *) 0xF9D6)
#define    p_reg_tsip_endian	0xF9D6 
#define	reg_tsip_endian_pos 0
#define	reg_tsip_endian_len 1
#define	reg_tsip_endian_lsb 0
#define xd_p_reg_tsip_overflow	(*(volatile byte xdata *) 0xF9D7)
#define    p_reg_tsip_overflow	0xF9D7 
#define	reg_tsip_overflow_pos 0
#define	reg_tsip_overflow_len 1
#define	reg_tsip_overflow_lsb 0
#define xd_p_reg_ts_in_src	(*(volatile byte xdata *) 0xF9D8)
#define    p_reg_ts_in_src	0xF9D8 
#define	reg_ts_in_src_pos 0
#define	reg_ts_in_src_len 1
#define	reg_ts_in_src_lsb 0
#define xd_r_reg_clk_sel	(*(volatile byte xdata *) 0xF9D9)
#define    r_reg_clk_sel	0xF9D9 
#define	reg_clk_sel_pos 0
#define	reg_clk_sel_len 2
#define	reg_clk_sel_lsb 0
#define xd_r_reg_tog_sel	(*(volatile byte xdata *) 0xF9DA)
#define    r_reg_tog_sel	0xF9DA 
#define	reg_tog_sel_pos 0
#define	reg_tog_sel_len 2
#define	reg_tog_sel_lsb 0
#define xd_p_reg_ts_str_ignore	(*(volatile byte xdata *) 0xF9DB)
#define    p_reg_ts_str_ignore	0xF9DB 
#define	reg_ts_str_ignore_pos 0
#define	reg_ts_str_ignore_len 1
#define	reg_ts_str_ignore_lsb 0
#define xd_p_reg_ts_frm_ignore	(*(volatile byte xdata *) 0xF9DC)
#define    p_reg_ts_frm_ignore	0xF9DC 
#define	reg_ts_frm_ignore_pos 0
#define	reg_ts_frm_ignore_len 1
#define	reg_ts_frm_ignore_lsb 0
#define xd_p_reg_clk_sel_fix	(*(volatile byte xdata *) 0xF9DD)
#define    p_reg_clk_sel_fix	0xF9DD 
#define	reg_clk_sel_fix_pos 0
#define	reg_clk_sel_fix_len 2
#define	reg_clk_sel_fix_lsb 0
#define xd_p_reg_tog_sel_fix	(*(volatile byte xdata *) 0xF9DE)
#define    p_reg_tog_sel_fix	0xF9DE 
#define	reg_tog_sel_fix_pos 0
#define	reg_tog_sel_fix_len 2
#define	reg_tog_sel_fix_lsb 0
#define xd_p_reg_en_fix	(*(volatile byte xdata *) 0xF9DF)
#define    p_reg_en_fix	0xF9DF 
#define	reg_en_fix_pos 0
#define	reg_en_fix_len 1
#define	reg_en_fix_lsb 0
#define xd_p_reg_check_tpsd_hier	(*(volatile byte xdata *) 0xF9E0)
#define    p_reg_check_tpsd_hier	0xF9E0 
#define	reg_check_tpsd_hier_pos 0
#define	reg_check_tpsd_hier_len 1
#define	reg_check_tpsd_hier_lsb 0
#define xd_p_reg_err_byte_en	(*(volatile byte xdata *) 0xF9E1)
#define    p_reg_err_byte_en	0xF9E1 
#define	reg_err_byte_en_pos 0
#define	reg_err_byte_en_len 1
#define	reg_err_byte_en_lsb 0
#define xd_p_reg_mp2_f_adc_7_0	(*(volatile byte xdata *) 0xF9E2)
#define    p_reg_mp2_f_adc_7_0	0xF9E2 
#define	reg_mp2_f_adc_7_0_pos 0
#define	reg_mp2_f_adc_7_0_len 8
#define	reg_mp2_f_adc_7_0_lsb 0
#define xd_p_reg_mp2_f_adc_15_8	(*(volatile byte xdata *) 0xF9E3)
#define    p_reg_mp2_f_adc_15_8	0xF9E3 
#define	reg_mp2_f_adc_15_8_pos 0
#define	reg_mp2_f_adc_15_8_len 8
#define	reg_mp2_f_adc_15_8_lsb 8
#define xd_p_reg_mp2_f_adc_23_16	(*(volatile byte xdata *) 0xF9E4)
#define    p_reg_mp2_f_adc_23_16	0xF9E4 
#define	reg_mp2_f_adc_23_16_pos 0
#define	reg_mp2_f_adc_23_16_len 8
#define	reg_mp2_f_adc_23_16_lsb 16
#define xd_p_reg_set_util	(*(volatile byte xdata *) 0xF9E5)
#define    p_reg_set_util	0xF9E5 
#define	reg_set_util_pos 0
#define	reg_set_util_len 8
#define	reg_set_util_lsb 0
#define xd_r_reg_err_byte	(*(volatile byte xdata *) 0xF9E6)
#define    r_reg_err_byte	0xF9E6 
#define	reg_err_byte_pos 0
#define	reg_err_byte_len 8
#define	reg_err_byte_lsb 0
#define xd_p_reg_p_tpsd_lock_trigger	(*(volatile byte xdata *) 0xF9E7)
#define    p_reg_p_tpsd_lock_trigger	0xF9E7 
#define	reg_p_tpsd_lock_trigger_pos 0
#define	reg_p_tpsd_lock_trigger_len 1
#define	reg_p_tpsd_lock_trigger_lsb 0
#define xd_p_reg_i2c_16_8_data_sel	(*(volatile byte xdata *) 0xFB00)
#define    p_reg_i2c_16_8_data_sel	0xFB00 
#define	reg_i2c_16_8_data_sel_pos 0
#define	reg_i2c_16_8_data_sel_len 1
#define	reg_i2c_16_8_data_sel_lsb 0
#define xd_p_reg_i2c_slave_trigger_byte	(*(volatile byte xdata *) 0xFB01)
#define    p_reg_i2c_slave_trigger_byte	0xFB01 
#define	reg_i2c_slave_trigger_byte_pos 0
#define	reg_i2c_slave_trigger_byte_len 1
#define	reg_i2c_slave_trigger_byte_lsb 0
#define xd_p_reg_wdti_level	(*(volatile byte xdata *) 0xFB05)
#define    p_reg_wdti_level	0xFB05 
#define	reg_wdti_level_pos 0
#define	reg_wdti_level_len 1
#define	reg_wdti_level_lsb 0
#define xd_p_reg_rssi_avg_sel_lat	(*(volatile byte xdata *) 0xFB06)
#define    p_reg_rssi_avg_sel_lat	0xFB06 
#define	reg_rssi_avg_sel_lat_pos 0
#define	reg_rssi_avg_sel_lat_len 2
#define	reg_rssi_avg_sel_lat_lsb 0
#define xd_r_ofsm_rssi_avg_7_0	(*(volatile byte xdata *) 0xFB07)
#define    r_ofsm_rssi_avg_7_0	0xFB07 
#define	ofsm_rssi_avg_7_0_pos 0
#define	ofsm_rssi_avg_7_0_len 8
#define	ofsm_rssi_avg_7_0_lsb 0
#define xd_r_ofsm_rssi_avg_9_8	(*(volatile byte xdata *) 0xFB08)
#define    r_ofsm_rssi_avg_9_8	0xFB08 
#define	ofsm_rssi_avg_9_8_pos 0
#define	ofsm_rssi_avg_9_8_len 2
#define	ofsm_rssi_avg_9_8_lsb 8
#define xd_r_ofsm_mbist_fail_mon51	(*(volatile byte xdata *) 0xFB09)
#define    r_ofsm_mbist_fail_mon51	0xFB09 
#define	ofsm_mbist_fail_mon51_pos 0
#define	ofsm_mbist_fail_mon51_len 1
#define	ofsm_mbist_fail_mon51_lsb 0
#define xd_r_ofsm_mbist_fail_com	(*(volatile byte xdata *) 0xFB0A)
#define    r_ofsm_mbist_fail_com	0xFB0A 
#define	ofsm_mbist_fail_com_pos 0
#define	ofsm_mbist_fail_com_len 1
#define	ofsm_mbist_fail_com_lsb 0
#define xd_r_ofsm_mbist_fail_fft	(*(volatile byte xdata *) 0xFB0B)
#define    r_ofsm_mbist_fail_fft	0xFB0B 
#define	ofsm_mbist_fail_fft_pos 0
#define	ofsm_mbist_fail_fft_len 1
#define	ofsm_mbist_fail_fft_lsb 0
#define xd_r_ofsm_mbist_fail_fd	(*(volatile byte xdata *) 0xFB0C)
#define    r_ofsm_mbist_fail_fd	0xFB0C 
#define	ofsm_mbist_fail_fd_pos 0
#define	ofsm_mbist_fail_fd_len 1
#define	ofsm_mbist_fail_fd_lsb 0
#define xd_r_ofsm_mbist_fail_link	(*(volatile byte xdata *) 0xFB0D)
#define    r_ofsm_mbist_fail_link	0xFB0D 
#define	ofsm_mbist_fail_link_pos 0
#define	ofsm_mbist_fail_link_len 1
#define	ofsm_mbist_fail_link_lsb 0
#define xd_r_ofsm_mbist_fail_mpe	(*(volatile byte xdata *) 0xFB0E)
#define    r_ofsm_mbist_fail_mpe	0xFB0E 
#define	ofsm_mbist_fail_mpe_pos 0
#define	ofsm_mbist_fail_mpe_len 1
#define	ofsm_mbist_fail_mpe_lsb 0
#define xd_r_ofsm_mbist_done_mpe	(*(volatile byte xdata *) 0xFB0F)
#define    r_ofsm_mbist_done_mpe	0xFB0F 
#define	ofsm_mbist_done_mpe_pos 0
#define	ofsm_mbist_done_mpe_len 1
#define	ofsm_mbist_done_mpe_lsb 0
#define xd_r_ofsm_mbist_mode_mpe	(*(volatile byte xdata *) 0xFB10)
#define    r_ofsm_mbist_mode_mpe	0xFB10 
#define	ofsm_mbist_mode_mpe_pos 0
#define	ofsm_mbist_mode_mpe_len 1
#define	ofsm_mbist_mode_mpe_lsb 0
#define xd_p_ofsm_cmd_reg	(*(volatile byte xdata *) 0xFB11)
#define    p_ofsm_cmd_reg	0xFB11 
#define	ofsm_cmd_reg_pos 0
#define	ofsm_cmd_reg_len 8
#define	ofsm_cmd_reg_lsb 0
#define xd_p_ofsm_addr_reg_h	(*(volatile byte xdata *) 0xFB12)
#define    p_ofsm_addr_reg_h	0xFB12 
#define	ofsm_addr_reg_h_pos 0
#define	ofsm_addr_reg_h_len 8
#define	ofsm_addr_reg_h_lsb 0
#define xd_p_ofsm_addr_reg_l	(*(volatile byte xdata *) 0xFB13)
#define    p_ofsm_addr_reg_l	0xFB13 
#define	ofsm_addr_reg_l_pos 0
#define	ofsm_addr_reg_l_len 8
#define	ofsm_addr_reg_l_lsb 0
#define xd_p_ofsm_data_reg_0	(*(volatile byte xdata *) 0xFB14)
#define    p_ofsm_data_reg_0	0xFB14 
#define	ofsm_data_reg_0_pos 0
#define	ofsm_data_reg_0_len 8
#define	ofsm_data_reg_0_lsb 0
#define xd_p_ofsm_data_reg_1	(*(volatile byte xdata *) 0xFB15)
#define    p_ofsm_data_reg_1	0xFB15 
#define	ofsm_data_reg_1_pos 0
#define	ofsm_data_reg_1_len 8
#define	ofsm_data_reg_1_lsb 0
#define xd_p_ofsm_data_reg_2	(*(volatile byte xdata *) 0xFB16)
#define    p_ofsm_data_reg_2	0xFB16 
#define	ofsm_data_reg_2_pos 0
#define	ofsm_data_reg_2_len 8
#define	ofsm_data_reg_2_lsb 0
#define xd_p_ofsm_data_reg_3	(*(volatile byte xdata *) 0xFB17)
#define    p_ofsm_data_reg_3	0xFB17 
#define	ofsm_data_reg_3_pos 0
#define	ofsm_data_reg_3_len 8
#define	ofsm_data_reg_3_lsb 0
#define xd_p_ofsm_data_reg_4	(*(volatile byte xdata *) 0xFB18)
#define    p_ofsm_data_reg_4	0xFB18 
#define	ofsm_data_reg_4_pos 0
#define	ofsm_data_reg_4_len 8
#define	ofsm_data_reg_4_lsb 0
#define xd_p_ofsm_data_reg_5	(*(volatile byte xdata *) 0xFB19)
#define    p_ofsm_data_reg_5	0xFB19 
#define	ofsm_data_reg_5_pos 0
#define	ofsm_data_reg_5_len 8
#define	ofsm_data_reg_5_lsb 0
#define xd_p_ofsm_data_reg_6	(*(volatile byte xdata *) 0xFB1A)
#define    p_ofsm_data_reg_6	0xFB1A 
#define	ofsm_data_reg_6_pos 0
#define	ofsm_data_reg_6_len 8
#define	ofsm_data_reg_6_lsb 0
#define xd_p_ofsm_data_reg_7	(*(volatile byte xdata *) 0xFB1B)
#define    p_ofsm_data_reg_7	0xFB1B 
#define	ofsm_data_reg_7_pos 0
#define	ofsm_data_reg_7_len 8
#define	ofsm_data_reg_7_lsb 0
#define xd_p_ofsm_data_reg_8	(*(volatile byte xdata *) 0xFB1C)
#define    p_ofsm_data_reg_8	0xFB1C 
#define	ofsm_data_reg_8_pos 0
#define	ofsm_data_reg_8_len 8
#define	ofsm_data_reg_8_lsb 0
#define xd_p_ofsm_data_reg_9	(*(volatile byte xdata *) 0xFB1D)
#define    p_ofsm_data_reg_9	0xFB1D 
#define	ofsm_data_reg_9_pos 0
#define	ofsm_data_reg_9_len 8
#define	ofsm_data_reg_9_lsb 0
#define xd_p_ofsm_data_reg_10	(*(volatile byte xdata *) 0xFB1E)
#define    p_ofsm_data_reg_10	0xFB1E 
#define	ofsm_data_reg_10_pos 0
#define	ofsm_data_reg_10_len 8
#define	ofsm_data_reg_10_lsb 0
#define xd_p_ofsm_data_reg_11	(*(volatile byte xdata *) 0xFB1F)
#define    p_ofsm_data_reg_11	0xFB1F 
#define	ofsm_data_reg_11_pos 0
#define	ofsm_data_reg_11_len 8
#define	ofsm_data_reg_11_lsb 0
#define xd_p_ofsm_data_reg_12	(*(volatile byte xdata *) 0xFB20)
#define    p_ofsm_data_reg_12	0xFB20 
#define	ofsm_data_reg_12_pos 0
#define	ofsm_data_reg_12_len 8
#define	ofsm_data_reg_12_lsb 0
#define xd_p_ofsm_data_reg_13	(*(volatile byte xdata *) 0xFB21)
#define    p_ofsm_data_reg_13	0xFB21 
#define	ofsm_data_reg_13_pos 0
#define	ofsm_data_reg_13_len 8
#define	ofsm_data_reg_13_lsb 0
#define xd_p_ofsm_data_reg_14	(*(volatile byte xdata *) 0xFB22)
#define    p_ofsm_data_reg_14	0xFB22 
#define	ofsm_data_reg_14_pos 0
#define	ofsm_data_reg_14_len 8
#define	ofsm_data_reg_14_lsb 0
#define xd_p_ofsm_data_reg_15	(*(volatile byte xdata *) 0xFB23)
#define    p_ofsm_data_reg_15	0xFB23 
#define	ofsm_data_reg_15_pos 0
#define	ofsm_data_reg_15_len 8
#define	ofsm_data_reg_15_lsb 0
#define xd_p_reg_afe_mem0	(*(volatile byte xdata *) 0xFB24)
#define    p_reg_afe_mem0	0xFB24 
#define	reg_afe_mem0_pos 0
#define	reg_afe_mem0_len 8
#define	reg_afe_mem0_lsb 0
#define xd_p_reg_afe_mem1	(*(volatile byte xdata *) 0xFB25)
#define    p_reg_afe_mem1	0xFB25 
#define	reg_afe_mem1_pos 0
#define	reg_afe_mem1_len 8
#define	reg_afe_mem1_lsb 0
#define xd_p_reg_afe_mem2	(*(volatile byte xdata *) 0xFB26)
#define    p_reg_afe_mem2	0xFB26 
#define	reg_afe_mem2_pos 0
#define	reg_afe_mem2_len 8
#define	reg_afe_mem2_lsb 0
#define xd_p_reg_afe_mem3	(*(volatile byte xdata *) 0xFB27)
#define    p_reg_afe_mem3	0xFB27 
#define	reg_afe_mem3_pos 0
#define	reg_afe_mem3_len 8
#define	reg_afe_mem3_lsb 0
#define xd_p_reg_afe_mem4	(*(volatile byte xdata *) 0xFB28)
#define    p_reg_afe_mem4	0xFB28 
#define	reg_afe_mem4_pos 0
#define	reg_afe_mem4_len 8
#define	reg_afe_mem4_lsb 0
#define xd_p_reg_afe_mem5	(*(volatile byte xdata *) 0xFB29)
#define    p_reg_afe_mem5	0xFB29 
#define	reg_afe_mem5_pos 0
#define	reg_afe_mem5_len 8
#define	reg_afe_mem5_lsb 0
#define xd_p_reg_afe_mem6	(*(volatile byte xdata *) 0xFB2A)
#define    p_reg_afe_mem6	0xFB2A 
#define	reg_afe_mem6_pos 0
#define	reg_afe_mem6_len 8
#define	reg_afe_mem6_lsb 0
#define xd_p_reg_afe_mem7	(*(volatile byte xdata *) 0xFB2B)
#define    p_reg_afe_mem7	0xFB2B 
#define	reg_afe_mem7_pos 0
