liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_afe_mem7_len 8
#define	reg_afe_mem7_lsb 0
#define xd_p_reg_i2cbootreq	(*(volatile byte xdata *) 0xFB2C)
#define    p_reg_i2cbootreq	0xFB2C 
#define	reg_i2cbootreq_pos 0
#define	reg_i2cbootreq_len 1
#define	reg_i2cbootreq_lsb 0
#define xd_p_reg_rst_i2cm	(*(volatile byte xdata *) 0xFB30)
#define    p_reg_rst_i2cm	0xFB30 
#define	reg_rst_i2cm_pos 0
#define	reg_rst_i2cm_len 1
#define	reg_rst_i2cm_lsb 0
#define xd_p_reg_rst_i2cs	(*(volatile byte xdata *) 0xFB31)
#define    p_reg_rst_i2cs	0xFB31 
#define	reg_rst_i2cs_pos 0
#define	reg_rst_i2cs_len 1
#define	reg_rst_i2cs_lsb 0
#define xd_r_reg_top_gpioscli	(*(volatile byte xdata *) 0xFB32)
#define    r_reg_top_gpioscli	0xFB32 
#define	reg_top_gpioscli_pos 0
#define	reg_top_gpioscli_len 1
#define	reg_top_gpioscli_lsb 0
#define xd_p_reg_top_gpiosclo	(*(volatile byte xdata *) 0xFB33)
#define    p_reg_top_gpiosclo	0xFB33 
#define	reg_top_gpiosclo_pos 0
#define	reg_top_gpiosclo_len 1
#define	reg_top_gpiosclo_lsb 0
#define xd_p_reg_top_gpiosclen	(*(volatile byte xdata *) 0xFB34)
#define    p_reg_top_gpiosclen	0xFB34 
#define	reg_top_gpiosclen_pos 0
#define	reg_top_gpiosclen_len 1
#define	reg_top_gpiosclen_lsb 0
#define xd_p_reg_top_gpiosclon	(*(volatile byte xdata *) 0xFB35)
#define    p_reg_top_gpiosclon	0xFB35 
#define	reg_top_gpiosclon_pos 0
#define	reg_top_gpiosclon_len 1
#define	reg_top_gpiosclon_lsb 0
#define xd_r_reg_top_gpiosdai	(*(volatile byte xdata *) 0xFB36)
#define    r_reg_top_gpiosdai	0xFB36 
//#define	reg_top_gpiosdai_pos 0
//#define	reg_top_gpiosdai_len 1
//#define	reg_top_gpiosdai_lsb 0
#define xd_p_reg_top_gpiosdao	(*(volatile byte xdata *) 0xFB37)
#define    p_reg_top_gpiosdao	0xFB37 
#define	reg_top_gpiosdao_pos 0
#define	reg_top_gpiosdao_len 1
#define	reg_top_gpiosdao_lsb 0
#define xd_p_reg_top_gpiosdaen	(*(volatile byte xdata *) 0xFB38)
#define    p_reg_top_gpiosdaen	0xFB38 
#define	reg_top_gpiosdaen_pos 0
#define	reg_top_gpiosdaen_len 1
#define	reg_top_gpiosdaen_lsb 0
#define xd_p_reg_top_gpiosdaon	(*(volatile byte xdata *) 0xFB39)
#define    p_reg_top_gpiosdaon	0xFB39 
#define	reg_top_gpiosdaon_pos 0
#define	reg_top_gpiosdaon_len 1
#define	reg_top_gpiosdaon_lsb 0
#define xd_p_reg_fix_rom_en	(*(volatile byte xdata *) 0xFB3A)
#define    p_reg_fix_rom_en	0xFB3A 
#define	reg_fix_rom_en_pos 0
#define	reg_fix_rom_en_len 1
#define	reg_fix_rom_en_lsb 0
#define xd_p_reg_ofsm_bug_addh_0	(*(volatile byte xdata *) 0xFB3B)
#define    p_reg_ofsm_bug_addh_0	0xFB3B 
#define	reg_ofsm_bug_addh_0_pos 0
#define	reg_ofsm_bug_addh_0_len 8
#define	reg_ofsm_bug_addh_0_lsb 0
#define xd_p_reg_ofsm_bug_addl_0	(*(volatile byte xdata *) 0xFB3C)
#define    p_reg_ofsm_bug_addl_0	0xFB3C 
#define	reg_ofsm_bug_addl_0_pos 0
#define	reg_ofsm_bug_addl_0_len 8
#define	reg_ofsm_bug_addl_0_lsb 0
#define xd_p_reg_ofsm_bug_addh_1	(*(volatile byte xdata *) 0xFB3D)
#define    p_reg_ofsm_bug_addh_1	0xFB3D 
#define	reg_ofsm_bug_addh_1_pos 0
#define	reg_ofsm_bug_addh_1_len 8
#define	reg_ofsm_bug_addh_1_lsb 0
#define xd_p_reg_ofsm_bug_addl_1	(*(volatile byte xdata *) 0xFB3E)
#define    p_reg_ofsm_bug_addl_1	0xFB3E 
#define	reg_ofsm_bug_addl_1_pos 0
#define	reg_ofsm_bug_addl_1_len 8
#define	reg_ofsm_bug_addl_1_lsb 0
#define xd_p_reg_ofsm_bug_addh_2	(*(volatile byte xdata *) 0xFB3F)
#define    p_reg_ofsm_bug_addh_2	0xFB3F 
#define	reg_ofsm_bug_addh_2_pos 0
#define	reg_ofsm_bug_addh_2_len 8
#define	reg_ofsm_bug_addh_2_lsb 0
#define xd_p_reg_ofsm_bug_addl_2	(*(volatile byte xdata *) 0xFB40)
#define    p_reg_ofsm_bug_addl_2	0xFB40 
#define	reg_ofsm_bug_addl_2_pos 0
#define	reg_ofsm_bug_addl_2_len 8
#define	reg_ofsm_bug_addl_2_lsb 0
#define xd_p_reg_ofsm_bug_addh_3	(*(volatile byte xdata *) 0xFB41)
#define    p_reg_ofsm_bug_addh_3	0xFB41 
#define	reg_ofsm_bug_addh_3_pos 0
#define	reg_ofsm_bug_addh_3_len 8
#define	reg_ofsm_bug_addh_3_lsb 0
#define xd_p_reg_ofsm_bug_addl_3	(*(volatile byte xdata *) 0xFB42)
#define    p_reg_ofsm_bug_addl_3	0xFB42 
#define	reg_ofsm_bug_addl_3_pos 0
#define	reg_ofsm_bug_addl_3_len 8
#define	reg_ofsm_bug_addl_3_lsb 0
#define xd_p_reg_ofsm_bug_addh_4	(*(volatile byte xdata *) 0xFB43)
#define    p_reg_ofsm_bug_addh_4	0xFB43 
#define	reg_ofsm_bug_addh_4_pos 0
#define	reg_ofsm_bug_addh_4_len 8
#define	reg_ofsm_bug_addh_4_lsb 0
#define xd_p_reg_ofsm_bug_addl_4	(*(volatile byte xdata *) 0xFB44)
#define    p_reg_ofsm_bug_addl_4	0xFB44 
#define	reg_ofsm_bug_addl_4_pos 0
#define	reg_ofsm_bug_addl_4_len 8
#define	reg_ofsm_bug_addl_4_lsb 0
#define xd_p_reg_ofsm_bug_addh_5	(*(volatile byte xdata *) 0xFB45)
#define    p_reg_ofsm_bug_addh_5	0xFB45 
#define	reg_ofsm_bug_addh_5_pos 0
#define	reg_ofsm_bug_addh_5_len 8
#define	reg_ofsm_bug_addh_5_lsb 0
#define xd_p_reg_ofsm_bug_addl_5	(*(volatile byte xdata *) 0xFB46)
#define    p_reg_ofsm_bug_addl_5	0xFB46 
#define	reg_ofsm_bug_addl_5_pos 0
#define	reg_ofsm_bug_addl_5_len 8
#define	reg_ofsm_bug_addl_5_lsb 0
#define xd_p_reg_ofsm_bug_addh_6	(*(volatile byte xdata *) 0xFB47)
#define    p_reg_ofsm_bug_addh_6	0xFB47 
#define	reg_ofsm_bug_addh_6_pos 0
#define	reg_ofsm_bug_addh_6_len 8
#define	reg_ofsm_bug_addh_6_lsb 0
#define xd_p_reg_ofsm_bug_addl_6	(*(volatile byte xdata *) 0xFB48)
#define    p_reg_ofsm_bug_addl_6	0xFB48 
#define	reg_ofsm_bug_addl_6_pos 0
#define	reg_ofsm_bug_addl_6_len 8
#define	reg_ofsm_bug_addl_6_lsb 0
#define xd_p_reg_ofsm_bug_addh_7	(*(volatile byte xdata *) 0xFB49)
#define    p_reg_ofsm_bug_addh_7	0xFB49 
#define	reg_ofsm_bug_addh_7_pos 0
#define	reg_ofsm_bug_addh_7_len 8
#define	reg_ofsm_bug_addh_7_lsb 0
#define xd_p_reg_ofsm_bug_addl_7	(*(volatile byte xdata *) 0xFB4A)
#define    p_reg_ofsm_bug_addl_7	0xFB4A 
#define	reg_ofsm_bug_addl_7_pos 0
#define	reg_ofsm_bug_addl_7_len 8
#define	reg_ofsm_bug_addl_7_lsb 0
#define xd_p_reg_ofsm_bug_addh_8	(*(volatile byte xdata *) 0xFB4B)
#define    p_reg_ofsm_bug_addh_8	0xFB4B 
#define	reg_ofsm_bug_addh_8_pos 0
#define	reg_ofsm_bug_addh_8_len 8
#define	reg_ofsm_bug_addh_8_lsb 0
#define xd_p_reg_ofsm_bug_addl_8	(*(volatile byte xdata *) 0xFB4C)
#define    p_reg_ofsm_bug_addl_8	0xFB4C 
#define	reg_ofsm_bug_addl_8_pos 0
#define	reg_ofsm_bug_addl_8_len 8
#define	reg_ofsm_bug_addl_8_lsb 0
#define xd_p_reg_ofsm_bug_addh_9	(*(volatile byte xdata *) 0xFB4D)
#define    p_reg_ofsm_bug_addh_9	0xFB4D 
#define	reg_ofsm_bug_addh_9_pos 0
#define	reg_ofsm_bug_addh_9_len 8
#define	reg_ofsm_bug_addh_9_lsb 0
#define xd_p_reg_ofsm_bug_addl_9	(*(volatile byte xdata *) 0xFB4E)
#define    p_reg_ofsm_bug_addl_9	0xFB4E 
#define	reg_ofsm_bug_addl_9_pos 0
#define	reg_ofsm_bug_addl_9_len 8
#define	reg_ofsm_bug_addl_9_lsb 0
#define xd_p_reg_ofsm_bug_addh_10	(*(volatile byte xdata *) 0xFB4F)
#define    p_reg_ofsm_bug_addh_10	0xFB4F 
#define	reg_ofsm_bug_addh_10_pos 0
#define	reg_ofsm_bug_addh_10_len 8
#define	reg_ofsm_bug_addh_10_lsb 0
#define xd_p_reg_ofsm_bug_addl_10	(*(volatile byte xdata *) 0xFB50)
#define    p_reg_ofsm_bug_addl_10	0xFB50 
#define	reg_ofsm_bug_addl_10_pos 0
#define	reg_ofsm_bug_addl_10_len 8
#define	reg_ofsm_bug_addl_10_lsb 0
#define xd_p_reg_ofsm_bug_addh_11	(*(volatile byte xdata *) 0xFB51)
#define    p_reg_ofsm_bug_addh_11	0xFB51 
#define	reg_ofsm_bug_addh_11_pos 0
#define	reg_ofsm_bug_addh_11_len 8
#define	reg_ofsm_bug_addh_11_lsb 0
#define xd_p_reg_ofsm_bug_addl_11	(*(volatile byte xdata *) 0xFB52)
#define    p_reg_ofsm_bug_addl_11	0xFB52 
#define	reg_ofsm_bug_addl_11_pos 0
#define	reg_ofsm_bug_addl_11_len 8
#define	reg_ofsm_bug_addl_11_lsb 0
#define xd_p_reg_ofsm_bug_addh_12	(*(volatile byte xdata *) 0xFB53)
#define    p_reg_ofsm_bug_addh_12	0xFB53 
#define	reg_ofsm_bug_addh_12_pos 0
#define	reg_ofsm_bug_addh_12_len 8
#define	reg_ofsm_bug_addh_12_lsb 0
#define xd_p_reg_ofsm_bug_addl_12	(*(volatile byte xdata *) 0xFB54)
#define    p_reg_ofsm_bug_addl_12	0xFB54 
#define	reg_ofsm_bug_addl_12_pos 0
#define	reg_ofsm_bug_addl_12_len 8
#define	reg_ofsm_bug_addl_12_lsb 0
#define xd_p_reg_ofsm_bug_addh_13	(*(volatile byte xdata *) 0xFB55)
#define    p_reg_ofsm_bug_addh_13	0xFB55 
#define	reg_ofsm_bug_addh_13_pos 0
#define	reg_ofsm_bug_addh_13_len 8
#define	reg_ofsm_bug_addh_13_lsb 0
#define xd_p_reg_ofsm_bug_addl_13	(*(volatile byte xdata *) 0xFB56)
#define    p_reg_ofsm_bug_addl_13	0xFB56 
#define	reg_ofsm_bug_addl_13_pos 0
#define	reg_ofsm_bug_addl_13_len 8
#define	reg_ofsm_bug_addl_13_lsb 0
#define xd_p_reg_ofsm_bug_addh_14	(*(volatile byte xdata *) 0xFB57)
#define    p_reg_ofsm_bug_addh_14	0xFB57 
#define	reg_ofsm_bug_addh_14_pos 0
#define	reg_ofsm_bug_addh_14_len 8
#define	reg_ofsm_bug_addh_14_lsb 0
#define xd_p_reg_ofsm_bug_addl_14	(*(volatile byte xdata *) 0xFB58)
#define    p_reg_ofsm_bug_addl_14	0xFB58 
#define	reg_ofsm_bug_addl_14_pos 0
#define	reg_ofsm_bug_addl_14_len 8
#define	reg_ofsm_bug_addl_14_lsb 0
#define xd_p_reg_ofsm_bug_addh_15	(*(volatile byte xdata *) 0xFB59)
#define    p_reg_ofsm_bug_addh_15	0xFB59 
#define	reg_ofsm_bug_addh_15_pos 0
#define	reg_ofsm_bug_addh_15_len 8
#define	reg_ofsm_bug_addh_15_lsb 0
#define xd_p_reg_ofsm_bug_addl_15	(*(volatile byte xdata *) 0xFB5A)
#define    p_reg_ofsm_bug_addl_15	0xFB5A 
#define	reg_ofsm_bug_addl_15_pos 0
#define	reg_ofsm_bug_addl_15_len 8
#define	reg_ofsm_bug_addl_15_lsb 0
#define xd_p_reg_ofsm_jmp_addh_0	(*(volatile byte xdata *) 0xFB5B)
#define    p_reg_ofsm_jmp_addh_0	0xFB5B 
#define	reg_ofsm_jmp_addh_0_pos 0
#define	reg_ofsm_jmp_addh_0_len 8
#define	reg_ofsm_jmp_addh_0_lsb 0
#define xd_p_reg_ofsm_jmp_addl_0	(*(volatile byte xdata *) 0xFB5C)
#define    p_reg_ofsm_jmp_addl_0	0xFB5C 
#define	reg_ofsm_jmp_addl_0_pos 0
#define	reg_ofsm_jmp_addl_0_len 8
#define	reg_ofsm_jmp_addl_0_lsb 0
#define xd_p_reg_ofsm_jmp_addh_1	(*(volatile byte xdata *) 0xFB5D)
#define    p_reg_ofsm_jmp_addh_1	0xFB5D 
#define	reg_ofsm_jmp_addh_1_pos 0
#define	reg_ofsm_jmp_addh_1_len 8
#define	reg_ofsm_jmp_addh_1_lsb 0
#define xd_p_reg_ofsm_jmp_addl_1	(*(volatile byte xdata *) 0xFB5E)
#define    p_reg_ofsm_jmp_addl_1	0xFB5E 
#define	reg_ofsm_jmp_addl_1_pos 0
#define	reg_ofsm_jmp_addl_1_len 8
#define	reg_ofsm_jmp_addl_1_lsb 0
#define xd_p_reg_ofsm_jmp_addh_2	(*(volatile byte xdata *) 0xFB5F)
#define    p_reg_ofsm_jmp_addh_2	0xFB5F 
#define	reg_ofsm_jmp_addh_2_pos 0
#define	reg_ofsm_jmp_addh_2_len 8
#define	reg_ofsm_jmp_addh_2_lsb 0
#define xd_p_reg_ofsm_jmp_addl_2	(*(volatile byte xdata *) 0xFB60)
#define    p_reg_ofsm_jmp_addl_2	0xFB60 
#define	reg_ofsm_jmp_addl_2_pos 0
#define	reg_ofsm_jmp_addl_2_len 8
#define	reg_ofsm_jmp_addl_2_lsb 0
#define xd_p_reg_ofsm_jmp_addh_3	(*(volatile byte xdata *) 0xFB61)
#define    p_reg_ofsm_jmp_addh_3	0xFB61 
#define	reg_ofsm_jmp_addh_3_pos 0
#define	reg_ofsm_jmp_addh_3_len 8
#define	reg_ofsm_jmp_addh_3_lsb 0
#define xd_p_reg_ofsm_jmp_addl_3	(*(volatile byte xdata *) 0xFB62)
#define    p_reg_ofsm_jmp_addl_3	0xFB62 
#define	reg_ofsm_jmp_addl_3_pos 0
#define	reg_ofsm_jmp_addl_3_len 8
#define	reg_ofsm_jmp_addl_3_lsb 0
#define xd_p_reg_ofsm_jmp_addh_4	(*(volatile byte xdata *) 0xFB63)
#define    p_reg_ofsm_jmp_addh_4	0xFB63 
#define	reg_ofsm_jmp_addh_4_pos 0
#define	reg_ofsm_jmp_addh_4_len 8
#define	reg_ofsm_jmp_addh_4_lsb 0
#define xd_p_reg_ofsm_jmp_addl_4	(*(volatile byte xdata *) 0xFB64)
#define    p_reg_ofsm_jmp_addl_4	0xFB64 
#define	reg_ofsm_jmp_addl_4_pos 0
#define	reg_ofsm_jmp_addl_4_len 8
#define	reg_ofsm_jmp_addl_4_lsb 0
#define xd_p_reg_ofsm_jmp_addh_5	(*(volatile byte xdata *) 0xFB65)
#define    p_reg_ofsm_jmp_addh_5	0xFB65 
#define	reg_ofsm_jmp_addh_5_pos 0
#define	reg_ofsm_jmp_addh_5_len 8
#define	reg_ofsm_jmp_addh_5_lsb 0
#define xd_p_reg_ofsm_jmp_addl_5	(*(volatile byte xdata *) 0xFB66)
#define    p_reg_ofsm_jmp_addl_5	0xFB66 
#define	reg_ofsm_jmp_addl_5_pos 0
#define	reg_ofsm_jmp_addl_5_len 8
#define	reg_ofsm_jmp_addl_5_lsb 0
#define xd_p_reg_ofsm_jmp_addh_6	(*(volatile byte xdata *) 0xFB67)
#define    p_reg_ofsm_jmp_addh_6	0xFB67 
#define	reg_ofsm_jmp_addh_6_pos 0
#define	reg_ofsm_jmp_addh_6_len 8
#define	reg_ofsm_jmp_addh_6_lsb 0
#define xd_p_reg_ofsm_jmp_addl_6	(*(volatile byte xdata *) 0xFB68)
#define    p_reg_ofsm_jmp_addl_6	0xFB68 
#define	reg_ofsm_jmp_addl_6_pos 0
#define	reg_ofsm_jmp_addl_6_len 8
#define	reg_ofsm_jmp_addl_6_lsb 0
#define xd_p_reg_ofsm_jmp_addh_7	(*(volatile byte xdata *) 0xFB69)
#define    p_reg_ofsm_jmp_addh_7	0xFB69 
#define	reg_ofsm_jmp_addh_7_pos 0
#define	reg_ofsm_jmp_addh_7_len 8
#define	reg_ofsm_jmp_addh_7_lsb 0
#define xd_p_reg_ofsm_jmp_addl_7	(*(volatile byte xdata *) 0xFB6A)
#define    p_reg_ofsm_jmp_addl_7	0xFB6A 
#define	reg_ofsm_jmp_addl_7_pos 0
#define	reg_ofsm_jmp_addl_7_len 8
#define	reg_ofsm_jmp_addl_7_lsb 0
#define xd_p_reg_ofsm_jmp_addh_8	(*(volatile byte xdata *) 0xFB6B)
#define    p_reg_ofsm_jmp_addh_8	0xFB6B 
#define	reg_ofsm_jmp_addh_8_pos 0
#define	reg_ofsm_jmp_addh_8_len 8
#define	reg_ofsm_jmp_addh_8_lsb 0
#define xd_p_reg_ofsm_jmp_addl_8	(*(volatile byte xdata *) 0xFB6C)
#define    p_reg_ofsm_jmp_addl_8	0xFB6C 
#define	reg_ofsm_jmp_addl_8_pos 0
#define	reg_ofsm_jmp_addl_8_len 8
#define	reg_ofsm_jmp_addl_8_lsb 0
#define xd_p_reg_ofsm_jmp_addh_9	(*(volatile byte xdata *) 0xFB6D)
#define    p_reg_ofsm_jmp_addh_9	0xFB6D 
#define	reg_ofsm_jmp_addh_9_pos 0
#define	reg_ofsm_jmp_addh_9_len 8
#define	reg_ofsm_jmp_addh_9_lsb 0
#define xd_p_reg_ofsm_jmp_addl_9	(*(volatile byte xdata *) 0xFB6E)
#define    p_reg_ofsm_jmp_addl_9	0xFB6E 
#define	reg_ofsm_jmp_addl_9_pos 0
#define	reg_ofsm_jmp_addl_9_len 8
#define	reg_ofsm_jmp_addl_9_lsb 0
#define xd_p_reg_ofsm_jmp_addh_10	(*(volatile byte xdata *) 0xFB6F)
#define    p_reg_ofsm_jmp_addh_10	0xFB6F 
#define	reg_ofsm_jmp_addh_10_pos 0
#define	reg_ofsm_jmp_addh_10_len 8
#define	reg_ofsm_jmp_addh_10_lsb 0
#define xd_p_reg_ofsm_jmp_addl_10	(*(volatile byte xdata *) 0xFB70)
#define    p_reg_ofsm_jmp_addl_10	0xFB70 
#define	reg_ofsm_jmp_addl_10_pos 0
#define	reg_ofsm_jmp_addl_10_len 8
#define	reg_ofsm_jmp_addl_10_lsb 0
#define xd_p_reg_ofsm_jmp_addh_11	(*(volatile byte xdata *) 0xFB71)
#define    p_reg_ofsm_jmp_addh_11	0xFB71 
#define	reg_ofsm_jmp_addh_11_pos 0
#define	reg_ofsm_jmp_addh_11_len 8
#define	reg_ofsm_jmp_addh_11_lsb 0
#define xd_p_reg_ofsm_jmp_addl_11	(*(volatile byte xdata *) 0xFB72)
#define    p_reg_ofsm_jmp_addl_11	0xFB72 
#define	reg_ofsm_jmp_addl_11_pos 0
#define	reg_ofsm_jmp_addl_11_len 8
#define	reg_ofsm_jmp_addl_11_lsb 0
#define xd_p_reg_ofsm_jmp_addh_12	(*(volatile byte xdata *) 0xFB73)
#define    p_reg_ofsm_jmp_addh_12	0xFB73 
#define	reg_ofsm_jmp_addh_12_pos 0
#define	reg_ofsm_jmp_addh_12_len 8
#define	reg_ofsm_jmp_addh_12_lsb 0
#define xd_p_reg_ofsm_jmp_addl_12	(*(volatile byte xdata *) 0xFB74)
#define    p_reg_ofsm_jmp_addl_12	0xFB74 
#define	reg_ofsm_jmp_addl_12_pos 0
#define	reg_ofsm_jmp_addl_12_len 8
#define	reg_ofsm_jmp_addl_12_lsb 0
#define xd_p_reg_ofsm_jmp_addh_13	(*(volatile byte xdata *) 0xFB75)
#define    p_reg_ofsm_jmp_addh_13	0xFB75 
#define	reg_ofsm_jmp_addh_13_pos 0
#define	reg_ofsm_jmp_addh_13_len 8
#define	reg_ofsm_jmp_addh_13_lsb 0
#define xd_p_reg_ofsm_jmp_addl_13	(*(volatile byte xdata *) 0xFB76)
#define    p_reg_ofsm_jmp_addl_13	0xFB76 
#define	reg_ofsm_jmp_addl_13_pos 0
#define	reg_ofsm_jmp_addl_13_len 8
#define	reg_ofsm_jmp_addl_13_lsb 0
#define xd_p_reg_ofsm_jmp_addh_14	(*(volatile byte xdata *) 0xFB77)
#define    p_reg_ofsm_jmp_addh_14	0xFB77 
#define	reg_ofsm_jmp_addh_14_pos 0
#define	reg_ofsm_jmp_addh_14_len 8
#define	reg_ofsm_jmp_addh_14_lsb 0
#define xd_p_reg_ofsm_jmp_addl_14	(*(volatile byte xdata *) 0xFB78)
#define    p_reg_ofsm_jmp_addl_14	0xFB78 
#define	reg_ofsm_jmp_addl_14_pos 0
#define	reg_ofsm_jmp_addl_14_len 8
#define	reg_ofsm_jmp_addl_14_lsb 0
#define xd_p_reg_ofsm_jmp_addh_15	(*(volatile byte xdata *) 0xFB79)
#define    p_reg_ofsm_jmp_addh_15	0xFB79 
#define	reg_ofsm_jmp_addh_15_pos 0
#define	reg_ofsm_jmp_addh_15_len 8
#define	reg_ofsm_jmp_addh_15_lsb 0
#define xd_p_reg_ofsm_jmp_addl_15	(*(volatile byte xdata *) 0xFB7A)
#define    p_reg_ofsm_jmp_addl_15	0xFB7A 
#define	reg_ofsm_jmp_addl_15_pos 0
#define	reg_ofsm_jmp_addl_15_len 8
#define	reg_ofsm_jmp_addl_15_lsb 0
#define xd_p_reg_sw_mon51	(*(volatile byte xdata *) 0xFB7B)
#define    p_reg_sw_mon51	0xFB7B 
#define	reg_sw_mon51_pos 0
#define	reg_sw_mon51_len 7
#define	reg_sw_mon51_lsb 0
#define xd_p_reg_ofdm_mon51_flag	(*(volatile byte xdata *) 0xFB7C)
#define    p_reg_ofdm_mon51_flag	0xFB7C 
#define	reg_ofdm_mon51_flag_pos 0
#define	reg_ofdm_mon51_flag_len 1
#define	reg_ofdm_mon51_flag_lsb 0
#define xd_p_reg_ofdm_force_mon51	(*(volatile byte xdata *) 0xFB7D)
#define    p_reg_ofdm_force_mon51	0xFB7D 
#define	reg_ofdm_force_mon51_pos 0
#define	reg_ofdm_force_mon51_len 1
#define	reg_ofdm_force_mon51_lsb 0
#define xd_p_reg_ofdm_which_cpu	(*(volatile byte xdata *) 0xFB7E)
#define    p_reg_ofdm_which_cpu	0xFB7E 
#define	reg_ofdm_which_cpu_pos 0
#define	reg_ofdm_which_cpu_len 1
#define	reg_ofdm_which_cpu_lsb 0
#define xd_p_reg_ofdm_code_ready	(*(volatile byte xdata *) 0xFB7F)
#define    p_reg_ofdm_code_ready	0xFB7F 
#define	reg_ofdm_code_ready_pos 0
#define	reg_ofdm_code_ready_len 1
#define	reg_ofdm_code_ready_lsb 0
#define xd_p_reg_ofdm_mailbox_wend	(*(volatile byte xdata *) 0xFB80)
#define    p_reg_ofdm_mailbox_wend	0xFB80 
#define	reg_ofdm_mailbox_wend_pos 0
#define	reg_ofdm_mailbox_wend_len 1
#define	reg_ofdm_mailbox_wend_lsb 0
#define xd_r_reg_fast_slow_train	(*(volatile byte xdata *) 0xFB81)
#define    r_reg_fast_slow_train	0xFB81 
#define	reg_fast_slow_train_pos 0
#define	reg_fast_slow_train_len 1
#define	reg_fast_slow_train_lsb 0
#define xd_p_reg_ofdm_mailbox_wptr	(*(volatile byte xdata *) 0xFB82)
#define    p_reg_ofdm_mailbox_wptr	0xFB82 
#define	reg_ofdm_mailbox_wptr_pos 0
#define	reg_ofdm_mailbox_wptr_len 8
#define	reg_ofdm_mailbox_wptr_lsb 0
#define xd_p_reg_ofdm_mailbox_int	(*(volatile byte xdata *) 0xFB86)
#define    p_reg_ofdm_mailbox_int	0xFB86 
#define	reg_ofdm_mailbox_int_pos 0
#define	reg_ofdm_mailbox_int_len 1
#define	reg_ofdm_mailbox_int_lsb 0
#define xd_p_reg_ofdm_lnk2ofdm_int	(*(volatile byte xdata *) 0xFB87)
#define    p_reg_ofdm_lnk2ofdm_int	0xFB87 
#define	reg_ofdm_lnk2ofdm_int_pos 0
#define	reg_ofdm_lnk2ofdm_int_len 1
#define	reg_ofdm_lnk2ofdm_int_lsb 0
#define xd_p_reg_ofdm_ofdm2lnk_int	(*(volatile byte xdata *) 0xFB88)
#define    p_reg_ofdm_ofdm2lnk_int	0xFB88 
#define	reg_ofdm_ofdm2lnk_int_pos 0
#define	reg_ofdm_ofdm2lnk_int_len 1
#define	reg_ofdm_ofdm2lnk_int_lsb 0
#define xd_r_reg_load_ofdm_reg	(*(volatile byte xdata *) 0xFB8F)
#define    r_reg_load_ofdm_reg	0xFB8F 
#define	reg_load_ofdm_reg_pos 0
#define	reg_load_ofdm_reg_len 1
#define	reg_load_ofdm_reg_lsb 0
#define xd_p_reg_lnk_mbx_rd_length_7_0	(*(volatile byte xdata *) 0xFB90)
#define    p_reg_lnk_mbx_rd_length_7_0	0xFB90 
#define	reg_lnk_mbx_rd_length_7_0_pos 0
#define	reg_lnk_mbx_rd_length_7_0_len 8
#define	reg_lnk_mbx_rd_length_7_0_lsb 0
#define xd_p_reg_lnk_mbx_rd_length_15_8	(*(volatile byte xdata *) 0xFB91)
#define    p_reg_lnk_mbx_rd_length_15_8	0xFB91 
#define	reg_lnk_mbx_rd_length_15_8_pos 0
#define	reg_lnk_mbx_rd_length_15_8_len 8
#define	reg_lnk_mbx_rd_length_15_8_lsb 8
#define xd_p_reg_lnk_mbx_rd_length_17_16	(*(volatile byte xdata *) 0xFB92)
#define    p_reg_lnk_mbx_rd_length_17_16	0xFB92 
#define	reg_lnk_mbx_rd_length_17_16_pos 0
#define	reg_lnk_mbx_rd_length_17_16_len 2
#define	reg_lnk_mbx_rd_length_17_16_lsb 16
#define xd_p_reg_lnk_rd_data_sel	(*(volatile byte xdata *) 0xFB93)
#define    p_reg_lnk_rd_data_sel	0xFB93 
#define	reg_lnk_rd_data_sel_pos 0
#define	reg_lnk_rd_data_sel_len 2
#define	reg_lnk_rd_data_sel_lsb 0
#define xd_p_reg_ofdm2lnk_data_7_0	(*(volatile byte xdata *) 0xFB96)
#define    p_reg_ofdm2lnk_data_7_0	0xFB96 
#define	reg_ofdm2lnk_data_7_0_pos 0
#define	reg_ofdm2lnk_data_7_0_len 8
#define	reg_ofdm2lnk_data_7_0_lsb 0
#define xd_p_reg_ofdm2lnk_data_15_8	(*(volatile byte xdata *) 0xFB97)
#define    p_reg_ofdm2lnk_data_15_8	0xFB97 
#define	reg_ofdm2lnk_data_15_8_pos 0
#define	reg_ofdm2lnk_data_15_8_len 8
#define	reg_ofdm2lnk_data_15_8_lsb 8
#define xd_p_reg_ofdm2lnk_data_23_16	(*(volatile byte xdata *) 0xFB98)
#define    p_reg_ofdm2lnk_data_23_16	0xFB98 
#define	reg_ofdm2lnk_data_23_16_pos 0
#define	reg_ofdm2lnk_data_23_16_len 8
#define	reg_ofdm2lnk_data_23_16_lsb 16
#define xd_p_reg_ofdm2lnk_data_31_24	(*(volatile byte xdata *) 0xFB99)
#define    p_reg_ofdm2lnk_data_31_24	0xFB99 
#define	reg_ofdm2lnk_data_31_24_pos 0
#define	reg_ofdm2lnk_data_31_24_len 8
#define	reg_ofdm2lnk_data_31_24_lsb 24
#define xd_p_reg_ofdm2lnk_data_39_32	(*(volatile byte xdata *) 0xFB9A)
#define    p_reg_ofdm2lnk_data_39_32	0xFB9A 
#define	reg_ofdm2lnk_data_39_32_pos 0
#define	reg_ofdm2lnk_data_39_32_len 8
#define	reg_ofdm2lnk_data_39_32_lsb 32
#define xd_p_reg_ofdm2lnk_data_47_40	(*(volatile byte xdata *) 0xFB9B)
#define    p_reg_ofdm2lnk_data_47_40	0xFB9B 
#define	reg_ofdm2lnk_data_47_40_pos 0
#define	reg_ofdm2lnk_data_47_40_len 8
#define	reg_ofdm2lnk_data_47_40_lsb 40
#define xd_p_reg_ofdm2lnk_data_55_48	(*(volatile byte xdata *) 0xFB9C)
#define    p_reg_ofdm2lnk_data_55_48	0xFB9C 
#define	reg_ofdm2lnk_data_55_48_pos 0
#define	reg_ofdm2lnk_data_55_48_len 8
#define	reg_ofdm2lnk_data_55_48_lsb 48
#define xd_p_reg_ofdm2lnk_data_63_56	(*(volatile byte xdata *) 0xFB9D)
#define    p_reg_ofdm2lnk_data_63_56	0xFB9D 
#define	reg_ofdm2lnk_data_63_56_pos 0
#define	reg_ofdm2lnk_data_63_56_len 8
#define	reg_ofdm2lnk_data_63_56_lsb 56
#define xd_p_reg_lnktoofdm_data_7_0	(*(volatile byte xdata *) 0xFB9E)
#define    p_reg_lnktoofdm_data_7_0	0xFB9E 
#define	reg_lnktoofdm_data_7_0_pos 0
#define	reg_lnktoofdm_data_7_0_len 8
#define	reg_lnktoofdm_data_7_0_lsb 0
#define xd_p_reg_lnktoofdm_data_15_8	(*(volatile byte xdata *) 0xFB9F)
#define    p_reg_lnktoofdm_data_15_8	0xFB9F 
#define	reg_lnktoofdm_data_15_8_pos 0
#define	reg_lnktoofdm_data_15_8_len 8
#define	reg_lnktoofdm_data_15_8_lsb 8
#define xd_p_reg_lnktoofdm_data_23_16	(*(volatile byte xdata *) 0xFBA0)
#define    p_reg_lnktoofdm_data_23_16	0xFBA0 
#define	reg_lnktoofdm_data_23_16_pos 0
#define	reg_lnktoofdm_data_23_16_len 8
#define	reg_lnktoofdm_data_23_16_lsb 16
#define xd_p_reg_lnktoofdm_data_31_24	(*(volatile byte xdata *) 0xFBA1)
#define    p_reg_lnktoofdm_data_31_24	0xFBA1 
#define	reg_lnktoofdm_data_31_24_pos 0
#define	reg_lnktoofdm_data_31_24_len 8
#define	reg_lnktoofdm_data_31_24_lsb 24
#define xd_p_reg_lnktoofdm_data_39_32	(*(volatile byte xdata *) 0xFBA2)
#define    p_reg_lnktoofdm_data_39_32	0xFBA2 
#define	reg_lnktoofdm_data_39_32_pos 0
#define	reg_lnktoofdm_data_39_32_len 8
#define	reg_lnktoofdm_data_39_32_lsb 32
#define xd_p_reg_lnktoofdm_data_47_40	(*(volatile byte xdata *) 0xFBA3)
#define    p_reg_lnktoofdm_data_47_40	0xFBA3 
#define	reg_lnktoofdm_data_47_40_pos 0
#define	reg_lnktoofdm_data_47_40_len 8
#define	reg_lnktoofdm_data_47_40_lsb 40
#define xd_p_reg_lnktoofdm_data_55_48	(*(volatile byte xdata *) 0xFBA4)
#define    p_reg_lnktoofdm_data_55_48	0xFBA4 
#define	reg_lnktoofdm_data_55_48_pos 0
#define	reg_lnktoofdm_data_55_48_len 8
#define	reg_lnktoofdm_data_55_48_lsb 48
#define xd_p_reg_lnktoofdm_data_63_56	(*(volatile byte xdata *) 0xFBA5)
#define    p_reg_lnktoofdm_data_63_56	0xFBA5 
#define	reg_lnktoofdm_data_63_56_pos 0
#define	reg_lnktoofdm_data_63_56_len 8
#define	reg_lnktoofdm_data_63_56_lsb 56
#define xd_p_reg_dbgif32_sel	(*(volatile byte xdata *) 0xFBA6)
#define    p_reg_dbgif32_sel	0xFBA6 
#define	reg_dbgif32_sel_pos 0
#define	reg_dbgif32_sel_len 2
#define	reg_dbgif32_sel_lsb 0
#define xd_p_reg_dyn1_clk	(*(volatile byte xdata *) 0xFBA7)
#define    p_reg_dyn1_clk	0xFBA7 
#define	reg_dyn1_clk_pos 0
#define	reg_dyn1_clk_len 1
#define	reg_dyn1_clk_lsb 0
#define xd_p_reg_dyn0_clk	(*(volatile byte xdata *) 0xFBA8)
#define    p_reg_dyn0_clk	0xFBA8 
#define	reg_dyn0_clk_pos 0
#define	reg_dyn0_clk_len 1
#define	reg_dyn0_clk_lsb 0
#define xd_p_reg_free_clk	(*(volatile byte xdata *) 0xFBA9)
#define    p_reg_free_clk	0xFBA9 
#define	reg_free_clk_pos 0
#define	reg_free_clk_len 1
#define	reg_free_clk_lsb 0
#define xd_p_reg_ofdm_stick_mem_end_7_0	(*(volatile byte xdata *) 0xFBAD)
#define    p_reg_ofdm_stick_mem_end_7_0	0xFBAD 
#define	reg_ofdm_stick_mem_end_7_0_pos 0
