liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_ofdm_stick_mem_end_7_0_len 8
#define	reg_ofdm_stick_mem_end_7_0_lsb 0
#define xd_p_reg_ofdm_stick_mem_end_15_8	(*(volatile byte xdata *) 0xFBAE)
#define    p_reg_ofdm_stick_mem_end_15_8	0xFBAE 
#define	reg_ofdm_stick_mem_end_15_8_pos 0
#define	reg_ofdm_stick_mem_end_15_8_len 8
#define	reg_ofdm_stick_mem_end_15_8_lsb 8
#define xd_p_reg_ofdm_cpu_reset	(*(volatile byte xdata *) 0xFBAF)
#define    p_reg_ofdm_cpu_reset	0xFBAF 
#define	reg_ofdm_cpu_reset_pos 0
#define	reg_ofdm_cpu_reset_len 1
#define	reg_ofdm_cpu_reset_lsb 0
#define xd_p_reg_ofdm_bank_float_en	(*(volatile byte xdata *) 0xFBB0)
#define    p_reg_ofdm_bank_float_en	0xFBB0 
#define	reg_ofdm_bank_float_en_pos 0
#define	reg_ofdm_bank_float_en_len 1
#define	reg_ofdm_bank_float_en_lsb 0
#define xd_p_reg_ofdm_bank_float_start	(*(volatile byte xdata *) 0xFBB1)
#define    p_reg_ofdm_bank_float_start	0xFBB1 
#define	reg_ofdm_bank_float_start_pos 0
#define	reg_ofdm_bank_float_start_len 8
#define	reg_ofdm_bank_float_start_lsb 0
#define xd_p_reg_ofdm_bank_float_stop	(*(volatile byte xdata *) 0xFBB2)
#define    p_reg_ofdm_bank_float_stop	0xFBB2 
#define	reg_ofdm_bank_float_stop_pos 0
#define	reg_ofdm_bank_float_stop_len 8
#define	reg_ofdm_bank_float_stop_lsb 0
#define xd_r_ofsm_bond0_i	(*(volatile byte xdata *) 0xFBB3)
#define    r_ofsm_bond0_i	0xFBB3 
#define	ofsm_bond0_i_pos 0
#define	ofsm_bond0_i_len 1
#define	ofsm_bond0_i_lsb 0
#define xd_r_ofsm_bond1_i	(*(volatile byte xdata *) 0xFBB4)
#define    r_ofsm_bond1_i	0xFBB4 
#define	ofsm_bond1_i_pos 0
#define	ofsm_bond1_i_len 1
#define	ofsm_bond1_i_lsb 0
#define xd_r_io_mux_pwron_clk_strap	(*(volatile byte xdata *) 0xD800)
#define    r_io_mux_pwron_clk_strap	0xD800 
#define	io_mux_pwron_clk_strap_pos 0
#define	io_mux_pwron_clk_strap_len 4
#define	io_mux_pwron_clk_strap_lsb 0
#define xd_r_io_mux_pwron_mode_strap	(*(volatile byte xdata *) 0xD801)
#define    r_io_mux_pwron_mode_strap	0xD801 
#define	io_mux_pwron_mode_strap_pos 0
#define	io_mux_pwron_mode_strap_len 4
#define	io_mux_pwron_mode_strap_lsb 0
#define xd_r_reg_top_revid	(*(volatile byte xdata *) 0xD803)
#define    r_reg_top_revid	0xD803 
#define	reg_top_revid_pos 0
#define	reg_top_revid_len 4
#define	reg_top_revid_lsb 0
#define xd_r_io_mux_bondu0_i	(*(volatile byte xdata *) 0xD805)
#define    r_io_mux_bondu0_i	0xD805 
#define	io_mux_bondu0_i_pos 0
#define	io_mux_bondu0_i_len 1
#define	io_mux_bondu0_i_lsb 0
#define xd_p_reg_ofsm_suspend	(*(volatile byte xdata *) 0xD806)
#define    p_reg_ofsm_suspend	0xD806 
#define	reg_ofsm_suspend_pos 0
#define	reg_ofsm_suspend_len 1
#define	reg_ofsm_suspend_lsb 0
#define xd_p_reg_tslice_off	(*(volatile byte xdata *) 0xD807)
#define    p_reg_tslice_off	0xD807 
#define	reg_tslice_off_pos 0
#define	reg_tslice_off_len 1
#define	reg_tslice_off_lsb 0
#define xd_p_io_mux_wake_int	(*(volatile byte xdata *) 0xD808)
#define    p_io_mux_wake_int	0xD808 
#define	io_mux_wake_int_pos 0
#define	io_mux_wake_int_len 1
#define	io_mux_wake_int_lsb 0
#define xd_p_reg_top_pwrdw_hwen	(*(volatile byte xdata *) 0xD809)
#define    p_reg_top_pwrdw_hwen	0xD809 
#define	reg_top_pwrdw_hwen_pos 0
#define	reg_top_pwrdw_hwen_len 1
#define	reg_top_pwrdw_hwen_lsb 0
#define xd_p_reg_top_pwrdw_inv	(*(volatile byte xdata *) 0xD80A)
#define    p_reg_top_pwrdw_inv	0xD80A 
#define	reg_top_pwrdw_inv_pos 0
#define	reg_top_pwrdw_inv_len 1
#define	reg_top_pwrdw_inv_lsb 0
#define xd_p_reg_top_pwrdw	(*(volatile byte xdata *) 0xD80B)
#define    p_reg_top_pwrdw	0xD80B 
#define	reg_top_pwrdw_pos 0
#define	reg_top_pwrdw_len 1
#define	reg_top_pwrdw_lsb 0
#define xd_p_io_mux_wake_int_en	(*(volatile byte xdata *) 0xD80C)
#define    p_io_mux_wake_int_en	0xD80C 
#define	io_mux_wake_int_en_pos 0
#define	io_mux_wake_int_en_len 1
#define	io_mux_wake_int_en_lsb 0
#define xd_p_io_mux_pwrdw_int	(*(volatile byte xdata *) 0xD80D)
#define    p_io_mux_pwrdw_int	0xD80D 
#define	io_mux_pwrdw_int_pos 0
#define	io_mux_pwrdw_int_len 1
#define	io_mux_pwrdw_int_lsb 0
#define xd_p_reg_top_adcdly	(*(volatile byte xdata *) 0xD80E)
#define    p_reg_top_adcdly	0xD80E 
#define	reg_top_adcdly_pos 0
#define	reg_top_adcdly_len 2
#define	reg_top_adcdly_lsb 0
#define xd_p_reg_top_debug	(*(volatile byte xdata *) 0xD80F)
#define    p_reg_top_debug	0xD80F 
#define	reg_top_debug_pos 0
#define	reg_top_debug_len 1
#define	reg_top_debug_lsb 0
#define xd_p_reg_top_pcout	(*(volatile byte xdata *) 0xD810)
#define    p_reg_top_pcout	0xD810 
#define	reg_top_pcout_pos 0
#define	reg_top_pcout_len 1
#define	reg_top_pcout_lsb 0
#define xd_p_reg_top_rs232	(*(volatile byte xdata *) 0xD811)
#define    p_reg_top_rs232	0xD811 
#define	reg_top_rs232_pos 0
#define	reg_top_rs232_len 1
#define	reg_top_rs232_lsb 0
#define xd_p_reg_iqmode	(*(volatile byte xdata *) 0xD812)
#define    p_reg_iqmode	0xD812 
#define	reg_iqmode_pos 0
#define	reg_iqmode_len 1
#define	reg_iqmode_lsb 0
#define xd_p_reg_top_rstfd	(*(volatile byte xdata *) 0xD813)
#define    p_reg_top_rstfd	0xD813 
#define	reg_top_rstfd_pos 0
#define	reg_top_rstfd_len 1
#define	reg_top_rstfd_lsb 0
#define xd_p_reg_sdio_clksel	(*(volatile byte xdata *) 0xD814)
#define    p_reg_sdio_clksel	0xD814 
#define	reg_sdio_clksel_pos 0
#define	reg_sdio_clksel_len 1
#define	reg_sdio_clksel_lsb 0
#define xd_p_reg_utmi_clksel	(*(volatile byte xdata *) 0xD815)
#define    p_reg_utmi_clksel	0xD815 
#define	reg_utmi_clksel_pos 0
#define	reg_utmi_clksel_len 8
#define	reg_utmi_clksel_lsb 0
#define xd_p_reg_top_suscnt	(*(volatile byte xdata *) 0xD816)
#define    p_reg_top_suscnt	0xD816 
#define	reg_top_suscnt_pos 0
#define	reg_top_suscnt_len 2
#define	reg_top_suscnt_lsb 0
#define xd_p_reg_top_dist2f	(*(volatile byte xdata *) 0xD817)
#define    p_reg_top_dist2f	0xD817 
#define	reg_top_dist2f_pos 0
#define	reg_top_dist2f_len 1
#define	reg_top_dist2f_lsb 0
#define xd_p_reg_top_extusb	(*(volatile byte xdata *) 0xD818)
#define    p_reg_top_extusb	0xD818 
#define	reg_top_extusb_pos 0
#define	reg_top_extusb_len 1
#define	reg_top_extusb_lsb 0
#define xd_p_reg_top_adcfifo	(*(volatile byte xdata *) 0xD819)
#define    p_reg_top_adcfifo	0xD819 
#define	reg_top_adcfifo_pos 0
#define	reg_top_adcfifo_len 1
#define	reg_top_adcfifo_lsb 0
#define xd_p_reg_top_stpck	(*(volatile byte xdata *) 0xD81B)
#define    p_reg_top_stpck	0xD81B 
#define	reg_top_stpck_pos 0
#define	reg_top_stpck_len 1
#define	reg_top_stpck_lsb 0
#define xd_p_reg_top_freeck	(*(volatile byte xdata *) 0xD81C)
#define    p_reg_top_freeck	0xD81C 
#define	reg_top_freeck_pos 0
#define	reg_top_freeck_len 1
#define	reg_top_freeck_lsb 0
#define xd_p_reg_top_dio_sel	(*(volatile byte xdata *) 0xD81D)
#define    p_reg_top_dio_sel	0xD81D 
#define	reg_top_dio_sel_pos 0
#define	reg_top_dio_sel_len 1
#define	reg_top_dio_sel_lsb 0
#define xd_p_reg_top_int_en	(*(volatile byte xdata *) 0xD81E)
#define    p_reg_top_int_en	0xD81E 
#define	reg_top_int_en_pos 0
#define	reg_top_int_en_len 1
#define	reg_top_int_en_lsb 0
#define xd_p_reg_top_int_inv	(*(volatile byte xdata *) 0xD81F)
#define    p_reg_top_int_inv	0xD81F 
#define	reg_top_int_inv_pos 0
#define	reg_top_int_inv_len 1
#define	reg_top_int_inv_lsb 0
#define xd_p_reg_tsip_clk_inv	(*(volatile byte xdata *) 0xD820)
#define    p_reg_tsip_clk_inv	0xD820 
#define	reg_tsip_clk_inv_pos 0
#define	reg_tsip_clk_inv_len 1
#define	reg_tsip_clk_inv_lsb 0
#define xd_p_reg_ts_clk_inv	(*(volatile byte xdata *) 0xD821)
#define    p_reg_ts_clk_inv	0xD821 
#define	reg_ts_clk_inv_pos 0
#define	reg_ts_clk_inv_len 1
#define	reg_ts_clk_inv_lsb 0
#define xd_p_reg_top_sys_gate	(*(volatile byte xdata *) 0xD824)
#define    p_reg_top_sys_gate	0xD824 
#define	reg_top_sys_gate_pos 0
#define	reg_top_sys_gate_len 1
#define	reg_top_sys_gate_lsb 0
#define xd_p_reg_top_padpu	(*(volatile byte xdata *) 0xD825)
#define    p_reg_top_padpu	0xD825 
#define	reg_top_padpu_pos 0
#define	reg_top_padpu_len 1
#define	reg_top_padpu_lsb 0
#define xd_p_reg_top_padpd	(*(volatile byte xdata *) 0xD826)
#define    p_reg_top_padpd	0xD826 
#define	reg_top_padpd_pos 0
#define	reg_top_padpd_len 1
#define	reg_top_padpd_lsb 0
#define xd_p_reg_top_padodpu	(*(volatile byte xdata *) 0xD827)
#define    p_reg_top_padodpu	0xD827 
#define	reg_top_padodpu_pos 0
#define	reg_top_padodpu_len 1
#define	reg_top_padodpu_lsb 0
#define xd_p_reg_top_thirdodpu	(*(volatile byte xdata *) 0xD828)
#define    p_reg_top_thirdodpu	0xD828 
#define	reg_top_thirdodpu_pos 0
#define	reg_top_thirdodpu_len 1
#define	reg_top_thirdodpu_lsb 0
#define xd_p_reg_top_agc_od	(*(volatile byte xdata *) 0xD829)
#define    p_reg_top_agc_od	0xD829 
#define	reg_top_agc_od_pos 0
#define	reg_top_agc_od_len 1
#define	reg_top_agc_od_lsb 0
#define xd_p_reg_top_padmpdr2	(*(volatile byte xdata *) 0xD82A)
#define    p_reg_top_padmpdr2	0xD82A 
#define	reg_top_padmpdr2_pos 0
#define	reg_top_padmpdr2_len 1
#define	reg_top_padmpdr2_lsb 0
#define xd_p_reg_top_padmpdr4	(*(volatile byte xdata *) 0xD82B)
#define    p_reg_top_padmpdr4	0xD82B 
#define	reg_top_padmpdr4_pos 0
#define	reg_top_padmpdr4_len 1
#define	reg_top_padmpdr4_lsb 0
#define xd_p_reg_top_padmpdr8	(*(volatile byte xdata *) 0xD82C)
#define    p_reg_top_padmpdr8	0xD82C 
#define	reg_top_padmpdr8_pos 0
#define	reg_top_padmpdr8_len 1
#define	reg_top_padmpdr8_lsb 0
#define xd_p_reg_top_padmpdrsr	(*(volatile byte xdata *) 0xD82D)
#define    p_reg_top_padmpdrsr	0xD82D 
#define	reg_top_padmpdrsr_pos 0
#define	reg_top_padmpdrsr_len 1
#define	reg_top_padmpdrsr_lsb 0
#define xd_p_reg_top_padmppu	(*(volatile byte xdata *) 0xD82E)
#define    p_reg_top_padmppu	0xD82E 
#define	reg_top_padmppu_pos 0
#define	reg_top_padmppu_len 1
#define	reg_top_padmppu_lsb 0
#define xd_p_reg_top_padmppd	(*(volatile byte xdata *) 0xD82F)
#define    p_reg_top_padmppd	0xD82F 
#define	reg_top_padmppd_pos 0
#define	reg_top_padmppd_len 1
#define	reg_top_padmppd_lsb 0
#define xd_p_reg_top_padmiscdr2	(*(volatile byte xdata *) 0xD830)
#define    p_reg_top_padmiscdr2	0xD830 
#define	reg_top_padmiscdr2_pos 0
#define	reg_top_padmiscdr2_len 1
#define	reg_top_padmiscdr2_lsb 0
#define xd_p_reg_top_padmiscdr4	(*(volatile byte xdata *) 0xD831)
#define    p_reg_top_padmiscdr4	0xD831 
#define	reg_top_padmiscdr4_pos 0
#define	reg_top_padmiscdr4_len 1
#define	reg_top_padmiscdr4_lsb 0
#define xd_p_reg_top_padmiscdr8	(*(volatile byte xdata *) 0xD832)
#define    p_reg_top_padmiscdr8	0xD832 
#define	reg_top_padmiscdr8_pos 0
#define	reg_top_padmiscdr8_len 1
#define	reg_top_padmiscdr8_lsb 0
#define xd_p_reg_top_padmiscdrsr	(*(volatile byte xdata *) 0xD833)
#define    p_reg_top_padmiscdrsr	0xD833 
#define	reg_top_padmiscdrsr_pos 0
#define	reg_top_padmiscdrsr_len 1
#define	reg_top_padmiscdrsr_lsb 0
#define xd_p_reg_top_padmiscpu	(*(volatile byte xdata *) 0xD834)
#define    p_reg_top_padmiscpu	0xD834 
#define	reg_top_padmiscpu_pos 0
#define	reg_top_padmiscpu_len 1
#define	reg_top_padmiscpu_lsb 0
#define xd_p_reg_top_padmiscpd	(*(volatile byte xdata *) 0xD835)
#define    p_reg_top_padmiscpd	0xD835 
#define	reg_top_padmiscpd_pos 0
#define	reg_top_padmiscpd_len 1
#define	reg_top_padmiscpd_lsb 0
#define xd_p_reg_host_b0_smt	(*(volatile byte xdata *) 0xD836)
#define    p_reg_host_b0_smt	0xD836 
#define	reg_host_b0_smt_pos 0
#define	reg_host_b0_smt_len 1
#define	reg_host_b0_smt_lsb 0
#define xd_p_reg_host_b1_smt	(*(volatile byte xdata *) 0xD837)
#define    p_reg_host_b1_smt	0xD837 
#define	reg_host_b1_smt_pos 0
#define	reg_host_b1_smt_len 1
#define	reg_host_b1_smt_lsb 0
#define xd_p_reg_host_b2_smt	(*(volatile byte xdata *) 0xD838)
#define    p_reg_host_b2_smt	0xD838 
#define	reg_host_b2_smt_pos 0
#define	reg_host_b2_smt_len 1
#define	reg_host_b2_smt_lsb 0
#define xd_p_reg_host_b3_smt	(*(volatile byte xdata *) 0xD839)
#define    p_reg_host_b3_smt	0xD839 
#define	reg_host_b3_smt_pos 0
#define	reg_host_b3_smt_len 1
#define	reg_host_b3_smt_lsb 0
#define xd_p_reg_host_b4_smt	(*(volatile byte xdata *) 0xD83A)
#define    p_reg_host_b4_smt	0xD83A 
#define	reg_host_b4_smt_pos 0
#define	reg_host_b4_smt_len 1
#define	reg_host_b4_smt_lsb 0
#define xd_p_reg_host_b5_smt	(*(volatile byte xdata *) 0xD83B)
#define    p_reg_host_b5_smt	0xD83B 
#define	reg_host_b5_smt_pos 0
#define	reg_host_b5_smt_len 1
#define	reg_host_b5_smt_lsb 0
#define xd_p_reg_host_b6_smt	(*(volatile byte xdata *) 0xD83C)
#define    p_reg_host_b6_smt	0xD83C 
#define	reg_host_b6_smt_pos 0
#define	reg_host_b6_smt_len 1
#define	reg_host_b6_smt_lsb 0
#define xd_p_reg_host_b7_smt	(*(volatile byte xdata *) 0xD83D)
#define    p_reg_host_b7_smt	0xD83D 
#define	reg_host_b7_smt_pos 0
#define	reg_host_b7_smt_len 1
#define	reg_host_b7_smt_lsb 0
#define xd_p_reg_host_b8_smt	(*(volatile byte xdata *) 0xD83E)
#define    p_reg_host_b8_smt	0xD83E 
#define	reg_host_b8_smt_pos 0
#define	reg_host_b8_smt_len 1
#define	reg_host_b8_smt_lsb 0
#define xd_p_reg_host_b9_smt	(*(volatile byte xdata *) 0xD83F)
#define    p_reg_host_b9_smt	0xD83F 
#define	reg_host_b9_smt_pos 0
#define	reg_host_b9_smt_len 1
#define	reg_host_b9_smt_lsb 0
#define xd_p_reg_host_b10_smt	(*(volatile byte xdata *) 0xD840)
#define    p_reg_host_b10_smt	0xD840 
#define	reg_host_b10_smt_pos 0
#define	reg_host_b10_smt_len 1
#define	reg_host_b10_smt_lsb 0
#define xd_p_reg_host_b11_smt	(*(volatile byte xdata *) 0xD841)
#define    p_reg_host_b11_smt	0xD841 
#define	reg_host_b11_smt_pos 0
#define	reg_host_b11_smt_len 1
#define	reg_host_b11_smt_lsb 0
#define xd_p_reg_testmode_pds	(*(volatile byte xdata *) 0xD84E)
#define    p_reg_testmode_pds	0xD84E 
#define	reg_testmode_pds_pos 0
#define	reg_testmode_pds_len 3
#define	reg_testmode_pds_lsb 0
#define xd_p_reg_debug31_pds	(*(volatile byte xdata *) 0xD84F)
#define    p_reg_debug31_pds	0xD84F 
#define	reg_debug31_pds_pos 0
#define	reg_debug31_pds_len 3
#define	reg_debug31_pds_lsb 0
#define xd_p_reg_debug30_pds	(*(volatile byte xdata *) 0xD850)
#define    p_reg_debug30_pds	0xD850 
#define	reg_debug30_pds_pos 0
#define	reg_debug30_pds_len 3
#define	reg_debug30_pds_lsb 0
#define xd_p_reg_debug29_pds	(*(volatile byte xdata *) 0xD851)
#define    p_reg_debug29_pds	0xD851 
#define	reg_debug29_pds_pos 0
#define	reg_debug29_pds_len 3
#define	reg_debug29_pds_lsb 0
#define xd_p_reg_debug28_pds	(*(volatile byte xdata *) 0xD852)
#define    p_reg_debug28_pds	0xD852 
#define	reg_debug28_pds_pos 0
#define	reg_debug28_pds_len 3
#define	reg_debug28_pds_lsb 0
#define xd_p_reg_debug27_pds	(*(volatile byte xdata *) 0xD853)
#define    p_reg_debug27_pds	0xD853 
#define	reg_debug27_pds_pos 0
#define	reg_debug27_pds_len 3
#define	reg_debug27_pds_lsb 0
#define xd_p_reg_debug26_pds	(*(volatile byte xdata *) 0xD854)
#define    p_reg_debug26_pds	0xD854 
#define	reg_debug26_pds_pos 0
#define	reg_debug26_pds_len 3
#define	reg_debug26_pds_lsb 0
#define xd_p_reg_debug25_pds	(*(volatile byte xdata *) 0xD855)
#define    p_reg_debug25_pds	0xD855 
#define	reg_debug25_pds_pos 0
#define	reg_debug25_pds_len 3
#define	reg_debug25_pds_lsb 0
#define xd_p_reg_debug24_pds	(*(volatile byte xdata *) 0xD856)
#define    p_reg_debug24_pds	0xD856 
#define	reg_debug24_pds_pos 0
#define	reg_debug24_pds_len 3
#define	reg_debug24_pds_lsb 0
#define xd_p_reg_debug23_pds	(*(volatile byte xdata *) 0xD857)
#define    p_reg_debug23_pds	0xD857 
#define	reg_debug23_pds_pos 0
#define	reg_debug23_pds_len 3
#define	reg_debug23_pds_lsb 0
#define xd_p_reg_debug22_pds	(*(volatile byte xdata *) 0xD858)
#define    p_reg_debug22_pds	0xD858 
#define	reg_debug22_pds_pos 0
#define	reg_debug22_pds_len 3
#define	reg_debug22_pds_lsb 0
#define xd_p_reg_gpioh1_pds	(*(volatile byte xdata *) 0xD859)
#define    p_reg_gpioh1_pds	0xD859 
#define	reg_gpioh1_pds_pos 0
#define	reg_gpioh1_pds_len 3
#define	reg_gpioh1_pds_lsb 0
#define xd_p_reg_gpioh2_pds	(*(volatile byte xdata *) 0xD85A)
#define    p_reg_gpioh2_pds	0xD85A 
#define	reg_gpioh2_pds_pos 0
#define	reg_gpioh2_pds_len 3
#define	reg_gpioh2_pds_lsb 0
#define xd_p_reg_gpioh3_pds	(*(volatile byte xdata *) 0xD85B)
#define    p_reg_gpioh3_pds	0xD85B 
#define	reg_gpioh3_pds_pos 0
#define	reg_gpioh3_pds_len 3
#define	reg_gpioh3_pds_lsb 0
#define xd_p_reg_gpioh4_pds	(*(volatile byte xdata *) 0xD85C)
#define    p_reg_gpioh4_pds	0xD85C 
#define	reg_gpioh4_pds_pos 0
#define	reg_gpioh4_pds_len 3
#define	reg_gpioh4_pds_lsb 0
#define xd_p_reg_iosda_pds	(*(volatile byte xdata *) 0xD85D)
#define    p_reg_iosda_pds	0xD85D 
#define	reg_iosda_pds_pos 0
#define	reg_iosda_pds_len 3
#define	reg_iosda_pds_lsb 0
#define xd_p_reg_ioscl_pds	(*(volatile byte xdata *) 0xD85E)
#define    p_reg_ioscl_pds	0xD85E 
#define	reg_ioscl_pds_pos 0
#define	reg_ioscl_pds_len 3
#define	reg_ioscl_pds_lsb 0
#define xd_p_reg_gpioh5_pds	(*(volatile byte xdata *) 0xD85F)
#define    p_reg_gpioh5_pds	0xD85F 
#define	reg_gpioh5_pds_pos 0
#define	reg_gpioh5_pds_len 3
#define	reg_gpioh5_pds_lsb 0
#define xd_p_reg_i2caddr6_pds	(*(volatile byte xdata *) 0xD861)
#define    p_reg_i2caddr6_pds	0xD861 
#define	reg_i2caddr6_pds_pos 0
#define	reg_i2caddr6_pds_len 3
#define	reg_i2caddr6_pds_lsb 0
#define xd_p_reg_i2caddr5_pds	(*(volatile byte xdata *) 0xD862)
#define    p_reg_i2caddr5_pds	0xD862 
#define	reg_i2caddr5_pds_pos 0
#define	reg_i2caddr5_pds_len 3
#define	reg_i2caddr5_pds_lsb 0
#define xd_p_reg_i2caddr4_pds	(*(volatile byte xdata *) 0xD863)
#define    p_reg_i2caddr4_pds	0xD863 
#define	reg_i2caddr4_pds_pos 0
#define	reg_i2caddr4_pds_len 3
#define	reg_i2caddr4_pds_lsb 0
#define xd_p_reg_debug21_pds	(*(volatile byte xdata *) 0xD866)
#define    p_reg_debug21_pds	0xD866 
#define	reg_debug21_pds_pos 0
#define	reg_debug21_pds_len 3
#define	reg_debug21_pds_lsb 0
#define xd_p_reg_debug20_pds	(*(volatile byte xdata *) 0xD867)
#define    p_reg_debug20_pds	0xD867 
#define	reg_debug20_pds_pos 0
#define	reg_debug20_pds_len 3
#define	reg_debug20_pds_lsb 0
#define xd_p_reg_debug19_pds	(*(volatile byte xdata *) 0xD868)
#define    p_reg_debug19_pds	0xD868 
#define	reg_debug19_pds_pos 0
#define	reg_debug19_pds_len 3
#define	reg_debug19_pds_lsb 0
#define xd_p_reg_debug18_pds	(*(volatile byte xdata *) 0xD869)
#define    p_reg_debug18_pds	0xD869 
#define	reg_debug18_pds_pos 0
#define	reg_debug18_pds_len 3
#define	reg_debug18_pds_lsb 0
#define xd_p_reg_debug17_pds	(*(volatile byte xdata *) 0xD86A)
#define    p_reg_debug17_pds	0xD86A 
#define	reg_debug17_pds_pos 0
#define	reg_debug17_pds_len 3
#define	reg_debug17_pds_lsb 0
#define xd_p_reg_p160sel_pds	(*(volatile byte xdata *) 0xD870)
#define    p_reg_p160sel_pds	0xD870 
#define	reg_p160sel_pds_pos 0
#define	reg_p160sel_pds_len 3
#define	reg_p160sel_pds_lsb 0
#define xd_p_reg_bondu0_pds	(*(volatile byte xdata *) 0xD879)
#define    p_reg_bondu0_pds	0xD879 
#define	reg_bondu0_pds_pos 0
#define	reg_bondu0_pds_len 3
#define	reg_bondu0_pds_lsb 0
#define xd_p_reg_host_b0_pds	(*(volatile byte xdata *) 0xD87A)
#define    p_reg_host_b0_pds	0xD87A 
#define	reg_host_b0_pds_pos 0
#define	reg_host_b0_pds_len 3
#define	reg_host_b0_pds_lsb 0
#define xd_p_reg_host_b1_pds	(*(volatile byte xdata *) 0xD87B)
#define    p_reg_host_b1_pds	0xD87B 
#define	reg_host_b1_pds_pos 0
#define	reg_host_b1_pds_len 3
#define	reg_host_b1_pds_lsb 0
#define xd_p_reg_host_b2_pds	(*(volatile byte xdata *) 0xD87C)
#define    p_reg_host_b2_pds	0xD87C 
#define	reg_host_b2_pds_pos 0
#define	reg_host_b2_pds_len 3
#define	reg_host_b2_pds_lsb 0
#define xd_p_reg_host_b3_pds	(*(volatile byte xdata *) 0xD87D)
#define    p_reg_host_b3_pds	0xD87D 
#define	reg_host_b3_pds_pos 0
#define	reg_host_b3_pds_len 3
#define	reg_host_b3_pds_lsb 0
#define xd_p_reg_host_b4_pds	(*(volatile byte xdata *) 0xD87E)
#define    p_reg_host_b4_pds	0xD87E 
#define	reg_host_b4_pds_pos 0
#define	reg_host_b4_pds_len 3
#define	reg_host_b4_pds_lsb 0
#define xd_p_reg_host_b5_pds	(*(volatile byte xdata *) 0xD87F)
#define    p_reg_host_b5_pds	0xD87F 
#define	reg_host_b5_pds_pos 0
#define	reg_host_b5_pds_len 3
#define	reg_host_b5_pds_lsb 0
#define xd_p_reg_host_b6_pds	(*(volatile byte xdata *) 0xD880)
#define    p_reg_host_b6_pds	0xD880 
#define	reg_host_b6_pds_pos 0
#define	reg_host_b6_pds_len 3
#define	reg_host_b6_pds_lsb 0
#define xd_p_reg_host_b7_pds	(*(volatile byte xdata *) 0xD881)
#define    p_reg_host_b7_pds	0xD881 
#define	reg_host_b7_pds_pos 0
#define	reg_host_b7_pds_len 3
#define	reg_host_b7_pds_lsb 0
#define xd_p_reg_host_b8_pds	(*(volatile byte xdata *) 0xD883)
#define    p_reg_host_b8_pds	0xD883 
#define	reg_host_b8_pds_pos 0
#define	reg_host_b8_pds_len 3
#define	reg_host_b8_pds_lsb 0
#define xd_p_reg_host_b9_pds	(*(volatile byte xdata *) 0xD884)
#define    p_reg_host_b9_pds	0xD884 
#define	reg_host_b9_pds_pos 0
#define	reg_host_b9_pds_len 3
#define	reg_host_b9_pds_lsb 0
#define xd_p_reg_host_b10_pds	(*(volatile byte xdata *) 0xD885)
#define    p_reg_host_b10_pds	0xD885 
#define	reg_host_b10_pds_pos 0
#define	reg_host_b10_pds_len 3
#define	reg_host_b10_pds_lsb 0
#define xd_p_reg_host_b11_pds	(*(volatile byte xdata *) 0xD886)
#define    p_reg_host_b11_pds	0xD886 
#define	reg_host_b11_pds_pos 0
#define	reg_host_b11_pds_len 3
#define	reg_host_b11_pds_lsb 0
#define xd_p_reg_debug16_pds	(*(volatile byte xdata *) 0xD887)
#define    p_reg_debug16_pds	0xD887 
#define	reg_debug16_pds_pos 0
#define	reg_debug16_pds_len 3
#define	reg_debug16_pds_lsb 0
#define xd_p_reg_debug15_pds	(*(volatile byte xdata *) 0xD888)
#define    p_reg_debug15_pds	0xD888 
#define	reg_debug15_pds_pos 0
#define	reg_debug15_pds_len 3
#define	reg_debug15_pds_lsb 0
#define xd_p_reg_debug14_pds	(*(volatile byte xdata *) 0xD889)
#define    p_reg_debug14_pds	0xD889 
#define	reg_debug14_pds_pos 0
#define	reg_debug14_pds_len 3
#define	reg_debug14_pds_lsb 0
#define xd_p_reg_debug13_pds	(*(volatile byte xdata *) 0xD88A)
#define    p_reg_debug13_pds	0xD88A 
#define	reg_debug13_pds_pos 0
#define	reg_debug13_pds_len 3
#define	reg_debug13_pds_lsb 0
#define xd_p_reg_debug12_pds	(*(volatile byte xdata *) 0xD88B)
#define    p_reg_debug12_pds	0xD88B 
#define	reg_debug12_pds_pos 0
#define	reg_debug12_pds_len 3
#define	reg_debug12_pds_lsb 0
#define xd_p_reg_debug11_pds	(*(volatile byte xdata *) 0xD88C)
#define    p_reg_debug11_pds	0xD88C 
#define	reg_debug11_pds_pos 0
#define	reg_debug11_pds_len 3
#define	reg_debug11_pds_lsb 0
#define xd_p_reg_debug10_pds	(*(volatile byte xdata *) 0xD88D)
#define    p_reg_debug10_pds	0xD88D 
#define	reg_debug10_pds_pos 0
#define	reg_debug10_pds_len 3
#define	reg_debug10_pds_lsb 0
#define xd_p_reg_debug9_pds	(*(volatile byte xdata *) 0xD88E)
#define    p_reg_debug9_pds	0xD88E 
#define	reg_debug9_pds_pos 0
#define	reg_debug9_pds_len 3
#define	reg_debug9_pds_lsb 0
#define xd_p_reg_debug8_pds	(*(volatile byte xdata *) 0xD88F)
#define    p_reg_debug8_pds	0xD88F 
#define	reg_debug8_pds_pos 0
#define	reg_debug8_pds_len 3
#define	reg_debug8_pds_lsb 0
#define xd_p_reg_debug7_pds	(*(volatile byte xdata *) 0xD890)
#define    p_reg_debug7_pds	0xD890 
#define	reg_debug7_pds_pos 0
#define	reg_debug7_pds_len 3
#define	reg_debug7_pds_lsb 0
#define xd_p_reg_debug6_pds	(*(volatile byte xdata *) 0xD891)
#define    p_reg_debug6_pds	0xD891 
#define	reg_debug6_pds_pos 0
#define	reg_debug6_pds_len 3
#define	reg_debug6_pds_lsb 0
#define xd_p_reg_debug5_pds	(*(volatile byte xdata *) 0xD892)
#define    p_reg_debug5_pds	0xD892 
#define	reg_debug5_pds_pos 0
#define	reg_debug5_pds_len 3
#define	reg_debug5_pds_lsb 0
#define xd_p_reg_debug4_pds	(*(volatile byte xdata *) 0xD893)
#define    p_reg_debug4_pds	0xD893 
#define	reg_debug4_pds_pos 0
#define	reg_debug4_pds_len 3
#define	reg_debug4_pds_lsb 0
#define xd_p_reg_gpioh6_pds	(*(volatile byte xdata *) 0xD895)
#define    p_reg_gpioh6_pds	0xD895 
#define	reg_gpioh6_pds_pos 0
#define	reg_gpioh6_pds_len 3
#define	reg_gpioh6_pds_lsb 0
#define xd_p_reg_gpioh7_pds	(*(volatile byte xdata *) 0xD896)
#define    p_reg_gpioh7_pds	0xD896 
#define	reg_gpioh7_pds_pos 0
#define	reg_gpioh7_pds_len 3
#define	reg_gpioh7_pds_lsb 0
#define xd_p_reg_gpioh8_pds	(*(volatile byte xdata *) 0xD897)
#define    p_reg_gpioh8_pds	0xD897 
#define	reg_gpioh8_pds_pos 0
#define	reg_gpioh8_pds_len 3
#define	reg_gpioh8_pds_lsb 0
#define xd_p_reg_ir_emit0_pds	(*(volatile byte xdata *) 0xD898)
#define    p_reg_ir_emit0_pds	0xD898 
#define	reg_ir_emit0_pds_pos 0
