liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_ir_emit0_pds_len 3
#define	reg_ir_emit0_pds_lsb 0
#define xd_p_reg_ir_emit1_pds	(*(volatile byte xdata *) 0xD899)
#define    p_reg_ir_emit1_pds	0xD899 
#define	reg_ir_emit1_pds_pos 0
#define	reg_ir_emit1_pds_len 3
#define	reg_ir_emit1_pds_lsb 0
#define xd_p_reg_debug3_pds	(*(volatile byte xdata *) 0xD89A)
#define    p_reg_debug3_pds	0xD89A 
#define	reg_debug3_pds_pos 0
#define	reg_debug3_pds_len 3
#define	reg_debug3_pds_lsb 0
#define xd_p_reg_debug2_pds	(*(volatile byte xdata *) 0xD89B)
#define    p_reg_debug2_pds	0xD89B 
#define	reg_debug2_pds_pos 0
#define	reg_debug2_pds_len 3
#define	reg_debug2_pds_lsb 0
#define xd_p_reg_debug1_pds	(*(volatile byte xdata *) 0xD89C)
#define    p_reg_debug1_pds	0xD89C 
#define	reg_debug1_pds_pos 0
#define	reg_debug1_pds_len 3
#define	reg_debug1_pds_lsb 0
#define xd_p_reg_debug0_pds	(*(volatile byte xdata *) 0xD89D)
#define    p_reg_debug0_pds	0xD89D 
#define	reg_debug0_pds_pos 0
#define	reg_debug0_pds_len 3
#define	reg_debug0_pds_lsb 0
#define xd_p_reg_reg_sel33_pds	(*(volatile byte xdata *) 0xD8A3)
#define    p_reg_reg_sel33_pds	0xD8A3 
#define	reg_reg_sel33_pds_pos 0
#define	reg_reg_sel33_pds_len 3
#define	reg_reg_sel33_pds_lsb 0
#define xd_p_reg_usbck_sel_pds	(*(volatile byte xdata *) 0xD8A4)
#define    p_reg_usbck_sel_pds	0xD8A4 
#define	reg_usbck_sel_pds_pos 0
#define	reg_usbck_sel_pds_len 3
#define	reg_usbck_sel_pds_lsb 0
#define xd_p_reg_psda_pds	(*(volatile byte xdata *) 0xD8A5)
#define    p_reg_psda_pds	0xD8A5 
#define	reg_psda_pds_pos 0
#define	reg_psda_pds_len 3
#define	reg_psda_pds_lsb 0
#define xd_p_reg_pscl_pds	(*(volatile byte xdata *) 0xD8A6)
#define    p_reg_pscl_pds	0xD8A6 
#define	reg_pscl_pds_pos 0
#define	reg_pscl_pds_len 3
#define	reg_pscl_pds_lsb 0
#define xd_p_reg_iotunscl_pds	(*(volatile byte xdata *) 0xD8A7)
#define    p_reg_iotunscl_pds	0xD8A7 
#define	reg_iotunscl_pds_pos 0
#define	reg_iotunscl_pds_len 3
#define	reg_iotunscl_pds_lsb 0
#define xd_p_reg_iotunsda_pds	(*(volatile byte xdata *) 0xD8A8)
#define    p_reg_iotunsda_pds	0xD8A8 
#define	reg_iotunsda_pds_pos 0
#define	reg_iotunsda_pds_len 3
#define	reg_iotunsda_pds_lsb 0
#define xd_p_reg_rxdofsm_pds	(*(volatile byte xdata *) 0xD8A9)
#define    p_reg_rxdofsm_pds	0xD8A9 
#define	reg_rxdofsm_pds_pos 0
#define	reg_rxdofsm_pds_len 3
#define	reg_rxdofsm_pds_lsb 0
#define xd_p_reg_txdofsm_pds	(*(volatile byte xdata *) 0xD8AA)
#define    p_reg_txdofsm_pds	0xD8AA 
#define	reg_txdofsm_pds_pos 0
#define	reg_txdofsm_pds_len 3
#define	reg_txdofsm_pds_lsb 0
#define xd_p_reg_rxdlink_pds	(*(volatile byte xdata *) 0xD8AB)
#define    p_reg_rxdlink_pds	0xD8AB 
#define	reg_rxdlink_pds_pos 0
#define	reg_rxdlink_pds_len 3
#define	reg_rxdlink_pds_lsb 0
#define xd_p_reg_txdlink_pds	(*(volatile byte xdata *) 0xD8AC)
#define    p_reg_txdlink_pds	0xD8AC 
#define	reg_txdlink_pds_pos 0
#define	reg_txdlink_pds_len 3
#define	reg_txdlink_pds_lsb 0
#define xd_p_reg_ck_test_pds	(*(volatile byte xdata *) 0xD8AD)
#define    p_reg_ck_test_pds	0xD8AD 
#define	reg_ck_test_pds_pos 0
#define	reg_ck_test_pds_len 3
#define	reg_ck_test_pds_lsb 0
#define xd_r_reg_top_gpioh1_i	(*(volatile byte xdata *) 0xD8AE)
#define    r_reg_top_gpioh1_i	0xD8AE 
#define	reg_top_gpioh1_i_pos 0
#define	reg_top_gpioh1_i_len 1
#define	reg_top_gpioh1_i_lsb 0
#define xd_p_reg_top_gpioh1_o	(*(volatile byte xdata *) 0xD8AF)
#define    p_reg_top_gpioh1_o	0xD8AF 
#define	reg_top_gpioh1_o_pos 0
#define	reg_top_gpioh1_o_len 1
#define	reg_top_gpioh1_o_lsb 0
#define xd_p_reg_top_gpioh1_en	(*(volatile byte xdata *) 0xD8B0)
#define    p_reg_top_gpioh1_en	0xD8B0 
#define	reg_top_gpioh1_en_pos 0
#define	reg_top_gpioh1_en_len 1
#define	reg_top_gpioh1_en_lsb 0
#define xd_p_reg_top_gpioh1_on	(*(volatile byte xdata *) 0xD8B1)
#define    p_reg_top_gpioh1_on	0xD8B1 
#define	reg_top_gpioh1_on_pos 0
#define	reg_top_gpioh1_on_len 1
#define	reg_top_gpioh1_on_lsb 0
#define xd_r_reg_top_gpioh3_i	(*(volatile byte xdata *) 0xD8B2)
#define    r_reg_top_gpioh3_i	0xD8B2 
#define	reg_top_gpioh3_i_pos 0
#define	reg_top_gpioh3_i_len 1
#define	reg_top_gpioh3_i_lsb 0
#define xd_p_reg_top_gpioh3_o	(*(volatile byte xdata *) 0xD8B3)
#define    p_reg_top_gpioh3_o	0xD8B3 
#define	reg_top_gpioh3_o_pos 0
#define	reg_top_gpioh3_o_len 1
#define	reg_top_gpioh3_o_lsb 0
#define xd_p_reg_top_gpioh3_en	(*(volatile byte xdata *) 0xD8B4)
#define    p_reg_top_gpioh3_en	0xD8B4 
#define	reg_top_gpioh3_en_pos 0
#define	reg_top_gpioh3_en_len 1
#define	reg_top_gpioh3_en_lsb 0
#define xd_p_reg_top_gpioh3_on	(*(volatile byte xdata *) 0xD8B5)
#define    p_reg_top_gpioh3_on	0xD8B5 
#define	reg_top_gpioh3_on_pos 0
#define	reg_top_gpioh3_on_len 1
#define	reg_top_gpioh3_on_lsb 0
#define xd_r_reg_top_gpioh2_i	(*(volatile byte xdata *) 0xD8B6)
#define    r_reg_top_gpioh2_i	0xD8B6 
#define	reg_top_gpioh2_i_pos 0
#define	reg_top_gpioh2_i_len 1
#define	reg_top_gpioh2_i_lsb 0
#define xd_p_reg_top_gpioh2_o	(*(volatile byte xdata *) 0xD8B7)
#define    p_reg_top_gpioh2_o	0xD8B7 
#define	reg_top_gpioh2_o_pos 0
#define	reg_top_gpioh2_o_len 1
#define	reg_top_gpioh2_o_lsb 0
#define xd_p_reg_top_gpioh2_en	(*(volatile byte xdata *) 0xD8B8)
#define    p_reg_top_gpioh2_en	0xD8B8 
#define	reg_top_gpioh2_en_pos 0
#define	reg_top_gpioh2_en_len 1
#define	reg_top_gpioh2_en_lsb 0
#define xd_p_reg_top_gpioh2_on	(*(volatile byte xdata *) 0xD8B9)
#define    p_reg_top_gpioh2_on	0xD8B9 
#define	reg_top_gpioh2_on_pos 0
#define	reg_top_gpioh2_on_len 1
#define	reg_top_gpioh2_on_lsb 0
#define xd_r_reg_top_gpioh5_i	(*(volatile byte xdata *) 0xD8BA)
#define    r_reg_top_gpioh5_i	0xD8BA 
#define	reg_top_gpioh5_i_pos 0
#define	reg_top_gpioh5_i_len 1
#define	reg_top_gpioh5_i_lsb 0
#define xd_p_reg_top_gpioh5_o	(*(volatile byte xdata *) 0xD8BB)
#define    p_reg_top_gpioh5_o	0xD8BB 
#define	reg_top_gpioh5_o_pos 0
#define	reg_top_gpioh5_o_len 1
#define	reg_top_gpioh5_o_lsb 0
#define xd_p_reg_top_gpioh5_en	(*(volatile byte xdata *) 0xD8BC)
#define    p_reg_top_gpioh5_en	0xD8BC 
#define	reg_top_gpioh5_en_pos 0
#define	reg_top_gpioh5_en_len 1
#define	reg_top_gpioh5_en_lsb 0
#define xd_p_reg_top_gpioh5_on	(*(volatile byte xdata *) 0xD8BD)
#define    p_reg_top_gpioh5_on	0xD8BD 
#define	reg_top_gpioh5_on_pos 0
#define	reg_top_gpioh5_on_len 1
#define	reg_top_gpioh5_on_lsb 0
#define xd_r_reg_top_gpioh4_i	(*(volatile byte xdata *) 0xD8BE)
#define    r_reg_top_gpioh4_i	0xD8BE 
#define	reg_top_gpioh4_i_pos 0
#define	reg_top_gpioh4_i_len 1
#define	reg_top_gpioh4_i_lsb 0
#define xd_p_reg_top_gpioh4_o	(*(volatile byte xdata *) 0xD8BF)
#define    p_reg_top_gpioh4_o	0xD8BF 
#define	reg_top_gpioh4_o_pos 0
#define	reg_top_gpioh4_o_len 1
#define	reg_top_gpioh4_o_lsb 0
#define xd_p_reg_top_gpioh4_en	(*(volatile byte xdata *) 0xD8C0)
#define    p_reg_top_gpioh4_en	0xD8C0 
#define	reg_top_gpioh4_en_pos 0
#define	reg_top_gpioh4_en_len 1
#define	reg_top_gpioh4_en_lsb 0
#define xd_p_reg_top_gpioh4_on	(*(volatile byte xdata *) 0xD8C1)
#define    p_reg_top_gpioh4_on	0xD8C1 
#define	reg_top_gpioh4_on_pos 0
#define	reg_top_gpioh4_on_len 1
#define	reg_top_gpioh4_on_lsb 0
#define xd_r_reg_top_gpioh7_i	(*(volatile byte xdata *) 0xD8C2)
#define    r_reg_top_gpioh7_i	0xD8C2 
#define	reg_top_gpioh7_i_pos 0
#define	reg_top_gpioh7_i_len 1
#define	reg_top_gpioh7_i_lsb 0
#define xd_p_reg_top_gpioh7_o	(*(volatile byte xdata *) 0xD8C3)
#define    p_reg_top_gpioh7_o	0xD8C3 
#define	reg_top_gpioh7_o_pos 0
#define	reg_top_gpioh7_o_len 1
#define	reg_top_gpioh7_o_lsb 0
#define xd_p_reg_top_gpioh7_en	(*(volatile byte xdata *) 0xD8C4)
#define    p_reg_top_gpioh7_en	0xD8C4 
#define	reg_top_gpioh7_en_pos 0
#define	reg_top_gpioh7_en_len 1
#define	reg_top_gpioh7_en_lsb 0
#define xd_p_reg_top_gpioh7_on	(*(volatile byte xdata *) 0xD8C5)
#define    p_reg_top_gpioh7_on	0xD8C5 
#define	reg_top_gpioh7_on_pos 0
#define	reg_top_gpioh7_on_len 1
#define	reg_top_gpioh7_on_lsb 0
#define xd_r_reg_top_gpioh6_i	(*(volatile byte xdata *) 0xD8C6)
#define    r_reg_top_gpioh6_i	0xD8C6 
#define	reg_top_gpioh6_i_pos 0
#define	reg_top_gpioh6_i_len 1
#define	reg_top_gpioh6_i_lsb 0
#define xd_p_reg_top_gpioh6_o	(*(volatile byte xdata *) 0xD8C7)
#define    p_reg_top_gpioh6_o	0xD8C7 
#define	reg_top_gpioh6_o_pos 0
#define	reg_top_gpioh6_o_len 1
#define	reg_top_gpioh6_o_lsb 0
#define xd_p_reg_top_gpioh6_en	(*(volatile byte xdata *) 0xD8C8)
#define    p_reg_top_gpioh6_en	0xD8C8 
#define	reg_top_gpioh6_en_pos 0
#define	reg_top_gpioh6_en_len 1
#define	reg_top_gpioh6_en_lsb 0
#define xd_p_reg_top_gpioh6_on	(*(volatile byte xdata *) 0xD8C9)
#define    p_reg_top_gpioh6_on	0xD8C9 
#define	reg_top_gpioh6_on_pos 0
#define	reg_top_gpioh6_on_len 1
#define	reg_top_gpioh6_on_lsb 0
#define xd_r_reg_top_ir_emit0_i	(*(volatile byte xdata *) 0xD8CA)
#define    r_reg_top_ir_emit0_i	0xD8CA 
#define	reg_top_ir_emit0_i_pos 0
#define	reg_top_ir_emit0_i_len 1
#define	reg_top_ir_emit0_i_lsb 0
#define xd_p_reg_top_ir_emit0_en	(*(volatile byte xdata *) 0xD8CC)
#define    p_reg_top_ir_emit0_en	0xD8CC 
#define	reg_top_ir_emit0_en_pos 0
#define	reg_top_ir_emit0_en_len 1
#define	reg_top_ir_emit0_en_lsb 0
#define xd_p_reg_top_ir_emit0_on	(*(volatile byte xdata *) 0xD8CD)
#define    p_reg_top_ir_emit0_on	0xD8CD 
#define	reg_top_ir_emit0_on_pos 0
#define	reg_top_ir_emit0_on_len 1
#define	reg_top_ir_emit0_on_lsb 0
#define xd_r_reg_top_gpioh8_i	(*(volatile byte xdata *) 0xD8CE)
#define    r_reg_top_gpioh8_i	0xD8CE 
#define	reg_top_gpioh8_i_pos 0
#define	reg_top_gpioh8_i_len 1
#define	reg_top_gpioh8_i_lsb 0
#define xd_p_reg_top_gpioh8_o	(*(volatile byte xdata *) 0xD8CF)
#define    p_reg_top_gpioh8_o	0xD8CF 
#define	reg_top_gpioh8_o_pos 0
#define	reg_top_gpioh8_o_len 1
#define	reg_top_gpioh8_o_lsb 0
#define xd_p_reg_top_gpioh8_en	(*(volatile byte xdata *) 0xD8D0)
#define    p_reg_top_gpioh8_en	0xD8D0 
#define	reg_top_gpioh8_en_pos 0
#define	reg_top_gpioh8_en_len 1
#define	reg_top_gpioh8_en_lsb 0
#define xd_p_reg_top_gpioh8_on	(*(volatile byte xdata *) 0xD8D1)
#define    p_reg_top_gpioh8_on	0xD8D1 
#define	reg_top_gpioh8_on_pos 0
#define	reg_top_gpioh8_on_len 1
#define	reg_top_gpioh8_on_lsb 0
#define xd_r_reg_top_ir_emit1_i	(*(volatile byte xdata *) 0xD8D2)
#define    r_reg_top_ir_emit1_i	0xD8D2 
#define	reg_top_ir_emit1_i_pos 0
#define	reg_top_ir_emit1_i_len 1
#define	reg_top_ir_emit1_i_lsb 0
#define xd_p_reg_top_ir_emit1_en	(*(volatile byte xdata *) 0xD8D4)
#define    p_reg_top_ir_emit1_en	0xD8D4 
#define	reg_top_ir_emit1_en_pos 0
#define	reg_top_ir_emit1_en_len 1
#define	reg_top_ir_emit1_en_lsb 0
#define xd_p_io_mux_led_flash_sel	(*(volatile byte xdata *) 0xD8D5)
#define    p_io_mux_led_flash_sel	0xD8D5 
#define	io_mux_led_flash_sel_pos 0
#define	io_mux_led_flash_sel_len 2
#define	io_mux_led_flash_sel_lsb 0
#define xd_p_reg_top_lock2_out	(*(volatile byte xdata *) 0xD8EE)
#define    p_reg_top_lock2_out	0xD8EE 
#define	reg_top_lock2_out_pos 0
#define	reg_top_lock2_out_len 1
#define	reg_top_lock2_out_lsb 0
#define xd_p_reg_top_lock2_tpsd	(*(volatile byte xdata *) 0xD8EF)
#define    p_reg_top_lock2_tpsd	0xD8EF 
#define	reg_top_lock2_tpsd_pos 0
#define	reg_top_lock2_tpsd_len 1
#define	reg_top_lock2_tpsd_lsb 0
#define xd_p_reg_top_lock2_o	(*(volatile byte xdata *) 0xD8F0)
#define    p_reg_top_lock2_o	0xD8F0 
#define	reg_top_lock2_o_pos 0
#define	reg_top_lock2_o_len 1
#define	reg_top_lock2_o_lsb 0
#define xd_p_reg_top_lock2_en	(*(volatile byte xdata *) 0xD8F1)
#define    p_reg_top_lock2_en	0xD8F1 
#define	reg_top_lock2_en_pos 0
#define	reg_top_lock2_en_len 1
#define	reg_top_lock2_en_lsb 0
#define xd_p_reg_top_lock2_on	(*(volatile byte xdata *) 0xD8F2)
#define    p_reg_top_lock2_on	0xD8F2 
#define	reg_top_lock2_on_pos 0
#define	reg_top_lock2_on_len 1
#define	reg_top_lock2_on_lsb 0
#define xd_p_reg_top_lock1_out	(*(volatile byte xdata *) 0xD8F3)
#define    p_reg_top_lock1_out	0xD8F3 
#define	reg_top_lock1_out_pos 0
#define	reg_top_lock1_out_len 1
#define	reg_top_lock1_out_lsb 0
#define xd_p_reg_top_lock1_tpsd	(*(volatile byte xdata *) 0xD8F4)
#define    p_reg_top_lock1_tpsd	0xD8F4 
#define	reg_top_lock1_tpsd_pos 0
#define	reg_top_lock1_tpsd_len 1
#define	reg_top_lock1_tpsd_lsb 0
#define xd_p_reg_top_lock1_o	(*(volatile byte xdata *) 0xD8F5)
#define    p_reg_top_lock1_o	0xD8F5 
#define	reg_top_lock1_o_pos 0
#define	reg_top_lock1_o_len 1
#define	reg_top_lock1_o_lsb 0
#define xd_p_reg_top_lock1_en	(*(volatile byte xdata *) 0xD8F6)
#define    p_reg_top_lock1_en	0xD8F6 
#define	reg_top_lock1_en_pos 0
#define	reg_top_lock1_en_len 1
#define	reg_top_lock1_en_lsb 0
#define xd_p_reg_top_lock1_on	(*(volatile byte xdata *) 0xD8F7)
#define    p_reg_top_lock1_on	0xD8F7 
#define	reg_top_lock1_on_pos 0
#define	reg_top_lock1_on_len 1
#define	reg_top_lock1_on_lsb 0
#define xd_p_reg_top_lock4_out	(*(volatile byte xdata *) 0xD8F8)
#define    p_reg_top_lock4_out	0xD8F8 
#define	reg_top_lock4_out_pos 0
#define	reg_top_lock4_out_len 1
#define	reg_top_lock4_out_lsb 0
#define xd_p_reg_top_lock4_tpsd	(*(volatile byte xdata *) 0xD8F9)
#define    p_reg_top_lock4_tpsd	0xD8F9 
#define	reg_top_lock4_tpsd_pos 0
#define	reg_top_lock4_tpsd_len 1
#define	reg_top_lock4_tpsd_lsb 0
#define xd_p_reg_top_lock4_o	(*(volatile byte xdata *) 0xD8FA)
#define    p_reg_top_lock4_o	0xD8FA 
#define	reg_top_lock4_o_pos 0
#define	reg_top_lock4_o_len 1
#define	reg_top_lock4_o_lsb 0
#define xd_p_reg_top_lock4_en	(*(volatile byte xdata *) 0xD8FB)
#define    p_reg_top_lock4_en	0xD8FB 
#define	reg_top_lock4_en_pos 0
#define	reg_top_lock4_en_len 1
#define	reg_top_lock4_en_lsb 0
#define xd_p_reg_top_lock4_on	(*(volatile byte xdata *) 0xD8FC)
#define    p_reg_top_lock4_on	0xD8FC 
#define	reg_top_lock4_on_pos 0
#define	reg_top_lock4_on_len 1
#define	reg_top_lock4_on_lsb 0
#define xd_p_reg_top_lock3_out	(*(volatile byte xdata *) 0xD8FD)
#define    p_reg_top_lock3_out	0xD8FD 
#define	reg_top_lock3_out_pos 0
#define	reg_top_lock3_out_len 1
#define	reg_top_lock3_out_lsb 0
#define xd_p_reg_top_lock3_tpsd	(*(volatile byte xdata *) 0xD8FE)
#define    p_reg_top_lock3_tpsd	0xD8FE 
#define	reg_top_lock3_tpsd_pos 0
#define	reg_top_lock3_tpsd_len 1
#define	reg_top_lock3_tpsd_lsb 0
#define xd_p_reg_top_lock3_o	(*(volatile byte xdata *) 0xD8FF)
#define    p_reg_top_lock3_o	0xD8FF 
#define	reg_top_lock3_o_pos 0
#define	reg_top_lock3_o_len 1
#define	reg_top_lock3_o_lsb 0
#define xd_p_reg_top_lock3_en	(*(volatile byte xdata *) 0xD900)
#define    p_reg_top_lock3_en	0xD900 
#define	reg_top_lock3_en_pos 0
#define	reg_top_lock3_en_len 1
#define	reg_top_lock3_en_lsb 0
#define xd_p_reg_top_lock3_on	(*(volatile byte xdata *) 0xD901)
#define    p_reg_top_lock3_on	0xD901 
#define	reg_top_lock3_on_pos 0
#define	reg_top_lock3_on_len 1
#define	reg_top_lock3_on_lsb 0
#define xd_p_reg_top_pwm0_en	(*(volatile byte xdata *) 0xD902)
#define    p_reg_top_pwm0_en	0xD902 
#define	reg_top_pwm0_en_pos 0
#define	reg_top_pwm0_en_len 1
#define	reg_top_pwm0_en_lsb 0
#define xd_p_reg_top_pwm1_en	(*(volatile byte xdata *) 0xD903)
#define    p_reg_top_pwm1_en	0xD903 
#define	reg_top_pwm1_en_pos 0
#define	reg_top_pwm1_en_len 1
#define	reg_top_pwm1_en_lsb 0
#define xd_p_reg_top_pwm2_en	(*(volatile byte xdata *) 0xD904)
#define    p_reg_top_pwm2_en	0xD904 
#define	reg_top_pwm2_en_pos 0
#define	reg_top_pwm2_en_len 1
#define	reg_top_pwm2_en_lsb 0
#define xd_p_reg_top_pwm3_en	(*(volatile byte xdata *) 0xD905)
#define    p_reg_top_pwm3_en	0xD905 
#define	reg_top_pwm3_en_pos 0
#define	reg_top_pwm3_en_len 1
#define	reg_top_pwm3_en_lsb 0
#define xd_p_reg_top_pwm0_gpio	(*(volatile byte xdata *) 0xD906)
#define    p_reg_top_pwm0_gpio	0xD906 
#define	reg_top_pwm0_gpio_pos 0
#define	reg_top_pwm0_gpio_len 1
#define	reg_top_pwm0_gpio_lsb 0
#define xd_p_reg_top_pwm0_pos	(*(volatile byte xdata *) 0xD907)
#define    p_reg_top_pwm0_pos	0xD907 
#define	reg_top_pwm0_pos_pos 0
#define	reg_top_pwm0_pos_len 3
#define	reg_top_pwm0_pos_lsb 0
#define xd_p_reg_top_pwm0_width	(*(volatile byte xdata *) 0xD908)
#define    p_reg_top_pwm0_width	0xD908 
#define	reg_top_pwm0_width_pos 0
#define	reg_top_pwm0_width_len 2
#define	reg_top_pwm0_width_lsb 0
#define xd_p_reg_top_pwm0_duration	(*(volatile byte xdata *) 0xD909)
#define    p_reg_top_pwm0_duration	0xD909 
#define	reg_top_pwm0_duration_pos 0
#define	reg_top_pwm0_duration_len 8
#define	reg_top_pwm0_duration_lsb 0
#define xd_p_reg_top_pwm1_gpio	(*(volatile byte xdata *) 0xD90A)
#define    p_reg_top_pwm1_gpio	0xD90A 
#define	reg_top_pwm1_gpio_pos 0
#define	reg_top_pwm1_gpio_len 1
#define	reg_top_pwm1_gpio_lsb 0
#define xd_p_reg_top_pwm1_pos	(*(volatile byte xdata *) 0xD90B)
#define    p_reg_top_pwm1_pos	0xD90B 
#define	reg_top_pwm1_pos_pos 0
#define	reg_top_pwm1_pos_len 3
#define	reg_top_pwm1_pos_lsb 0
#define xd_p_reg_top_pwm1_width	(*(volatile byte xdata *) 0xD90C)
#define    p_reg_top_pwm1_width	0xD90C 
#define	reg_top_pwm1_width_pos 0
#define	reg_top_pwm1_width_len 2
#define	reg_top_pwm1_width_lsb 0
#define xd_p_reg_top_pwm1_duration	(*(volatile byte xdata *) 0xD90D)
#define    p_reg_top_pwm1_duration	0xD90D 
#define	reg_top_pwm1_duration_pos 0
#define	reg_top_pwm1_duration_len 8
#define	reg_top_pwm1_duration_lsb 0
#define xd_p_reg_top_pwm2_gpio	(*(volatile byte xdata *) 0xD90E)
#define    p_reg_top_pwm2_gpio	0xD90E 
#define	reg_top_pwm2_gpio_pos 0
#define	reg_top_pwm2_gpio_len 1
#define	reg_top_pwm2_gpio_lsb 0
#define xd_p_reg_top_pwm2_pos	(*(volatile byte xdata *) 0xD90F)
#define    p_reg_top_pwm2_pos	0xD90F 
#define	reg_top_pwm2_pos_pos 0
#define	reg_top_pwm2_pos_len 3
#define	reg_top_pwm2_pos_lsb 0
#define xd_p_reg_top_pwm2_width	(*(volatile byte xdata *) 0xD910)
#define    p_reg_top_pwm2_width	0xD910 
#define	reg_top_pwm2_width_pos 0
#define	reg_top_pwm2_width_len 2
#define	reg_top_pwm2_width_lsb 0
#define xd_p_reg_top_pwm2_duration	(*(volatile byte xdata *) 0xD911)
#define    p_reg_top_pwm2_duration	0xD911 
#define	reg_top_pwm2_duration_pos 0
#define	reg_top_pwm2_duration_len 8
#define	reg_top_pwm2_duration_lsb 0
#define xd_p_reg_top_pwm3_gpio	(*(volatile byte xdata *) 0xD912)
#define    p_reg_top_pwm3_gpio	0xD912 
#define	reg_top_pwm3_gpio_pos 0
#define	reg_top_pwm3_gpio_len 1
#define	reg_top_pwm3_gpio_lsb 0
#define xd_p_reg_top_pwm3_pos	(*(volatile byte xdata *) 0xD913)
#define    p_reg_top_pwm3_pos	0xD913 
#define	reg_top_pwm3_pos_pos 0
#define	reg_top_pwm3_pos_len 3
#define	reg_top_pwm3_pos_lsb 0
#define xd_p_reg_top_pwm3_width	(*(volatile byte xdata *) 0xD914)
#define    p_reg_top_pwm3_width	0xD914 
#define	reg_top_pwm3_width_pos 0
#define	reg_top_pwm3_width_len 2
#define	reg_top_pwm3_width_lsb 0
#define xd_p_reg_top_pwm3_duration	(*(volatile byte xdata *) 0xD915)
#define    p_reg_top_pwm3_duration	0xD915 
#define	reg_top_pwm3_duration_pos 0
#define	reg_top_pwm3_duration_len 8
#define	reg_top_pwm3_duration_lsb 0
#define xd_p_reg_top_hostb_mpeg_par_mode	(*(volatile byte xdata *) 0xD91B)
#define    p_reg_top_hostb_mpeg_par_mode	0xD91B 
#define	reg_top_hostb_mpeg_par_mode_pos 0
#define	reg_top_hostb_mpeg_par_mode_len 1
#define	reg_top_hostb_mpeg_par_mode_lsb 0
#define xd_p_reg_top_hostb_mpeg_ser_mode	(*(volatile byte xdata *) 0xD91C)
#define    p_reg_top_hostb_mpeg_ser_mode	0xD91C 
#define	reg_top_hostb_mpeg_ser_mode_pos 0
#define	reg_top_hostb_mpeg_ser_mode_len 1
#define	reg_top_hostb_mpeg_ser_mode_lsb 0
#define xd_p_reg_top_hostb_mpeg_ser_do7	(*(volatile byte xdata *) 0xD91D)
#define    p_reg_top_hostb_mpeg_ser_do7	0xD91D 
#define	reg_top_hostb_mpeg_ser_do7_pos 0
#define	reg_top_hostb_mpeg_ser_do7_len 1
#define	reg_top_hostb_mpeg_ser_do7_lsb 0
#define xd_p_reg_top_hostb_dca_upper	(*(volatile byte xdata *) 0xD91E)
#define    p_reg_top_hostb_dca_upper	0xD91E 
#define	reg_top_hostb_dca_upper_pos 0
#define	reg_top_hostb_dca_upper_len 1
#define	reg_top_hostb_dca_upper_lsb 0
#define xd_p_reg_top_hostb_dca_lower	(*(volatile byte xdata *) 0xD91F)
#define    p_reg_top_hostb_dca_lower	0xD91F 
#define	reg_top_hostb_dca_lower_pos 0
#define	reg_top_hostb_dca_lower_len 1
#define	reg_top_hostb_dca_lower_lsb 0
#define xd_p_reg_top_host_reverse	(*(volatile byte xdata *) 0xD920)
#define    p_reg_top_host_reverse	0xD920 
#define	reg_top_host_reverse_pos 0
#define	reg_top_host_reverse_len 1
#define	reg_top_host_reverse_lsb 0
#define xd_p_reg_p_afe_test_sel	(*(volatile byte xdata *) 0xD924)
#define    p_reg_p_afe_test_sel	0xD924 
#define	reg_p_afe_test_sel_pos 0
#define	reg_p_afe_test_sel_len 1
#define	reg_p_afe_test_sel_lsb 0
#define xd_p_reg_cko_strn	(*(volatile byte xdata *) 0xD925)
#define    p_reg_cko_strn	0xD925 
#define	reg_cko_strn_pos 0
#define	reg_cko_strn_len 2
#define	reg_cko_strn_lsb 0
#define xd_p_reg_usb_cfg_speed	(*(volatile byte xdata *) 0xDD00)
#define    p_reg_usb_cfg_speed	0xDD00 
#define	reg_usb_cfg_speed_pos 0
#define	reg_usb_cfg_speed_len 1
#define	reg_usb_cfg_speed_lsb 0
#define xd_p_reg_usb_cfg_utmi16	(*(volatile byte xdata *) 0xDD00)
#define    p_reg_usb_cfg_utmi16	0xDD00 
#define	reg_usb_cfg_utmi16_pos 1
#define	reg_usb_cfg_utmi16_len 1
#define	reg_usb_cfg_utmi16_lsb 0
#define xd_p_reg_usb_cfg_test	(*(volatile byte xdata *) 0xDD00)
#define    p_reg_usb_cfg_test	0xDD00 
#define	reg_usb_cfg_test_pos 3
#define	reg_usb_cfg_test_len 3
#define	reg_usb_cfg_test_lsb 0
#define xd_p_reg_usb_port_sim_reset	(*(volatile byte xdata *) 0xDD00)
#define    p_reg_usb_port_sim_reset	0xDD00 
#define	reg_usb_port_sim_reset_pos 6
#define	reg_usb_port_sim_reset_len 1
#define	reg_usb_port_sim_reset_lsb 0
#define xd_p_reg_usb_port_run	(*(volatile byte xdata *) 0xDD00)
#define    p_reg_usb_port_run	0xDD00 
#define	reg_usb_port_run_pos 7
#define	reg_usb_port_run_len 1
#define	reg_usb_port_run_lsb 0
#define xd_r_usb_line_state_0	(*(volatile byte xdata *) 0xDD01)
#define    r_usb_line_state_0	0xDD01 
#define	usb_line_state_0_pos 0
#define	usb_line_state_0_len 1
#define	usb_line_state_0_lsb 0
#define xd_r_usb_line_state_1	(*(volatile byte xdata *) 0xDD01)
#define    r_usb_line_state_1	0xDD01 
#define	usb_line_state_1_pos 1
#define	usb_line_state_1_len 1
#define	usb_line_state_1_lsb 0
#define xd_r_reg_usb_status_speed	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_status_speed	0xDD01 
#define	reg_usb_status_speed_pos 2
#define	reg_usb_status_speed_len 1
#define	reg_usb_status_speed_lsb 0
#define xd_r_reg_usb_status_connect	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_status_connect	0xDD01 
#define	reg_usb_status_connect_pos 3
#define	reg_usb_status_connect_len 1
#define	reg_usb_status_connect_lsb 0
#define xd_r_reg_usb_rx_buf	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_rx_buf	0xDD01 
#define	reg_usb_rx_buf_pos 4
#define	reg_usb_rx_buf_len 1
#define	reg_usb_rx_buf_lsb 0
#define xd_r_reg_usb_port_reset	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_port_reset	0xDD01 
#define	reg_usb_port_reset_pos 5
#define	reg_usb_port_reset_len 1
#define	reg_usb_port_reset_lsb 0
#define xd_r_reg_usb_port_suspend	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_port_suspend	0xDD01 
#define	reg_usb_port_suspend_pos 6
#define	reg_usb_port_suspend_len 1
#define	reg_usb_port_suspend_lsb 0
#define xd_r_reg_usb_rx_buf1	(*(volatile byte xdata *) 0xDD01)
#define    r_reg_usb_rx_buf1	0xDD01 
#define	reg_usb_rx_buf1_pos 7
#define	reg_usb_rx_buf1_len 1
#define	reg_usb_rx_buf1_lsb 0
#define xd_p_reg_ep1_tx_type	(*(volatile byte xdata *) 0xDD07)
#define    p_reg_ep1_tx_type	0xDD07 
#define	reg_ep1_tx_type_pos 2
#define	reg_ep1_tx_type_len 1
#define	reg_ep1_tx_type_lsb 0
#define xd_p_reg_ep2_rx_type	(*(volatile byte xdata *) 0xDD07)
#define    p_reg_ep2_rx_type	0xDD07 
#define	reg_ep2_rx_type_pos 3
#define	reg_ep2_rx_type_len 1
#define	reg_ep2_rx_type_lsb 0
#define xd_p_reg_ep3_tx_type	(*(volatile byte xdata *) 0xDD07)
#define    p_reg_ep3_tx_type	0xDD07 
#define	reg_ep3_tx_type_pos 4
#define	reg_ep3_tx_type_len 1
#define	reg_ep3_tx_type_lsb 0
#define xd_p_reg_ep4_tx_type	(*(volatile byte xdata *) 0xDD07)
#define    p_reg_ep4_tx_type	0xDD07 
#define	reg_ep4_tx_type_pos 5
#define	reg_ep4_tx_type_len 1
#define	reg_ep4_tx_type_lsb 0
#define xd_p_reg_ep5_tx_type	(*(volatile byte xdata *) 0xDD07)
#define    p_reg_ep5_tx_type	0xDD07 
#define	reg_ep5_tx_type_pos 6
