liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_ep5_tx_len_15_8_lsb 8
#define xd_p_reg_usb_reset_addr	(*(volatile byte xdata *) 0xDD8C)
#define    p_reg_usb_reset_addr	0xDD8C 
#define	reg_usb_reset_addr_pos 0
#define	reg_usb_reset_addr_len 7
#define	reg_usb_reset_addr_lsb 0
#define xd_p_reg_usb_reset	(*(volatile byte xdata *) 0xDD8C)
#define    p_reg_usb_reset	0xDD8C 
#define	reg_usb_reset_pos 7
#define	reg_usb_reset_len 1
#define	reg_usb_reset_lsb 0
#define xd_p_reg_usb_sync_in	(*(volatile byte xdata *) 0xDD8D)
#define    p_reg_usb_sync_in	0xDD8D 
#define	reg_usb_sync_in_pos 0
#define	reg_usb_sync_in_len 1
#define	reg_usb_sync_in_lsb 0
#define xd_p_reg_usb_sync_txready	(*(volatile byte xdata *) 0xDD8D)
#define    p_reg_usb_sync_txready	0xDD8D 
#define	reg_usb_sync_txready_pos 1
#define	reg_usb_sync_txready_len 1
#define	reg_usb_sync_txready_lsb 0
#define xd_p_reg_utmi_phy_suspend	(*(volatile byte xdata *) 0xDD8D)
#define    p_reg_utmi_phy_suspend	0xDD8D 
#define	reg_utmi_phy_suspend_pos 2
#define	reg_utmi_phy_suspend_len 1
#define	reg_utmi_phy_suspend_lsb 0
#define xd_p_reg_usb_min_len	(*(volatile byte xdata *) 0xDD8D)
#define    p_reg_usb_min_len	0xDD8D 
#define	reg_usb_min_len_pos 3
#define	reg_usb_min_len_len 1
#define	reg_usb_min_len_lsb 0
#define xd_p_reg_usb_phy_clksel	(*(volatile byte xdata *) 0xDD8D)
#define    p_reg_usb_phy_clksel	0xDD8D 
#define	reg_usb_phy_clksel_pos 4
#define	reg_usb_phy_clksel_len 1
#define	reg_usb_phy_clksel_lsb 0
#define xd_p_reg_usb_clk_phase	(*(volatile byte xdata *) 0xDD93)
#define    p_reg_usb_clk_phase	0xDD93 
#define	reg_usb_clk_phase_pos 0
#define	reg_usb_clk_phase_len 2
#define	reg_usb_clk_phase_lsb 0
#define xd_p_reg_usb_clk_sel	(*(volatile byte xdata *) 0xDD93)
#define    p_reg_usb_clk_sel	0xDD93 
#define	reg_usb_clk_sel_pos 4
#define	reg_usb_clk_sel_len 4
#define	reg_usb_clk_sel_lsb 0
#define xd_p_reg_usb_fifo_ptr	(*(volatile byte xdata *) 0xDD94)
#define    p_reg_usb_fifo_ptr	0xDD94 
#define	reg_usb_fifo_ptr_pos 0
#define	reg_usb_fifo_ptr_len 3
#define	reg_usb_fifo_ptr_lsb 0
#define xd_p_reg_usb_fifo_byte	(*(volatile byte xdata *) 0xDD94)
#define    p_reg_usb_fifo_byte	0xDD94 
#define	reg_usb_fifo_byte_pos 3
#define	reg_usb_fifo_byte_len 2
#define	reg_usb_fifo_byte_lsb 0
#define xd_p_reg_usb_fifo_sys	(*(volatile byte xdata *) 0xDD94)
#define    p_reg_usb_fifo_sys	0xDD94 
#define	reg_usb_fifo_sys_pos 5
#define	reg_usb_fifo_sys_len 1
#define	reg_usb_fifo_sys_lsb 0
#define xd_p_usbdma_utmi_d_ctl_7_0	(*(volatile byte xdata *) 0xDD9E)
#define    p_usbdma_utmi_d_ctl_7_0	0xDD9E 
#define	usbdma_utmi_d_ctl_7_0_pos 0
#define	usbdma_utmi_d_ctl_7_0_len 8
#define	usbdma_utmi_d_ctl_7_0_lsb 0
#define xd_p_usbdma_utmi_d_ctl_13_8	(*(volatile byte xdata *) 0xDD9F)
#define    p_usbdma_utmi_d_ctl_13_8	0xDD9F 
#define	usbdma_utmi_d_ctl_13_8_pos 0
#define	usbdma_utmi_d_ctl_13_8_len 6
#define	usbdma_utmi_d_ctl_13_8_lsb 8
#define xd_p_usbdma_utmi_a_ctl_7_0	(*(volatile byte xdata *) 0xDDA0)
#define    p_usbdma_utmi_a_ctl_7_0	0xDDA0 
#define	usbdma_utmi_a_ctl_7_0_pos 0
#define	usbdma_utmi_a_ctl_7_0_len 8
#define	usbdma_utmi_a_ctl_7_0_lsb 0
#define xd_p_usbdma_utmi_a_ctl_15_8	(*(volatile byte xdata *) 0xDDA1)
#define    p_usbdma_utmi_a_ctl_15_8	0xDDA1 
#define	usbdma_utmi_a_ctl_15_8_pos 0
#define	usbdma_utmi_a_ctl_15_8_len 8
#define	usbdma_utmi_a_ctl_15_8_lsb 8
#define xd_p_usbdma_utmi_a_ctl_23_16	(*(volatile byte xdata *) 0xDDA2)
#define    p_usbdma_utmi_a_ctl_23_16	0xDDA2 
#define	usbdma_utmi_a_ctl_23_16_pos 0
#define	usbdma_utmi_a_ctl_23_16_len 8
#define	usbdma_utmi_a_ctl_23_16_lsb 16
#define xd_p_usbdma_utmi_a_ctl_31_24	(*(volatile byte xdata *) 0xDDA3)
#define    p_usbdma_utmi_a_ctl_31_24	0xDDA3 
#define	usbdma_utmi_a_ctl_31_24_pos 0
#define	usbdma_utmi_a_ctl_31_24_len 8
#define	usbdma_utmi_a_ctl_31_24_lsb 24
#define xd_p_usbdma_utmi_a_ctl_39_32	(*(volatile byte xdata *) 0xDDA4)
#define    p_usbdma_utmi_a_ctl_39_32	0xDDA4 
#define	usbdma_utmi_a_ctl_39_32_pos 0
#define	usbdma_utmi_a_ctl_39_32_len 8
#define	usbdma_utmi_a_ctl_39_32_lsb 32
#define xd_p_usbdma_utmi_a_ctl_47_40	(*(volatile byte xdata *) 0xDDA5)
#define    p_usbdma_utmi_a_ctl_47_40	0xDDA5 
#define	usbdma_utmi_a_ctl_47_40_pos 0
#define	usbdma_utmi_a_ctl_47_40_len 8
#define	usbdma_utmi_a_ctl_47_40_lsb 40
#define xd_p_usbdma_utmi_pwrmode	(*(volatile byte xdata *) 0xDDA6)
#define    p_usbdma_utmi_pwrmode	0xDDA6 
#define	usbdma_utmi_pwrmode_pos 3
#define	usbdma_utmi_pwrmode_len 1
#define	usbdma_utmi_pwrmode_lsb 0
#define xd_p_usbdma_utmi_test_out	(*(volatile byte xdata *) 0xDDA6)
#define    p_usbdma_utmi_test_out	0xDDA6 
#define	usbdma_utmi_test_out_pos 4
#define	usbdma_utmi_test_out_len 1
#define	usbdma_utmi_test_out_lsb 0
#define xd_p_usbdma_utmi_vbus_int_en	(*(volatile byte xdata *) 0xDDA7)
#define    p_usbdma_utmi_vbus_int_en	0xDDA7 
#define	usbdma_utmi_vbus_int_en_pos 0
#define	usbdma_utmi_vbus_int_en_len 1
#define	usbdma_utmi_vbus_int_en_lsb 0
#define xd_p_usbdma_utmi_vbus_int_pol	(*(volatile byte xdata *) 0xDDA7)
#define    p_usbdma_utmi_vbus_int_pol	0xDDA7 
#define	usbdma_utmi_vbus_int_pol_pos 1
#define	usbdma_utmi_vbus_int_pol_len 1
#define	usbdma_utmi_vbus_int_pol_lsb 0
#define xd_r_usbdma_utmi_vbus_int	(*(volatile byte xdata *) 0xDDA8)
#define    r_usbdma_utmi_vbus_int	0xDDA8 
#define	usbdma_utmi_vbus_int_pos 0
#define	usbdma_utmi_vbus_int_len 1
#define	usbdma_utmi_vbus_int_lsb 0
#define xd_r_usbdma_utmi_vbus_status	(*(volatile byte xdata *) 0xDDA8)
#define    r_usbdma_utmi_vbus_status	0xDDA8 
#define	usbdma_utmi_vbus_status_pos 1
#define	usbdma_utmi_vbus_status_len 1
#define	usbdma_utmi_vbus_status_lsb 0
#define xd_r_usbdma_utmi_clkrdy	(*(volatile byte xdata *) 0xDDA8)
#define    r_usbdma_utmi_clkrdy	0xDDA8 
#define	usbdma_utmi_clkrdy_pos 2
#define	usbdma_utmi_clkrdy_len 1
#define	usbdma_utmi_clkrdy_lsb 0
#define xd_p_ir_sys_clk	(*(volatile byte xdata *) 0xDF80)
#define    p_ir_sys_clk	0xDF80 
#define	ir_sys_clk_pos 0
#define	ir_sys_clk_len 8
#define	ir_sys_clk_lsb 0
#define xd_p_ir_sample_clk	(*(volatile byte xdata *) 0xDF81)
#define    p_ir_sample_clk	0xDF81 
#define	ir_sample_clk_pos 0
#define	ir_sample_clk_len 2
#define	ir_sample_clk_lsb 0
#define xd_p_ir_idle_polarity	(*(volatile byte xdata *) 0xDF81)
#define    p_ir_idle_polarity	0xDF81 
#define	ir_idle_polarity_pos 2
#define	ir_idle_polarity_len 1
#define	ir_idle_polarity_lsb 0
#define xd_p_ir_fifo_ovfl	(*(volatile byte xdata *) 0xDF82)
#define    p_ir_fifo_ovfl	0xDF82 
#define	ir_fifo_ovfl_pos 0
#define	ir_fifo_ovfl_len 1
#define	ir_fifo_ovfl_lsb 0
#define xd_r_ir_fifo_empty	(*(volatile byte xdata *) 0xDF82)
#define    r_ir_fifo_empty	0xDF82 
#define	ir_fifo_empty_pos 1
#define	ir_fifo_empty_len 1
#define	ir_fifo_empty_lsb 0
#define xd_r_ir_fifo_cnt	(*(volatile byte xdata *) 0xDF82)
#define    r_ir_fifo_cnt	0xDF82 
#define	ir_fifo_cnt_pos 2
#define	ir_fifo_cnt_len 3
#define	ir_fifo_cnt_lsb 0
#define xd_p_ir_fifo_rst	(*(volatile byte xdata *) 0xDF82)
#define    p_ir_fifo_rst	0xDF82 
#define	ir_fifo_rst_pos 5
#define	ir_fifo_rst_len 1
#define	ir_fifo_rst_lsb 0
#define xd_p_reg_ir_out_th0_7_0	(*(volatile byte xdata *) 0xDF84)
#define    p_reg_ir_out_th0_7_0	0xDF84 
#define	reg_ir_out_th0_7_0_pos 0
#define	reg_ir_out_th0_7_0_len 8
#define	reg_ir_out_th0_7_0_lsb 0
#define xd_p_reg_ir_out_th0_14_8	(*(volatile byte xdata *) 0xDF85)
#define    p_reg_ir_out_th0_14_8	0xDF85 
#define	reg_ir_out_th0_14_8_pos 0
#define	reg_ir_out_th0_14_8_len 7
#define	reg_ir_out_th0_14_8_lsb 8
#define xd_p_reg_ir_out_th1_7_0	(*(volatile byte xdata *) 0xDF86)
#define    p_reg_ir_out_th1_7_0	0xDF86 
#define	reg_ir_out_th1_7_0_pos 0
#define	reg_ir_out_th1_7_0_len 8
#define	reg_ir_out_th1_7_0_lsb 0
#define xd_p_reg_ir_out_th1_14_8	(*(volatile byte xdata *) 0xDF87)
#define    p_reg_ir_out_th1_14_8	0xDF87 
#define	reg_ir_out_th1_14_8_pos 0
#define	reg_ir_out_th1_14_8_len 7
#define	reg_ir_out_th1_14_8_lsb 8
#define xd_p_reg_ir_out_th2_7_0	(*(volatile byte xdata *) 0xDF88)
#define    p_reg_ir_out_th2_7_0	0xDF88 
#define	reg_ir_out_th2_7_0_pos 0
#define	reg_ir_out_th2_7_0_len 8
#define	reg_ir_out_th2_7_0_lsb 0
#define xd_p_reg_ir_out_th2_14_8	(*(volatile byte xdata *) 0xDF89)
#define    p_reg_ir_out_th2_14_8	0xDF89 
#define	reg_ir_out_th2_14_8_pos 0
#define	reg_ir_out_th2_14_8_len 7
#define	reg_ir_out_th2_14_8_lsb 8
#define xd_p_reg_ir_out_th3_7_0	(*(volatile byte xdata *) 0xDF8A)
#define    p_reg_ir_out_th3_7_0	0xDF8A 
#define	reg_ir_out_th3_7_0_pos 0
#define	reg_ir_out_th3_7_0_len 8
#define	reg_ir_out_th3_7_0_lsb 0
#define xd_p_reg_ir_out_th3_14_8	(*(volatile byte xdata *) 0xDF8B)
#define    p_reg_ir_out_th3_14_8	0xDF8B 
#define	reg_ir_out_th3_14_8_pos 0
#define	reg_ir_out_th3_14_8_len 7
#define	reg_ir_out_th3_14_8_lsb 8
#define xd_p_reg_ir_out_th4_7_0	(*(volatile byte xdata *) 0xDF8C)
#define    p_reg_ir_out_th4_7_0	0xDF8C 
#define	reg_ir_out_th4_7_0_pos 0
#define	reg_ir_out_th4_7_0_len 8
#define	reg_ir_out_th4_7_0_lsb 0
#define xd_p_reg_ir_out_th4_14_8	(*(volatile byte xdata *) 0xDF8D)
#define    p_reg_ir_out_th4_14_8	0xDF8D 
#define	reg_ir_out_th4_14_8_pos 0
#define	reg_ir_out_th4_14_8_len 7
#define	reg_ir_out_th4_14_8_lsb 8
#define xd_p_reg_ir_out_th5_7_0	(*(volatile byte xdata *) 0xDF8E)
#define    p_reg_ir_out_th5_7_0	0xDF8E 
#define	reg_ir_out_th5_7_0_pos 0
#define	reg_ir_out_th5_7_0_len 8
#define	reg_ir_out_th5_7_0_lsb 0
#define xd_p_reg_ir_out_th5_14_8	(*(volatile byte xdata *) 0xDF8F)
#define    p_reg_ir_out_th5_14_8	0xDF8F 
#define	reg_ir_out_th5_14_8_pos 0
#define	reg_ir_out_th5_14_8_len 7
#define	reg_ir_out_th5_14_8_lsb 8
#define xd_p_reg_ir_out_th6_7_0	(*(volatile byte xdata *) 0xDF90)
#define    p_reg_ir_out_th6_7_0	0xDF90 
#define	reg_ir_out_th6_7_0_pos 0
#define	reg_ir_out_th6_7_0_len 8
#define	reg_ir_out_th6_7_0_lsb 0
#define xd_p_reg_ir_out_th6_14_8	(*(volatile byte xdata *) 0xDF91)
#define    p_reg_ir_out_th6_14_8	0xDF91 
#define	reg_ir_out_th6_14_8_pos 0
#define	reg_ir_out_th6_14_8_len 7
#define	reg_ir_out_th6_14_8_lsb 8
#define xd_p_reg_ir_out_th7_7_0	(*(volatile byte xdata *) 0xDF92)
#define    p_reg_ir_out_th7_7_0	0xDF92 
#define	reg_ir_out_th7_7_0_pos 0
#define	reg_ir_out_th7_7_0_len 8
#define	reg_ir_out_th7_7_0_lsb 0
#define xd_p_reg_ir_out_th7_14_8	(*(volatile byte xdata *) 0xDF93)
#define    p_reg_ir_out_th7_14_8	0xDF93 
#define	reg_ir_out_th7_14_8_pos 0
#define	reg_ir_out_th7_14_8_len 7
#define	reg_ir_out_th7_14_8_lsb 8
#define xd_p_reg_ir_out_th8_7_0	(*(volatile byte xdata *) 0xDF94)
#define    p_reg_ir_out_th8_7_0	0xDF94 
#define	reg_ir_out_th8_7_0_pos 0
#define	reg_ir_out_th8_7_0_len 8
#define	reg_ir_out_th8_7_0_lsb 0
#define xd_p_reg_ir_out_th8_14_8	(*(volatile byte xdata *) 0xDF95)
#define    p_reg_ir_out_th8_14_8	0xDF95 
#define	reg_ir_out_th8_14_8_pos 0
#define	reg_ir_out_th8_14_8_len 7
#define	reg_ir_out_th8_14_8_lsb 8
#define xd_p_reg_ir_out_th9_7_0	(*(volatile byte xdata *) 0xDF96)
#define    p_reg_ir_out_th9_7_0	0xDF96 
#define	reg_ir_out_th9_7_0_pos 0
#define	reg_ir_out_th9_7_0_len 8
#define	reg_ir_out_th9_7_0_lsb 0
#define xd_p_reg_ir_out_th9_14_8	(*(volatile byte xdata *) 0xDF97)
#define    p_reg_ir_out_th9_14_8	0xDF97 
#define	reg_ir_out_th9_14_8_pos 0
#define	reg_ir_out_th9_14_8_len 7
#define	reg_ir_out_th9_14_8_lsb 8
#define xd_p_reg_ir_out_th10_7_0	(*(volatile byte xdata *) 0xDF98)
#define    p_reg_ir_out_th10_7_0	0xDF98 
#define	reg_ir_out_th10_7_0_pos 0
#define	reg_ir_out_th10_7_0_len 8
#define	reg_ir_out_th10_7_0_lsb 0
#define xd_p_reg_ir_out_th10_14_8	(*(volatile byte xdata *) 0xDF99)
#define    p_reg_ir_out_th10_14_8	0xDF99 
#define	reg_ir_out_th10_14_8_pos 0
#define	reg_ir_out_th10_14_8_len 7
#define	reg_ir_out_th10_14_8_lsb 8
#define xd_p_reg_ir_out_th11_7_0	(*(volatile byte xdata *) 0xDF9A)
#define    p_reg_ir_out_th11_7_0	0xDF9A 
#define	reg_ir_out_th11_7_0_pos 0
#define	reg_ir_out_th11_7_0_len 8
#define	reg_ir_out_th11_7_0_lsb 0
#define xd_p_reg_ir_out_th11_14_8	(*(volatile byte xdata *) 0xDF9B)
#define    p_reg_ir_out_th11_14_8	0xDF9B 
#define	reg_ir_out_th11_14_8_pos 0
#define	reg_ir_out_th11_14_8_len 7
#define	reg_ir_out_th11_14_8_lsb 8
#define xd_p_reg_ir_out_th12_7_0	(*(volatile byte xdata *) 0xDF9C)
#define    p_reg_ir_out_th12_7_0	0xDF9C 
#define	reg_ir_out_th12_7_0_pos 0
#define	reg_ir_out_th12_7_0_len 8
#define	reg_ir_out_th12_7_0_lsb 0
#define xd_p_reg_ir_out_th12_14_8	(*(volatile byte xdata *) 0xDF9D)
#define    p_reg_ir_out_th12_14_8	0xDF9D 
#define	reg_ir_out_th12_14_8_pos 0
#define	reg_ir_out_th12_14_8_len 7
#define	reg_ir_out_th12_14_8_lsb 8
#define xd_p_reg_ir_out_th13_7_0	(*(volatile byte xdata *) 0xDF9E)
#define    p_reg_ir_out_th13_7_0	0xDF9E 
#define	reg_ir_out_th13_7_0_pos 0
#define	reg_ir_out_th13_7_0_len 8
#define	reg_ir_out_th13_7_0_lsb 0
#define xd_p_reg_ir_out_th13_14_8	(*(volatile byte xdata *) 0xDF9F)
#define    p_reg_ir_out_th13_14_8	0xDF9F 
#define	reg_ir_out_th13_14_8_pos 0
#define	reg_ir_out_th13_14_8_len 7
#define	reg_ir_out_th13_14_8_lsb 8
#define xd_p_reg_ir_out_th14_7_0	(*(volatile byte xdata *) 0xDFA0)
#define    p_reg_ir_out_th14_7_0	0xDFA0 
#define	reg_ir_out_th14_7_0_pos 0
#define	reg_ir_out_th14_7_0_len 8
#define	reg_ir_out_th14_7_0_lsb 0
#define xd_p_reg_ir_out_th14_14_8	(*(volatile byte xdata *) 0xDFA1)
#define    p_reg_ir_out_th14_14_8	0xDFA1 
#define	reg_ir_out_th14_14_8_pos 0
#define	reg_ir_out_th14_14_8_len 7
#define	reg_ir_out_th14_14_8_lsb 8
#define xd_p_reg_wake_up_mode	(*(volatile byte xdata *) 0xDFA7)
#define    p_reg_wake_up_mode	0xDFA7 
#define	reg_wake_up_mode_pos 0
#define	reg_wake_up_mode_len 2
#define	reg_wake_up_mode_lsb 0
#define xd_p_reg_wake_up_patch_index	(*(volatile byte xdata *) 0xDFA8)
#define    p_reg_wake_up_patch_index	0xDFA8 
#define	reg_wake_up_patch_index_pos 0
#define	reg_wake_up_patch_index_len 6
#define	reg_wake_up_patch_index_lsb 0
#define xd_p_reg_wake_up_patch_1	(*(volatile byte xdata *) 0xDFA9)
#define    p_reg_wake_up_patch_1	0xDFA9 
#define	reg_wake_up_patch_1_pos 0
#define	reg_wake_up_patch_1_len 8
#define	reg_wake_up_patch_1_lsb 0
#define xd_p_reg_wake_up_patch_2	(*(volatile byte xdata *) 0xDFAA)
#define    p_reg_wake_up_patch_2	0xDFAA 
#define	reg_wake_up_patch_2_pos 0
#define	reg_wake_up_patch_2_len 8
#define	reg_wake_up_patch_2_lsb 0
#define xd_p_ir_counter_done	(*(volatile byte xdata *) 0xDFAB)
#define    p_ir_counter_done	0xDFAB 
#define	ir_counter_done_pos 0
#define	ir_counter_done_len 1
#define	ir_counter_done_lsb 0
#define xd_r_ir_slow_counter_7_0	(*(volatile byte xdata *) 0xDFAC)
#define    r_ir_slow_counter_7_0	0xDFAC 
#define	ir_slow_counter_7_0_pos 0
#define	ir_slow_counter_7_0_len 8
#define	ir_slow_counter_7_0_lsb 0
#define xd_r_ir_slow_counter_8	(*(volatile byte xdata *) 0xDFAD)
#define    r_ir_slow_counter_8	0xDFAD 
#define	ir_slow_counter_8_pos 0
#define	ir_slow_counter_8_len 1
#define	ir_slow_counter_8_lsb 8
#define xd_p_reg_wake_up_en	(*(volatile byte xdata *) 0xDFAE)
#define    p_reg_wake_up_en	0xDFAE 
#define	reg_wake_up_en_pos 0
#define	reg_wake_up_en_len 1
#define	reg_wake_up_en_lsb 0
#define xd_p_reg_wake_up_length	(*(volatile byte xdata *) 0xDFAF)
#define    p_reg_wake_up_length	0xDFAF 
#define	reg_wake_up_length_pos 0
#define	reg_wake_up_length_len 6
#define	reg_wake_up_length_lsb 0
#define xd_p_reg_wake_up_pattern_0	(*(volatile byte xdata *) 0xDFB0)
#define    p_reg_wake_up_pattern_0	0xDFB0 
#define	reg_wake_up_pattern_0_pos 0
#define	reg_wake_up_pattern_0_len 8
#define	reg_wake_up_pattern_0_lsb 0
#define xd_p_reg_wake_up_pattern_1	(*(volatile byte xdata *) 0xDFB1)
#define    p_reg_wake_up_pattern_1	0xDFB1 
#define	reg_wake_up_pattern_1_pos 0
#define	reg_wake_up_pattern_1_len 8
#define	reg_wake_up_pattern_1_lsb 0
#define xd_p_reg_wake_up_pattern_2	(*(volatile byte xdata *) 0xDFB2)
#define    p_reg_wake_up_pattern_2	0xDFB2 
#define	reg_wake_up_pattern_2_pos 0
#define	reg_wake_up_pattern_2_len 8
#define	reg_wake_up_pattern_2_lsb 0
#define xd_p_reg_wake_up_pattern_3	(*(volatile byte xdata *) 0xDFB3)
#define    p_reg_wake_up_pattern_3	0xDFB3 
#define	reg_wake_up_pattern_3_pos 0
#define	reg_wake_up_pattern_3_len 8
#define	reg_wake_up_pattern_3_lsb 0
#define xd_p_reg_wake_up_pattern_4	(*(volatile byte xdata *) 0xDFB4)
#define    p_reg_wake_up_pattern_4	0xDFB4 
#define	reg_wake_up_pattern_4_pos 0
#define	reg_wake_up_pattern_4_len 8
#define	reg_wake_up_pattern_4_lsb 0
#define xd_p_reg_wake_up_pattern_5	(*(volatile byte xdata *) 0xDFB5)
#define    p_reg_wake_up_pattern_5	0xDFB5 
#define	reg_wake_up_pattern_5_pos 0
#define	reg_wake_up_pattern_5_len 8
#define	reg_wake_up_pattern_5_lsb 0
#define xd_p_reg_wake_up_pattern_6	(*(volatile byte xdata *) 0xDFB6)
#define    p_reg_wake_up_pattern_6	0xDFB6 
#define	reg_wake_up_pattern_6_pos 0
#define	reg_wake_up_pattern_6_len 8
#define	reg_wake_up_pattern_6_lsb 0
#define xd_p_reg_wake_up_pattern_7	(*(volatile byte xdata *) 0xDFB7)
#define    p_reg_wake_up_pattern_7	0xDFB7 
#define	reg_wake_up_pattern_7_pos 0
#define	reg_wake_up_pattern_7_len 8
#define	reg_wake_up_pattern_7_lsb 0
#define xd_p_reg_wake_up_pattern_8	(*(volatile byte xdata *) 0xDFB8)
#define    p_reg_wake_up_pattern_8	0xDFB8 
#define	reg_wake_up_pattern_8_pos 0
#define	reg_wake_up_pattern_8_len 8
#define	reg_wake_up_pattern_8_lsb 0
#define xd_p_reg_wake_up_pattern_9	(*(volatile byte xdata *) 0xDFB9)
#define    p_reg_wake_up_pattern_9	0xDFB9 
#define	reg_wake_up_pattern_9_pos 0
#define	reg_wake_up_pattern_9_len 8
#define	reg_wake_up_pattern_9_lsb 0
#define xd_p_reg_wake_up_pattern_10	(*(volatile byte xdata *) 0xDFBA)
#define    p_reg_wake_up_pattern_10	0xDFBA 
#define	reg_wake_up_pattern_10_pos 0
#define	reg_wake_up_pattern_10_len 8
#define	reg_wake_up_pattern_10_lsb 0
#define xd_p_reg_wake_up_pattern_11	(*(volatile byte xdata *) 0xDFBB)
#define    p_reg_wake_up_pattern_11	0xDFBB 
#define	reg_wake_up_pattern_11_pos 0
#define	reg_wake_up_pattern_11_len 8
#define	reg_wake_up_pattern_11_lsb 0
#define xd_p_reg_wake_up_pattern_12	(*(volatile byte xdata *) 0xDFBC)
#define    p_reg_wake_up_pattern_12	0xDFBC 
#define	reg_wake_up_pattern_12_pos 0
#define	reg_wake_up_pattern_12_len 8
#define	reg_wake_up_pattern_12_lsb 0
#define xd_p_reg_wake_up_pattern_13	(*(volatile byte xdata *) 0xDFBD)
#define    p_reg_wake_up_pattern_13	0xDFBD 
#define	reg_wake_up_pattern_13_pos 0
#define	reg_wake_up_pattern_13_len 8
#define	reg_wake_up_pattern_13_lsb 0
#define xd_p_reg_wake_up_pattern_14	(*(volatile byte xdata *) 0xDFBE)
#define    p_reg_wake_up_pattern_14	0xDFBE 
#define	reg_wake_up_pattern_14_pos 0
#define	reg_wake_up_pattern_14_len 8
#define	reg_wake_up_pattern_14_lsb 0
#define xd_p_reg_wake_up_pattern_15	(*(volatile byte xdata *) 0xDFBF)
#define    p_reg_wake_up_pattern_15	0xDFBF 
#define	reg_wake_up_pattern_15_pos 0
#define	reg_wake_up_pattern_15_len 8
#define	reg_wake_up_pattern_15_lsb 0
#define xd_p_reg_wake_up_pattern_16	(*(volatile byte xdata *) 0xDFC0)
#define    p_reg_wake_up_pattern_16	0xDFC0 
#define	reg_wake_up_pattern_16_pos 0
#define	reg_wake_up_pattern_16_len 8
#define	reg_wake_up_pattern_16_lsb 0
#define xd_p_reg_wake_up_pattern_17	(*(volatile byte xdata *) 0xDFC1)
#define    p_reg_wake_up_pattern_17	0xDFC1 
#define	reg_wake_up_pattern_17_pos 0
#define	reg_wake_up_pattern_17_len 8
#define	reg_wake_up_pattern_17_lsb 0
#define xd_p_reg_wake_up_pattern_18	(*(volatile byte xdata *) 0xDFC2)
#define    p_reg_wake_up_pattern_18	0xDFC2 
#define	reg_wake_up_pattern_18_pos 0
#define	reg_wake_up_pattern_18_len 8
#define	reg_wake_up_pattern_18_lsb 0
#define xd_p_reg_wake_up_pattern_19	(*(volatile byte xdata *) 0xDFC3)
#define    p_reg_wake_up_pattern_19	0xDFC3 
#define	reg_wake_up_pattern_19_pos 0
#define	reg_wake_up_pattern_19_len 8
#define	reg_wake_up_pattern_19_lsb 0
#define xd_p_reg_wake_up_pattern_20	(*(volatile byte xdata *) 0xDFC4)
#define    p_reg_wake_up_pattern_20	0xDFC4 
#define	reg_wake_up_pattern_20_pos 0
#define	reg_wake_up_pattern_20_len 8
#define	reg_wake_up_pattern_20_lsb 0
#define xd_p_reg_wake_up_pattern_21	(*(volatile byte xdata *) 0xDFC5)
#define    p_reg_wake_up_pattern_21	0xDFC5 
#define	reg_wake_up_pattern_21_pos 0
#define	reg_wake_up_pattern_21_len 8
#define	reg_wake_up_pattern_21_lsb 0
#define xd_p_reg_wake_up_pattern_22	(*(volatile byte xdata *) 0xDFC6)
#define    p_reg_wake_up_pattern_22	0xDFC6 
#define	reg_wake_up_pattern_22_pos 0
#define	reg_wake_up_pattern_22_len 8
#define	reg_wake_up_pattern_22_lsb 0
#define xd_p_reg_wake_up_pattern_23	(*(volatile byte xdata *) 0xDFC7)
#define    p_reg_wake_up_pattern_23	0xDFC7 
#define	reg_wake_up_pattern_23_pos 0
#define	reg_wake_up_pattern_23_len 8
#define	reg_wake_up_pattern_23_lsb 0
#define xd_p_reg_wake_up_pattern_24	(*(volatile byte xdata *) 0xDFC8)
#define    p_reg_wake_up_pattern_24	0xDFC8 
#define	reg_wake_up_pattern_24_pos 0
#define	reg_wake_up_pattern_24_len 8
#define	reg_wake_up_pattern_24_lsb 0
#define xd_p_reg_wake_up_pattern_25	(*(volatile byte xdata *) 0xDFC9)
#define    p_reg_wake_up_pattern_25	0xDFC9 
#define	reg_wake_up_pattern_25_pos 0
#define	reg_wake_up_pattern_25_len 8
#define	reg_wake_up_pattern_25_lsb 0
#define xd_p_reg_wake_up_pattern_26	(*(volatile byte xdata *) 0xDFCA)
#define    p_reg_wake_up_pattern_26	0xDFCA 
#define	reg_wake_up_pattern_26_pos 0
#define	reg_wake_up_pattern_26_len 8
#define	reg_wake_up_pattern_26_lsb 0
#define xd_p_reg_wake_up_pattern_27	(*(volatile byte xdata *) 0xDFCB)
#define    p_reg_wake_up_pattern_27	0xDFCB 
#define	reg_wake_up_pattern_27_pos 0
#define	reg_wake_up_pattern_27_len 8
#define	reg_wake_up_pattern_27_lsb 0
#define xd_p_reg_wake_up_pattern_28	(*(volatile byte xdata *) 0xDFCC)
#define    p_reg_wake_up_pattern_28	0xDFCC 
#define	reg_wake_up_pattern_28_pos 0
#define	reg_wake_up_pattern_28_len 8
#define	reg_wake_up_pattern_28_lsb 0
#define xd_p_reg_wake_up_pattern_29	(*(volatile byte xdata *) 0xDFCD)
#define    p_reg_wake_up_pattern_29	0xDFCD 
#define	reg_wake_up_pattern_29_pos 0
#define	reg_wake_up_pattern_29_len 8
#define	reg_wake_up_pattern_29_lsb 0
#define xd_p_reg_wake_up_pattern_30	(*(volatile byte xdata *) 0xDFCE)
#define    p_reg_wake_up_pattern_30	0xDFCE 
#define	reg_wake_up_pattern_30_pos 0
#define	reg_wake_up_pattern_30_len 8
#define	reg_wake_up_pattern_30_lsb 0
#define xd_p_reg_wake_up_pattern_31	(*(volatile byte xdata *) 0xDFCF)
#define    p_reg_wake_up_pattern_31	0xDFCF 
#define	reg_wake_up_pattern_31_pos 0
#define	reg_wake_up_pattern_31_len 8
#define	reg_wake_up_pattern_31_lsb 0
#define xd_p_reg_wake_up_pattern_32	(*(volatile byte xdata *) 0xDFD0)
#define    p_reg_wake_up_pattern_32	0xDFD0 
#define	reg_wake_up_pattern_32_pos 0
#define	reg_wake_up_pattern_32_len 8
#define	reg_wake_up_pattern_32_lsb 0
#define xd_p_reg_wake_up_pattern_33	(*(volatile byte xdata *) 0xDFD1)
#define    p_reg_wake_up_pattern_33	0xDFD1 
#define	reg_wake_up_pattern_33_pos 0
#define	reg_wake_up_pattern_33_len 8
#define	reg_wake_up_pattern_33_lsb 0
#define xd_p_reg_wake_up_pattern_34	(*(volatile byte xdata *) 0xDFD2)
#define    p_reg_wake_up_pattern_34	0xDFD2 
#define	reg_wake_up_pattern_34_pos 0
#define	reg_wake_up_pattern_34_len 8
#define	reg_wake_up_pattern_34_lsb 0
#define xd_p_reg_wake_up_pattern_35	(*(volatile byte xdata *) 0xDFD3)
#define    p_reg_wake_up_pattern_35	0xDFD3 
#define	reg_wake_up_pattern_35_pos 0
#define	reg_wake_up_pattern_35_len 8
#define	reg_wake_up_pattern_35_lsb 0
#define xd_p_reg_wake_up_pattern_36	(*(volatile byte xdata *) 0xDFD4)
#define    p_reg_wake_up_pattern_36	0xDFD4 
#define	reg_wake_up_pattern_36_pos 0
#define	reg_wake_up_pattern_36_len 8
#define	reg_wake_up_pattern_36_lsb 0
#define xd_p_reg_wake_up_pattern_37	(*(volatile byte xdata *) 0xDFD5)
#define    p_reg_wake_up_pattern_37	0xDFD5 
#define	reg_wake_up_pattern_37_pos 0
#define	reg_wake_up_pattern_37_len 8
#define	reg_wake_up_pattern_37_lsb 0
#define xd_p_reg_wake_up_pattern_38	(*(volatile byte xdata *) 0xDFD6)
#define    p_reg_wake_up_pattern_38	0xDFD6 
#define	reg_wake_up_pattern_38_pos 0
#define	reg_wake_up_pattern_38_len 8
#define	reg_wake_up_pattern_38_lsb 0
#define xd_p_reg_wake_up_pattern_39	(*(volatile byte xdata *) 0xDFD7)
#define    p_reg_wake_up_pattern_39	0xDFD7 
#define	reg_wake_up_pattern_39_pos 0
