liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_wake_up_pattern_39_len 8
#define	reg_wake_up_pattern_39_lsb 0
#define xd_p_reg_tuner_data_7_0	(*(volatile byte xdata *) 0xF000)
#define    p_reg_tuner_data_7_0	0xF000 
#define	reg_tuner_data_7_0_pos 0
#define	reg_tuner_data_7_0_len 8
#define	reg_tuner_data_7_0_lsb 0
#define xd_p_reg_tuner_data_15_8	(*(volatile byte xdata *) 0xF001)
#define    p_reg_tuner_data_15_8	0xF001 
#define	reg_tuner_data_15_8_pos 0
#define	reg_tuner_data_15_8_len 8
#define	reg_tuner_data_15_8_lsb 8
#define xd_p_reg_tuner_data_23_16	(*(volatile byte xdata *) 0xF002)
#define    p_reg_tuner_data_23_16	0xF002 
#define	reg_tuner_data_23_16_pos 0
#define	reg_tuner_data_23_16_len 8
#define	reg_tuner_data_23_16_lsb 16
#define xd_p_reg_tuner_data_31_24	(*(volatile byte xdata *) 0xF003)
#define    p_reg_tuner_data_31_24	0xF003 
#define	reg_tuner_data_31_24_pos 0
#define	reg_tuner_data_31_24_len 8
#define	reg_tuner_data_31_24_lsb 24
#define xd_p_reg_tuner_data_39_32	(*(volatile byte xdata *) 0xF004)
#define    p_reg_tuner_data_39_32	0xF004 
#define	reg_tuner_data_39_32_pos 0
#define	reg_tuner_data_39_32_len 8
#define	reg_tuner_data_39_32_lsb 32
#define xd_p_reg_tuner_data_47_40	(*(volatile byte xdata *) 0xF005)
#define    p_reg_tuner_data_47_40	0xF005 
#define	reg_tuner_data_47_40_pos 0
#define	reg_tuner_data_47_40_len 8
#define	reg_tuner_data_47_40_lsb 40
#define xd_p_reg_tuner_data_55_48	(*(volatile byte xdata *) 0xF006)
#define    p_reg_tuner_data_55_48	0xF006 
#define	reg_tuner_data_55_48_pos 0
#define	reg_tuner_data_55_48_len 8
#define	reg_tuner_data_55_48_lsb 48
#define xd_p_reg_tuner_data_63_56	(*(volatile byte xdata *) 0xF007)
#define    p_reg_tuner_data_63_56	0xF007 
#define	reg_tuner_data_63_56_pos 0
#define	reg_tuner_data_63_56_len 8
#define	reg_tuner_data_63_56_lsb 56
#define xd_p_reg_tuner_data_71_64	(*(volatile byte xdata *) 0xF008)
#define    p_reg_tuner_data_71_64	0xF008 
#define	reg_tuner_data_71_64_pos 0
#define	reg_tuner_data_71_64_len 8
#define	reg_tuner_data_71_64_lsb 64
#define xd_p_reg_tuner_data_79_72	(*(volatile byte xdata *) 0xF009)
#define    p_reg_tuner_data_79_72	0xF009 
#define	reg_tuner_data_79_72_pos 0
#define	reg_tuner_data_79_72_len 8
#define	reg_tuner_data_79_72_lsb 72
#define xd_p_reg_tuner_data_87_80	(*(volatile byte xdata *) 0xF00A)
#define    p_reg_tuner_data_87_80	0xF00A 
#define	reg_tuner_data_87_80_pos 0
#define	reg_tuner_data_87_80_len 8
#define	reg_tuner_data_87_80_lsb 80
#define xd_p_reg_tuner_data_95_88	(*(volatile byte xdata *) 0xF00B)
#define    p_reg_tuner_data_95_88	0xF00B 
#define	reg_tuner_data_95_88_pos 0
#define	reg_tuner_data_95_88_len 8
#define	reg_tuner_data_95_88_lsb 88
#define xd_p_reg_tuner_data_103_96	(*(volatile byte xdata *) 0xF00C)
#define    p_reg_tuner_data_103_96	0xF00C 
#define	reg_tuner_data_103_96_pos 0
#define	reg_tuner_data_103_96_len 8
#define	reg_tuner_data_103_96_lsb 96
#define xd_p_reg_tuner_data_111_104	(*(volatile byte xdata *) 0xF00D)
#define    p_reg_tuner_data_111_104	0xF00D 
#define	reg_tuner_data_111_104_pos 0
#define	reg_tuner_data_111_104_len 8
#define	reg_tuner_data_111_104_lsb 104
#define xd_p_reg_tuner_data_119_112	(*(volatile byte xdata *) 0xF00E)
#define    p_reg_tuner_data_119_112	0xF00E 
#define	reg_tuner_data_119_112_pos 0
#define	reg_tuner_data_119_112_len 8
#define	reg_tuner_data_119_112_lsb 112
#define xd_p_reg_tuner_data_127_120	(*(volatile byte xdata *) 0xF00F)
#define    p_reg_tuner_data_127_120	0xF00F 
#define	reg_tuner_data_127_120_pos 0
#define	reg_tuner_data_127_120_len 8
#define	reg_tuner_data_127_120_lsb 120
#define xd_p_reg_tuner_data_135_128	(*(volatile byte xdata *) 0xF010)
#define    p_reg_tuner_data_135_128	0xF010 
#define	reg_tuner_data_135_128_pos 0
#define	reg_tuner_data_135_128_len 8
#define	reg_tuner_data_135_128_lsb 128
#define xd_p_reg_tuner_data_143_136	(*(volatile byte xdata *) 0xF011)
#define    p_reg_tuner_data_143_136	0xF011 
#define	reg_tuner_data_143_136_pos 0
#define	reg_tuner_data_143_136_len 8
#define	reg_tuner_data_143_136_lsb 136
#define xd_p_reg_tuner_data_151_144	(*(volatile byte xdata *) 0xF012)
#define    p_reg_tuner_data_151_144	0xF012 
#define	reg_tuner_data_151_144_pos 0
#define	reg_tuner_data_151_144_len 8
#define	reg_tuner_data_151_144_lsb 144
#define xd_p_reg_tuner_data_159_152	(*(volatile byte xdata *) 0xF013)
#define    p_reg_tuner_data_159_152	0xF013 
#define	reg_tuner_data_159_152_pos 0
#define	reg_tuner_data_159_152_len 8
#define	reg_tuner_data_159_152_lsb 152
#define xd_p_reg_tuner_data_167_160	(*(volatile byte xdata *) 0xF014)
#define    p_reg_tuner_data_167_160	0xF014 
#define	reg_tuner_data_167_160_pos 0
#define	reg_tuner_data_167_160_len 8
#define	reg_tuner_data_167_160_lsb 160
#define xd_p_reg_tuner_data_175_168	(*(volatile byte xdata *) 0xF015)
#define    p_reg_tuner_data_175_168	0xF015 
#define	reg_tuner_data_175_168_pos 0
#define	reg_tuner_data_175_168_len 8
#define	reg_tuner_data_175_168_lsb 168
#define xd_p_reg_tuner_data_183_176	(*(volatile byte xdata *) 0xF016)
#define    p_reg_tuner_data_183_176	0xF016 
#define	reg_tuner_data_183_176_pos 0
#define	reg_tuner_data_183_176_len 8
#define	reg_tuner_data_183_176_lsb 176
#define xd_p_reg_tuner_data_191_184	(*(volatile byte xdata *) 0xF017)
#define    p_reg_tuner_data_191_184	0xF017 
#define	reg_tuner_data_191_184_pos 0
#define	reg_tuner_data_191_184_len 8
#define	reg_tuner_data_191_184_lsb 184
#define xd_p_reg_tuner_data_199_192	(*(volatile byte xdata *) 0xF018)
#define    p_reg_tuner_data_199_192	0xF018 
#define	reg_tuner_data_199_192_pos 0
#define	reg_tuner_data_199_192_len 8
#define	reg_tuner_data_199_192_lsb 192
#define xd_p_reg_tuner_data_207_200	(*(volatile byte xdata *) 0xF019)
#define    p_reg_tuner_data_207_200	0xF019 
#define	reg_tuner_data_207_200_pos 0
#define	reg_tuner_data_207_200_len 8
#define	reg_tuner_data_207_200_lsb 200
#define xd_p_reg_tuner_data_215_208	(*(volatile byte xdata *) 0xF01A)
#define    p_reg_tuner_data_215_208	0xF01A 
#define	reg_tuner_data_215_208_pos 0
#define	reg_tuner_data_215_208_len 8
#define	reg_tuner_data_215_208_lsb 208
#define xd_p_reg_tuner_data_223_216	(*(volatile byte xdata *) 0xF01B)
#define    p_reg_tuner_data_223_216	0xF01B 
#define	reg_tuner_data_223_216_pos 0
#define	reg_tuner_data_223_216_len 8
#define	reg_tuner_data_223_216_lsb 216
#define xd_p_reg_tuner_data_231_224	(*(volatile byte xdata *) 0xF01C)
#define    p_reg_tuner_data_231_224	0xF01C 
#define	reg_tuner_data_231_224_pos 0
#define	reg_tuner_data_231_224_len 8
#define	reg_tuner_data_231_224_lsb 224
#define xd_p_reg_tuner_data_239_232	(*(volatile byte xdata *) 0xF01D)
#define    p_reg_tuner_data_239_232	0xF01D 
#define	reg_tuner_data_239_232_pos 0
#define	reg_tuner_data_239_232_len 8
#define	reg_tuner_data_239_232_lsb 232
#define xd_p_reg_tuner_data_247_240	(*(volatile byte xdata *) 0xF01E)
#define    p_reg_tuner_data_247_240	0xF01E 
#define	reg_tuner_data_247_240_pos 0
#define	reg_tuner_data_247_240_len 8
#define	reg_tuner_data_247_240_lsb 240
#define xd_p_reg_tuner_data_255_248	(*(volatile byte xdata *) 0xF01F)
#define    p_reg_tuner_data_255_248	0xF01F 
#define	reg_tuner_data_255_248_pos 0
#define	reg_tuner_data_255_248_len 8
#define	reg_tuner_data_255_248_lsb 248
#define xd_p_reg_tuner_data_263_256	(*(volatile byte xdata *) 0xF020)
#define    p_reg_tuner_data_263_256	0xF020 
#define	reg_tuner_data_263_256_pos 0
#define	reg_tuner_data_263_256_len 8
#define	reg_tuner_data_263_256_lsb 256
#define xd_p_reg_tuner_data_271_264	(*(volatile byte xdata *) 0xF021)
#define    p_reg_tuner_data_271_264	0xF021 
#define	reg_tuner_data_271_264_pos 0
#define	reg_tuner_data_271_264_len 8
#define	reg_tuner_data_271_264_lsb 264
#define xd_p_reg_tuner_data_279_272	(*(volatile byte xdata *) 0xF022)
#define    p_reg_tuner_data_279_272	0xF022 
#define	reg_tuner_data_279_272_pos 0
#define	reg_tuner_data_279_272_len 8
#define	reg_tuner_data_279_272_lsb 272
#define xd_p_reg_tuner_data_287_280	(*(volatile byte xdata *) 0xF023)
#define    p_reg_tuner_data_287_280	0xF023 
#define	reg_tuner_data_287_280_pos 0
#define	reg_tuner_data_287_280_len 8
#define	reg_tuner_data_287_280_lsb 280
#define xd_p_reg_tuner_data_295_288	(*(volatile byte xdata *) 0xF024)
#define    p_reg_tuner_data_295_288	0xF024 
#define	reg_tuner_data_295_288_pos 0
#define	reg_tuner_data_295_288_len 8
#define	reg_tuner_data_295_288_lsb 288
#define xd_p_reg_tuner_data_303_296	(*(volatile byte xdata *) 0xF025)
#define    p_reg_tuner_data_303_296	0xF025 
#define	reg_tuner_data_303_296_pos 0
#define	reg_tuner_data_303_296_len 8
#define	reg_tuner_data_303_296_lsb 296
#define xd_p_reg_tuner_data_311_304	(*(volatile byte xdata *) 0xF026)
#define    p_reg_tuner_data_311_304	0xF026 
#define	reg_tuner_data_311_304_pos 0
#define	reg_tuner_data_311_304_len 8
#define	reg_tuner_data_311_304_lsb 304
#define xd_p_reg_tuner_data_319_312	(*(volatile byte xdata *) 0xF027)
#define    p_reg_tuner_data_319_312	0xF027 
#define	reg_tuner_data_319_312_pos 0
#define	reg_tuner_data_319_312_len 8
#define	reg_tuner_data_319_312_lsb 312
#define xd_p_reg_tuner_data_327_320	(*(volatile byte xdata *) 0xF028)
#define    p_reg_tuner_data_327_320	0xF028 
#define	reg_tuner_data_327_320_pos 0
#define	reg_tuner_data_327_320_len 8
#define	reg_tuner_data_327_320_lsb 320
#define xd_p_reg_tuner_data_335_328	(*(volatile byte xdata *) 0xF029)
#define    p_reg_tuner_data_335_328	0xF029 
#define	reg_tuner_data_335_328_pos 0
#define	reg_tuner_data_335_328_len 8
#define	reg_tuner_data_335_328_lsb 328
#define xd_p_reg_tuner_data_343_336	(*(volatile byte xdata *) 0xF02A)
#define    p_reg_tuner_data_343_336	0xF02A 
#define	reg_tuner_data_343_336_pos 0
#define	reg_tuner_data_343_336_len 8
#define	reg_tuner_data_343_336_lsb 336
#define xd_p_reg_tuner_data_351_344	(*(volatile byte xdata *) 0xF02B)
#define    p_reg_tuner_data_351_344	0xF02B 
#define	reg_tuner_data_351_344_pos 0
#define	reg_tuner_data_351_344_len 8
#define	reg_tuner_data_351_344_lsb 344
#define xd_p_reg_tuner_data_359_352	(*(volatile byte xdata *) 0xF02C)
#define    p_reg_tuner_data_359_352	0xF02C 
#define	reg_tuner_data_359_352_pos 0
#define	reg_tuner_data_359_352_len 8
#define	reg_tuner_data_359_352_lsb 352
#define xd_p_reg_tuner_data_367_360	(*(volatile byte xdata *) 0xF02D)
#define    p_reg_tuner_data_367_360	0xF02D 
#define	reg_tuner_data_367_360_pos 0
#define	reg_tuner_data_367_360_len 8
#define	reg_tuner_data_367_360_lsb 360
#define xd_p_reg_tuner_data_375_368	(*(volatile byte xdata *) 0xF02E)
#define    p_reg_tuner_data_375_368	0xF02E 
#define	reg_tuner_data_375_368_pos 0
#define	reg_tuner_data_375_368_len 8
#define	reg_tuner_data_375_368_lsb 368
#define xd_p_reg_tuner_data_383_376	(*(volatile byte xdata *) 0xF02F)
#define    p_reg_tuner_data_383_376	0xF02F 
#define	reg_tuner_data_383_376_pos 0
#define	reg_tuner_data_383_376_len 8
#define	reg_tuner_data_383_376_lsb 376
#define xd_p_reg_tuner_data_391_384	(*(volatile byte xdata *) 0xF030)
#define    p_reg_tuner_data_391_384	0xF030 
#define	reg_tuner_data_391_384_pos 0
#define	reg_tuner_data_391_384_len 8
#define	reg_tuner_data_391_384_lsb 384
#define xd_p_reg_tuner_data_399_392	(*(volatile byte xdata *) 0xF031)
#define    p_reg_tuner_data_399_392	0xF031 
#define	reg_tuner_data_399_392_pos 0
#define	reg_tuner_data_399_392_len 8
#define	reg_tuner_data_399_392_lsb 392
#define xd_p_reg_tuner_data_407_400	(*(volatile byte xdata *) 0xF032)
#define    p_reg_tuner_data_407_400	0xF032 
#define	reg_tuner_data_407_400_pos 0
#define	reg_tuner_data_407_400_len 8
#define	reg_tuner_data_407_400_lsb 400
#define xd_p_reg_tuner_data_415_408	(*(volatile byte xdata *) 0xF033)
#define    p_reg_tuner_data_415_408	0xF033 
#define	reg_tuner_data_415_408_pos 0
#define	reg_tuner_data_415_408_len 8
#define	reg_tuner_data_415_408_lsb 408
#define xd_p_reg_tuner_data_423_416	(*(volatile byte xdata *) 0xF034)
#define    p_reg_tuner_data_423_416	0xF034 
#define	reg_tuner_data_423_416_pos 0
#define	reg_tuner_data_423_416_len 8
#define	reg_tuner_data_423_416_lsb 416
#define xd_p_reg_tuner_data_431_424	(*(volatile byte xdata *) 0xF035)
#define    p_reg_tuner_data_431_424	0xF035 
#define	reg_tuner_data_431_424_pos 0
#define	reg_tuner_data_431_424_len 8
#define	reg_tuner_data_431_424_lsb 424
#define xd_p_reg_tuner_data_439_432	(*(volatile byte xdata *) 0xF036)
#define    p_reg_tuner_data_439_432	0xF036 
#define	reg_tuner_data_439_432_pos 0
#define	reg_tuner_data_439_432_len 8
#define	reg_tuner_data_439_432_lsb 432
#define xd_p_reg_tuner_data_447_440	(*(volatile byte xdata *) 0xF037)
#define    p_reg_tuner_data_447_440	0xF037 
#define	reg_tuner_data_447_440_pos 0
#define	reg_tuner_data_447_440_len 8
#define	reg_tuner_data_447_440_lsb 440
#define xd_p_reg_tuner_data_455_448	(*(volatile byte xdata *) 0xF038)
#define    p_reg_tuner_data_455_448	0xF038 
#define	reg_tuner_data_455_448_pos 0
#define	reg_tuner_data_455_448_len 8
#define	reg_tuner_data_455_448_lsb 448
#define xd_p_reg_tuner_data_463_456	(*(volatile byte xdata *) 0xF039)
#define    p_reg_tuner_data_463_456	0xF039 
#define	reg_tuner_data_463_456_pos 0
#define	reg_tuner_data_463_456_len 8
#define	reg_tuner_data_463_456_lsb 456
#define xd_p_reg_tuner_data_471_464	(*(volatile byte xdata *) 0xF03A)
#define    p_reg_tuner_data_471_464	0xF03A 
#define	reg_tuner_data_471_464_pos 0
#define	reg_tuner_data_471_464_len 8
#define	reg_tuner_data_471_464_lsb 464
#define xd_p_reg_tuner_data_479_472	(*(volatile byte xdata *) 0xF03B)
#define    p_reg_tuner_data_479_472	0xF03B 
#define	reg_tuner_data_479_472_pos 0
#define	reg_tuner_data_479_472_len 8
#define	reg_tuner_data_479_472_lsb 472
#define xd_p_reg_tuner_data_487_480	(*(volatile byte xdata *) 0xF03C)
#define    p_reg_tuner_data_487_480	0xF03C 
#define	reg_tuner_data_487_480_pos 0
#define	reg_tuner_data_487_480_len 8
#define	reg_tuner_data_487_480_lsb 480
#define xd_p_reg_tuner_data_495_488	(*(volatile byte xdata *) 0xF03D)
#define    p_reg_tuner_data_495_488	0xF03D 
#define	reg_tuner_data_495_488_pos 0
#define	reg_tuner_data_495_488_len 8
#define	reg_tuner_data_495_488_lsb 488
#define xd_p_reg_tuner_data_503_496	(*(volatile byte xdata *) 0xF03E)
#define    p_reg_tuner_data_503_496	0xF03E 
#define	reg_tuner_data_503_496_pos 0
#define	reg_tuner_data_503_496_len 8
#define	reg_tuner_data_503_496_lsb 496
#define xd_p_reg_tuner_data_511_504	(*(volatile byte xdata *) 0xF03F)
#define    p_reg_tuner_data_511_504	0xF03F 
#define	reg_tuner_data_511_504_pos 0
#define	reg_tuner_data_511_504_len 8
#define	reg_tuner_data_511_504_lsb 504
#define xd_p_reg_tuner_data_519_512	(*(volatile byte xdata *) 0xF040)
#define    p_reg_tuner_data_519_512	0xF040 
#define	reg_tuner_data_519_512_pos 0
#define	reg_tuner_data_519_512_len 8
#define	reg_tuner_data_519_512_lsb 512
#define xd_p_reg_tuner_data_527_520	(*(volatile byte xdata *) 0xF041)
#define    p_reg_tuner_data_527_520	0xF041 
#define	reg_tuner_data_527_520_pos 0
#define	reg_tuner_data_527_520_len 8
#define	reg_tuner_data_527_520_lsb 520
#define xd_p_reg_tuner_data_535_528	(*(volatile byte xdata *) 0xF042)
#define    p_reg_tuner_data_535_528	0xF042 
#define	reg_tuner_data_535_528_pos 0
#define	reg_tuner_data_535_528_len 8
#define	reg_tuner_data_535_528_lsb 528
#define xd_p_reg_tuner_data_543_536	(*(volatile byte xdata *) 0xF043)
#define    p_reg_tuner_data_543_536	0xF043 
#define	reg_tuner_data_543_536_pos 0
#define	reg_tuner_data_543_536_len 8
#define	reg_tuner_data_543_536_lsb 536
#define xd_p_reg_tuner_data_551_544	(*(volatile byte xdata *) 0xF044)
#define    p_reg_tuner_data_551_544	0xF044 
#define	reg_tuner_data_551_544_pos 0
#define	reg_tuner_data_551_544_len 8
#define	reg_tuner_data_551_544_lsb 544
#define xd_p_reg_tuner_data_559_552	(*(volatile byte xdata *) 0xF045)
#define    p_reg_tuner_data_559_552	0xF045 
#define	reg_tuner_data_559_552_pos 0
#define	reg_tuner_data_559_552_len 8
#define	reg_tuner_data_559_552_lsb 552
#define xd_p_reg_tuner_data_567_560	(*(volatile byte xdata *) 0xF046)
#define    p_reg_tuner_data_567_560	0xF046 
#define	reg_tuner_data_567_560_pos 0
#define	reg_tuner_data_567_560_len 8
#define	reg_tuner_data_567_560_lsb 560
#define xd_p_reg_tuner_data_575_568	(*(volatile byte xdata *) 0xF047)
#define    p_reg_tuner_data_575_568	0xF047 
#define	reg_tuner_data_575_568_pos 0
#define	reg_tuner_data_575_568_len 8
#define	reg_tuner_data_575_568_lsb 568
#define xd_p_reg_tuner_data_583_576	(*(volatile byte xdata *) 0xF048)
#define    p_reg_tuner_data_583_576	0xF048 
#define	reg_tuner_data_583_576_pos 0
#define	reg_tuner_data_583_576_len 8
#define	reg_tuner_data_583_576_lsb 576
#define xd_p_reg_tuner_data_591_584	(*(volatile byte xdata *) 0xF049)
#define    p_reg_tuner_data_591_584	0xF049 
#define	reg_tuner_data_591_584_pos 0
#define	reg_tuner_data_591_584_len 8
#define	reg_tuner_data_591_584_lsb 584
#define xd_p_reg_tuner_data_599_592	(*(volatile byte xdata *) 0xF04A)
#define    p_reg_tuner_data_599_592	0xF04A 
#define	reg_tuner_data_599_592_pos 0
#define	reg_tuner_data_599_592_len 8
#define	reg_tuner_data_599_592_lsb 592
#define xd_p_reg_tuner_data_607_600	(*(volatile byte xdata *) 0xF04B)
#define    p_reg_tuner_data_607_600	0xF04B 
#define	reg_tuner_data_607_600_pos 0
#define	reg_tuner_data_607_600_len 8
#define	reg_tuner_data_607_600_lsb 600
#define xd_p_reg_tuner_data_615_608	(*(volatile byte xdata *) 0xF04C)
#define    p_reg_tuner_data_615_608	0xF04C 
#define	reg_tuner_data_615_608_pos 0
#define	reg_tuner_data_615_608_len 8
#define	reg_tuner_data_615_608_lsb 608
#define xd_p_reg_tuner_data_623_616	(*(volatile byte xdata *) 0xF04D)
#define    p_reg_tuner_data_623_616	0xF04D 
#define	reg_tuner_data_623_616_pos 0
#define	reg_tuner_data_623_616_len 8
#define	reg_tuner_data_623_616_lsb 616
#define xd_p_reg_tuner_data_631_624	(*(volatile byte xdata *) 0xF04E)
#define    p_reg_tuner_data_631_624	0xF04E 
#define	reg_tuner_data_631_624_pos 0
#define	reg_tuner_data_631_624_len 8
#define	reg_tuner_data_631_624_lsb 624
#define xd_p_reg_tuner_data_639_632	(*(volatile byte xdata *) 0xF04F)
#define    p_reg_tuner_data_639_632	0xF04F 
#define	reg_tuner_data_639_632_pos 0
#define	reg_tuner_data_639_632_len 8
#define	reg_tuner_data_639_632_lsb 632
#define xd_p_reg_tuner_data_647_640	(*(volatile byte xdata *) 0xF050)
#define    p_reg_tuner_data_647_640	0xF050 
#define	reg_tuner_data_647_640_pos 0
#define	reg_tuner_data_647_640_len 8
#define	reg_tuner_data_647_640_lsb 640
#define xd_p_reg_tuner_data_655_648	(*(volatile byte xdata *) 0xF051)
#define    p_reg_tuner_data_655_648	0xF051 
#define	reg_tuner_data_655_648_pos 0
#define	reg_tuner_data_655_648_len 8
#define	reg_tuner_data_655_648_lsb 648
#define xd_p_reg_tuner_data_663_656	(*(volatile byte xdata *) 0xF052)
#define    p_reg_tuner_data_663_656	0xF052 
#define	reg_tuner_data_663_656_pos 0
#define	reg_tuner_data_663_656_len 8
#define	reg_tuner_data_663_656_lsb 656
#define xd_p_reg_tuner_data_671_664	(*(volatile byte xdata *) 0xF053)
#define    p_reg_tuner_data_671_664	0xF053 
#define	reg_tuner_data_671_664_pos 0
#define	reg_tuner_data_671_664_len 8
#define	reg_tuner_data_671_664_lsb 664
#define xd_p_reg_tuner_data_679_672	(*(volatile byte xdata *) 0xF054)
#define    p_reg_tuner_data_679_672	0xF054 
#define	reg_tuner_data_679_672_pos 0
#define	reg_tuner_data_679_672_len 8
#define	reg_tuner_data_679_672_lsb 672
#define xd_p_reg_tuner_data_687_680	(*(volatile byte xdata *) 0xF055)
#define    p_reg_tuner_data_687_680	0xF055 
#define	reg_tuner_data_687_680_pos 0
#define	reg_tuner_data_687_680_len 8
#define	reg_tuner_data_687_680_lsb 680
#define xd_p_reg_tuner_data_695_688	(*(volatile byte xdata *) 0xF056)
#define    p_reg_tuner_data_695_688	0xF056 
#define	reg_tuner_data_695_688_pos 0
#define	reg_tuner_data_695_688_len 8
#define	reg_tuner_data_695_688_lsb 688
#define xd_p_reg_tuner_data_703_696	(*(volatile byte xdata *) 0xF057)
#define    p_reg_tuner_data_703_696	0xF057 
#define	reg_tuner_data_703_696_pos 0
#define	reg_tuner_data_703_696_len 8
#define	reg_tuner_data_703_696_lsb 696
#define xd_p_reg_tuner_data_711_704	(*(volatile byte xdata *) 0xF058)
#define    p_reg_tuner_data_711_704	0xF058 
#define	reg_tuner_data_711_704_pos 0
#define	reg_tuner_data_711_704_len 8
#define	reg_tuner_data_711_704_lsb 704
#define xd_p_reg_tuner_data_719_712	(*(volatile byte xdata *) 0xF059)
#define    p_reg_tuner_data_719_712	0xF059 
#define	reg_tuner_data_719_712_pos 0
#define	reg_tuner_data_719_712_len 8
#define	reg_tuner_data_719_712_lsb 712
#define xd_p_reg_tuner_data_727_720	(*(volatile byte xdata *) 0xF05A)
#define    p_reg_tuner_data_727_720	0xF05A 
#define	reg_tuner_data_727_720_pos 0
#define	reg_tuner_data_727_720_len 8
#define	reg_tuner_data_727_720_lsb 720
#define xd_p_reg_tuner_data_735_728	(*(volatile byte xdata *) 0xF05B)
#define    p_reg_tuner_data_735_728	0xF05B 
#define	reg_tuner_data_735_728_pos 0
#define	reg_tuner_data_735_728_len 8
#define	reg_tuner_data_735_728_lsb 728
#define xd_p_reg_tuner_data_743_736	(*(volatile byte xdata *) 0xF05C)
#define    p_reg_tuner_data_743_736	0xF05C 
#define	reg_tuner_data_743_736_pos 0
#define	reg_tuner_data_743_736_len 8
#define	reg_tuner_data_743_736_lsb 736
#define xd_p_reg_tuner_data_751_744	(*(volatile byte xdata *) 0xF05D)
#define    p_reg_tuner_data_751_744	0xF05D 
#define	reg_tuner_data_751_744_pos 0
#define	reg_tuner_data_751_744_len 8
#define	reg_tuner_data_751_744_lsb 744
#define xd_p_reg_tuner_data_759_752	(*(volatile byte xdata *) 0xF05E)
#define    p_reg_tuner_data_759_752	0xF05E 
#define	reg_tuner_data_759_752_pos 0
#define	reg_tuner_data_759_752_len 8
#define	reg_tuner_data_759_752_lsb 752
#define xd_p_reg_tuner_data_767_760	(*(volatile byte xdata *) 0xF05F)
#define    p_reg_tuner_data_767_760	0xF05F 
#define	reg_tuner_data_767_760_pos 0
#define	reg_tuner_data_767_760_len 8
#define	reg_tuner_data_767_760_lsb 760
#define xd_p_reg_tuner_data_775_768	(*(volatile byte xdata *) 0xF060)
#define    p_reg_tuner_data_775_768	0xF060 
#define	reg_tuner_data_775_768_pos 0
#define	reg_tuner_data_775_768_len 8
#define	reg_tuner_data_775_768_lsb 768
#define xd_p_reg_tuner_data_783_776	(*(volatile byte xdata *) 0xF061)
#define    p_reg_tuner_data_783_776	0xF061 
#define	reg_tuner_data_783_776_pos 0
#define	reg_tuner_data_783_776_len 8
#define	reg_tuner_data_783_776_lsb 776
#define xd_p_reg_tuner_data_791_784	(*(volatile byte xdata *) 0xF062)
#define    p_reg_tuner_data_791_784	0xF062 
#define	reg_tuner_data_791_784_pos 0
#define	reg_tuner_data_791_784_len 8
#define	reg_tuner_data_791_784_lsb 784
#define xd_p_reg_tuner_data_799_792	(*(volatile byte xdata *) 0xF063)
#define    p_reg_tuner_data_799_792	0xF063 
#define	reg_tuner_data_799_792_pos 0
#define	reg_tuner_data_799_792_len 8
#define	reg_tuner_data_799_792_lsb 792
#define xd_p_reg_tuner_data_807_800	(*(volatile byte xdata *) 0xF064)
#define    p_reg_tuner_data_807_800	0xF064 
#define	reg_tuner_data_807_800_pos 0
#define	reg_tuner_data_807_800_len 8
#define	reg_tuner_data_807_800_lsb 800
#define xd_p_reg_tuner_data_815_808	(*(volatile byte xdata *) 0xF065)
#define    p_reg_tuner_data_815_808	0xF065 
#define	reg_tuner_data_815_808_pos 0
#define	reg_tuner_data_815_808_len 8
#define	reg_tuner_data_815_808_lsb 808
#define xd_p_reg_tuner_data_823_816	(*(volatile byte xdata *) 0xF066)
#define    p_reg_tuner_data_823_816	0xF066 
#define	reg_tuner_data_823_816_pos 0
#define	reg_tuner_data_823_816_len 8
#define	reg_tuner_data_823_816_lsb 816
#define xd_p_reg_tuner_data_831_824	(*(volatile byte xdata *) 0xF067)
#define    p_reg_tuner_data_831_824	0xF067 
#define	reg_tuner_data_831_824_pos 0
#define	reg_tuner_data_831_824_len 8
#define	reg_tuner_data_831_824_lsb 824
#define xd_p_reg_tuner_data_839_832	(*(volatile byte xdata *) 0xF068)
#define    p_reg_tuner_data_839_832	0xF068 
#define	reg_tuner_data_839_832_pos 0
#define	reg_tuner_data_839_832_len 8
#define	reg_tuner_data_839_832_lsb 832
#define xd_p_reg_tuner_data_847_840	(*(volatile byte xdata *) 0xF069)
#define    p_reg_tuner_data_847_840	0xF069 
#define	reg_tuner_data_847_840_pos 0
#define	reg_tuner_data_847_840_len 8
#define	reg_tuner_data_847_840_lsb 840
