liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_p_reg_tuner_data_855_848	(*(volatile byte xdata *) 0xF06A)
#define    p_reg_tuner_data_855_848	0xF06A 
#define	reg_tuner_data_855_848_pos 0
#define	reg_tuner_data_855_848_len 8
#define	reg_tuner_data_855_848_lsb 848
#define xd_p_reg_tuner_data_863_856	(*(volatile byte xdata *) 0xF06B)
#define    p_reg_tuner_data_863_856	0xF06B 
#define	reg_tuner_data_863_856_pos 0
#define	reg_tuner_data_863_856_len 8
#define	reg_tuner_data_863_856_lsb 856
#define xd_p_reg_tuner_data_871_864	(*(volatile byte xdata *) 0xF06C)
#define    p_reg_tuner_data_871_864	0xF06C 
#define	reg_tuner_data_871_864_pos 0
#define	reg_tuner_data_871_864_len 8
#define	reg_tuner_data_871_864_lsb 864
#define xd_p_reg_tuner_data_879_872	(*(volatile byte xdata *) 0xF06D)
#define    p_reg_tuner_data_879_872	0xF06D 
#define	reg_tuner_data_879_872_pos 0
#define	reg_tuner_data_879_872_len 8
#define	reg_tuner_data_879_872_lsb 872
#define xd_p_reg_tuner_data_887_880	(*(volatile byte xdata *) 0xF06E)
#define    p_reg_tuner_data_887_880	0xF06E 
#define	reg_tuner_data_887_880_pos 0
#define	reg_tuner_data_887_880_len 8
#define	reg_tuner_data_887_880_lsb 880
#define xd_p_reg_tuner_data_895_888	(*(volatile byte xdata *) 0xF06F)
#define    p_reg_tuner_data_895_888	0xF06F 
#define	reg_tuner_data_895_888_pos 0
#define	reg_tuner_data_895_888_len 8
#define	reg_tuner_data_895_888_lsb 888
#define xd_p_reg_tuner_data_903_896	(*(volatile byte xdata *) 0xF070)
#define    p_reg_tuner_data_903_896	0xF070 
#define	reg_tuner_data_903_896_pos 0
#define	reg_tuner_data_903_896_len 8
#define	reg_tuner_data_903_896_lsb 896
#define xd_p_reg_tuner_data_911_904	(*(volatile byte xdata *) 0xF071)
#define    p_reg_tuner_data_911_904	0xF071 
#define	reg_tuner_data_911_904_pos 0
#define	reg_tuner_data_911_904_len 8
#define	reg_tuner_data_911_904_lsb 904
#define xd_p_reg_tuner_data_919_912	(*(volatile byte xdata *) 0xF072)
#define    p_reg_tuner_data_919_912	0xF072 
#define	reg_tuner_data_919_912_pos 0
#define	reg_tuner_data_919_912_len 8
#define	reg_tuner_data_919_912_lsb 912
#define xd_p_reg_tuner_data_927_920	(*(volatile byte xdata *) 0xF073)
#define    p_reg_tuner_data_927_920	0xF073 
#define	reg_tuner_data_927_920_pos 0
#define	reg_tuner_data_927_920_len 8
#define	reg_tuner_data_927_920_lsb 920
#define xd_p_reg_tuner_data_935_928	(*(volatile byte xdata *) 0xF074)
#define    p_reg_tuner_data_935_928	0xF074 
#define	reg_tuner_data_935_928_pos 0
#define	reg_tuner_data_935_928_len 8
#define	reg_tuner_data_935_928_lsb 928
#define xd_p_reg_tuner_data_943_936	(*(volatile byte xdata *) 0xF075)
#define    p_reg_tuner_data_943_936	0xF075 
#define	reg_tuner_data_943_936_pos 0
#define	reg_tuner_data_943_936_len 8
#define	reg_tuner_data_943_936_lsb 936
#define xd_p_reg_tuner_data_951_944	(*(volatile byte xdata *) 0xF076)
#define    p_reg_tuner_data_951_944	0xF076 
#define	reg_tuner_data_951_944_pos 0
#define	reg_tuner_data_951_944_len 8
#define	reg_tuner_data_951_944_lsb 944
#define xd_p_reg_tuner_data_959_952	(*(volatile byte xdata *) 0xF077)
#define    p_reg_tuner_data_959_952	0xF077 
#define	reg_tuner_data_959_952_pos 0
#define	reg_tuner_data_959_952_len 8
#define	reg_tuner_data_959_952_lsb 952
#define xd_p_reg_tuner_data_967_960	(*(volatile byte xdata *) 0xF078)
#define    p_reg_tuner_data_967_960	0xF078 
#define	reg_tuner_data_967_960_pos 0
#define	reg_tuner_data_967_960_len 8
#define	reg_tuner_data_967_960_lsb 960
#define xd_p_reg_tuner_data_975_968	(*(volatile byte xdata *) 0xF079)
#define    p_reg_tuner_data_975_968	0xF079 
#define	reg_tuner_data_975_968_pos 0
#define	reg_tuner_data_975_968_len 8
#define	reg_tuner_data_975_968_lsb 968
#define xd_p_reg_tuner_data_983_976	(*(volatile byte xdata *) 0xF07A)
#define    p_reg_tuner_data_983_976	0xF07A 
#define	reg_tuner_data_983_976_pos 0
#define	reg_tuner_data_983_976_len 8
#define	reg_tuner_data_983_976_lsb 976
#define xd_p_reg_tuner_data_991_984	(*(volatile byte xdata *) 0xF07B)
#define    p_reg_tuner_data_991_984	0xF07B 
#define	reg_tuner_data_991_984_pos 0
#define	reg_tuner_data_991_984_len 8
#define	reg_tuner_data_991_984_lsb 984
#define xd_p_reg_tuner_data_999_992	(*(volatile byte xdata *) 0xF07C)
#define    p_reg_tuner_data_999_992	0xF07C 
#define	reg_tuner_data_999_992_pos 0
#define	reg_tuner_data_999_992_len 8
#define	reg_tuner_data_999_992_lsb 992
#define xd_p_reg_tuner_data_1007_1000	(*(volatile byte xdata *) 0xF07D)
#define    p_reg_tuner_data_1007_1000	0xF07D 
#define	reg_tuner_data_1007_1000_pos 0
#define	reg_tuner_data_1007_1000_len 8
#define	reg_tuner_data_1007_1000_lsb 1000
#define xd_p_reg_tuner_data_1015_1008	(*(volatile byte xdata *) 0xF07E)
#define    p_reg_tuner_data_1015_1008	0xF07E 
#define	reg_tuner_data_1015_1008_pos 0
#define	reg_tuner_data_1015_1008_len 8
#define	reg_tuner_data_1015_1008_lsb 1008
#define xd_p_reg_tuner_data_1023_1016	(*(volatile byte xdata *) 0xF07F)
#define    p_reg_tuner_data_1023_1016	0xF07F 
#define	reg_tuner_data_1023_1016_pos 0
#define	reg_tuner_data_1023_1016_len 8
#define	reg_tuner_data_1023_1016_lsb 1016
#define xd_p_reg_tuner_data_1031_1024	(*(volatile byte xdata *) 0xF080)
#define    p_reg_tuner_data_1031_1024	0xF080 
#define	reg_tuner_data_1031_1024_pos 0
#define	reg_tuner_data_1031_1024_len 8
#define	reg_tuner_data_1031_1024_lsb 1024
#define xd_p_reg_tuner_data_1039_1032	(*(volatile byte xdata *) 0xF081)
#define    p_reg_tuner_data_1039_1032	0xF081 
#define	reg_tuner_data_1039_1032_pos 0
#define	reg_tuner_data_1039_1032_len 8
#define	reg_tuner_data_1039_1032_lsb 1032
#define xd_p_reg_tuner_data_1047_1040	(*(volatile byte xdata *) 0xF082)
#define    p_reg_tuner_data_1047_1040	0xF082 
#define	reg_tuner_data_1047_1040_pos 0
#define	reg_tuner_data_1047_1040_len 8
#define	reg_tuner_data_1047_1040_lsb 1040
#define xd_p_reg_tuner_data_1055_1048	(*(volatile byte xdata *) 0xF083)
#define    p_reg_tuner_data_1055_1048	0xF083 
#define	reg_tuner_data_1055_1048_pos 0
#define	reg_tuner_data_1055_1048_len 8
#define	reg_tuner_data_1055_1048_lsb 1048
#define xd_p_reg_tuner_data_1063_1056	(*(volatile byte xdata *) 0xF084)
#define    p_reg_tuner_data_1063_1056	0xF084 
#define	reg_tuner_data_1063_1056_pos 0
#define	reg_tuner_data_1063_1056_len 8
#define	reg_tuner_data_1063_1056_lsb 1056
#define xd_p_reg_tuner_data_1071_1064	(*(volatile byte xdata *) 0xF085)
#define    p_reg_tuner_data_1071_1064	0xF085 
#define	reg_tuner_data_1071_1064_pos 0
#define	reg_tuner_data_1071_1064_len 8
#define	reg_tuner_data_1071_1064_lsb 1064
#define xd_p_reg_tuner_data_1079_1072	(*(volatile byte xdata *) 0xF086)
#define    p_reg_tuner_data_1079_1072	0xF086 
#define	reg_tuner_data_1079_1072_pos 0
#define	reg_tuner_data_1079_1072_len 8
#define	reg_tuner_data_1079_1072_lsb 1072
#define xd_p_reg_tuner_data_1087_1080	(*(volatile byte xdata *) 0xF087)
#define    p_reg_tuner_data_1087_1080	0xF087 
#define	reg_tuner_data_1087_1080_pos 0
#define	reg_tuner_data_1087_1080_len 8
#define	reg_tuner_data_1087_1080_lsb 1080
#define xd_p_reg_tuner_data_1095_1088	(*(volatile byte xdata *) 0xF088)
#define    p_reg_tuner_data_1095_1088	0xF088 
#define	reg_tuner_data_1095_1088_pos 0
#define	reg_tuner_data_1095_1088_len 8
#define	reg_tuner_data_1095_1088_lsb 1088
#define xd_p_reg_tuner_data_1103_1096	(*(volatile byte xdata *) 0xF089)
#define    p_reg_tuner_data_1103_1096	0xF089 
#define	reg_tuner_data_1103_1096_pos 0
#define	reg_tuner_data_1103_1096_len 8
#define	reg_tuner_data_1103_1096_lsb 1096
#define xd_p_reg_tuner_data_1111_1104	(*(volatile byte xdata *) 0xF08A)
#define    p_reg_tuner_data_1111_1104	0xF08A 
#define	reg_tuner_data_1111_1104_pos 0
#define	reg_tuner_data_1111_1104_len 8
#define	reg_tuner_data_1111_1104_lsb 1104
#define xd_p_reg_tuner_data_1119_1112	(*(volatile byte xdata *) 0xF08B)
#define    p_reg_tuner_data_1119_1112	0xF08B 
#define	reg_tuner_data_1119_1112_pos 0
#define	reg_tuner_data_1119_1112_len 8
#define	reg_tuner_data_1119_1112_lsb 1112
#define xd_p_reg_tuner_data_1127_1120	(*(volatile byte xdata *) 0xF08C)
#define    p_reg_tuner_data_1127_1120	0xF08C 
#define	reg_tuner_data_1127_1120_pos 0
#define	reg_tuner_data_1127_1120_len 8
#define	reg_tuner_data_1127_1120_lsb 1120
#define xd_p_reg_tuner_data_1135_1128	(*(volatile byte xdata *) 0xF08D)
#define    p_reg_tuner_data_1135_1128	0xF08D 
#define	reg_tuner_data_1135_1128_pos 0
#define	reg_tuner_data_1135_1128_len 8
#define	reg_tuner_data_1135_1128_lsb 1128
#define xd_p_reg_tuner_data_1143_1136	(*(volatile byte xdata *) 0xF08E)
#define    p_reg_tuner_data_1143_1136	0xF08E 
#define	reg_tuner_data_1143_1136_pos 0
#define	reg_tuner_data_1143_1136_len 8
#define	reg_tuner_data_1143_1136_lsb 1136
#define xd_p_reg_tuner_data_1151_1144	(*(volatile byte xdata *) 0xF08F)
#define    p_reg_tuner_data_1151_1144	0xF08F 
#define	reg_tuner_data_1151_1144_pos 0
#define	reg_tuner_data_1151_1144_len 8
#define	reg_tuner_data_1151_1144_lsb 1144
#define xd_p_reg_tuner_data_1159_1152	(*(volatile byte xdata *) 0xF090)
#define    p_reg_tuner_data_1159_1152	0xF090 
#define	reg_tuner_data_1159_1152_pos 0
#define	reg_tuner_data_1159_1152_len 8
#define	reg_tuner_data_1159_1152_lsb 1152
#define xd_p_reg_tuner_data_1167_1160	(*(volatile byte xdata *) 0xF091)
#define    p_reg_tuner_data_1167_1160	0xF091 
#define	reg_tuner_data_1167_1160_pos 0
#define	reg_tuner_data_1167_1160_len 8
#define	reg_tuner_data_1167_1160_lsb 1160
#define xd_p_reg_tuner_data_1175_1168	(*(volatile byte xdata *) 0xF092)
#define    p_reg_tuner_data_1175_1168	0xF092 
#define	reg_tuner_data_1175_1168_pos 0
#define	reg_tuner_data_1175_1168_len 8
#define	reg_tuner_data_1175_1168_lsb 1168
#define xd_p_reg_tuner_data_1183_1176	(*(volatile byte xdata *) 0xF093)
#define    p_reg_tuner_data_1183_1176	0xF093 
#define	reg_tuner_data_1183_1176_pos 0
#define	reg_tuner_data_1183_1176_len 8
#define	reg_tuner_data_1183_1176_lsb 1176
#define xd_p_reg_tuner_data_1191_1184	(*(volatile byte xdata *) 0xF094)
#define    p_reg_tuner_data_1191_1184	0xF094 
#define	reg_tuner_data_1191_1184_pos 0
#define	reg_tuner_data_1191_1184_len 8
#define	reg_tuner_data_1191_1184_lsb 1184
#define xd_p_reg_tuner_data_1199_1192	(*(volatile byte xdata *) 0xF095)
#define    p_reg_tuner_data_1199_1192	0xF095 
#define	reg_tuner_data_1199_1192_pos 0
#define	reg_tuner_data_1199_1192_len 8
#define	reg_tuner_data_1199_1192_lsb 1192
#define xd_p_reg_tuner_data_1207_1200	(*(volatile byte xdata *) 0xF096)
#define    p_reg_tuner_data_1207_1200	0xF096 
#define	reg_tuner_data_1207_1200_pos 0
#define	reg_tuner_data_1207_1200_len 8
#define	reg_tuner_data_1207_1200_lsb 1200
#define xd_p_reg_tuner_data_1215_1208	(*(volatile byte xdata *) 0xF097)
#define    p_reg_tuner_data_1215_1208	0xF097 
#define	reg_tuner_data_1215_1208_pos 0
#define	reg_tuner_data_1215_1208_len 8
#define	reg_tuner_data_1215_1208_lsb 1208
#define xd_p_reg_tuner_data_1223_1216	(*(volatile byte xdata *) 0xF098)
#define    p_reg_tuner_data_1223_1216	0xF098 
#define	reg_tuner_data_1223_1216_pos 0
#define	reg_tuner_data_1223_1216_len 8
#define	reg_tuner_data_1223_1216_lsb 1216
#define xd_p_reg_tuner_data_1231_1224	(*(volatile byte xdata *) 0xF099)
#define    p_reg_tuner_data_1231_1224	0xF099 
#define	reg_tuner_data_1231_1224_pos 0
#define	reg_tuner_data_1231_1224_len 8
#define	reg_tuner_data_1231_1224_lsb 1224
#define xd_p_reg_tuner_data_1239_1232	(*(volatile byte xdata *) 0xF09A)
#define    p_reg_tuner_data_1239_1232	0xF09A 
#define	reg_tuner_data_1239_1232_pos 0
#define	reg_tuner_data_1239_1232_len 8
#define	reg_tuner_data_1239_1232_lsb 1232
#define xd_p_reg_tuner_data_1247_1240	(*(volatile byte xdata *) 0xF09B)
#define    p_reg_tuner_data_1247_1240	0xF09B 
#define	reg_tuner_data_1247_1240_pos 0
#define	reg_tuner_data_1247_1240_len 8
#define	reg_tuner_data_1247_1240_lsb 1240
#define xd_p_reg_tuner_data_1255_1248	(*(volatile byte xdata *) 0xF09C)
#define    p_reg_tuner_data_1255_1248	0xF09C 
#define	reg_tuner_data_1255_1248_pos 0
#define	reg_tuner_data_1255_1248_len 8
#define	reg_tuner_data_1255_1248_lsb 1248
#define xd_p_reg_tuner_data_1263_1256	(*(volatile byte xdata *) 0xF09D)
#define    p_reg_tuner_data_1263_1256	0xF09D 
#define	reg_tuner_data_1263_1256_pos 0
#define	reg_tuner_data_1263_1256_len 8
#define	reg_tuner_data_1263_1256_lsb 1256
#define xd_p_reg_tuner_data_1271_1264	(*(volatile byte xdata *) 0xF09E)
#define    p_reg_tuner_data_1271_1264	0xF09E 
#define	reg_tuner_data_1271_1264_pos 0
#define	reg_tuner_data_1271_1264_len 8
#define	reg_tuner_data_1271_1264_lsb 1264
#define xd_p_reg_tuner_data_1279_1272	(*(volatile byte xdata *) 0xF09F)
#define    p_reg_tuner_data_1279_1272	0xF09F 
#define	reg_tuner_data_1279_1272_pos 0
#define	reg_tuner_data_1279_1272_len 8
#define	reg_tuner_data_1279_1272_lsb 1272
#define xd_p_reg_tuner_data_1287_1280	(*(volatile byte xdata *) 0xF0A0)
#define    p_reg_tuner_data_1287_1280	0xF0A0 
#define	reg_tuner_data_1287_1280_pos 0
#define	reg_tuner_data_1287_1280_len 8
#define	reg_tuner_data_1287_1280_lsb 1280
#define xd_p_reg_tuner_data_1295_1288	(*(volatile byte xdata *) 0xF0A1)
#define    p_reg_tuner_data_1295_1288	0xF0A1 
#define	reg_tuner_data_1295_1288_pos 0
#define	reg_tuner_data_1295_1288_len 8
#define	reg_tuner_data_1295_1288_lsb 1288
#define xd_p_reg_tuner_data_1303_1296	(*(volatile byte xdata *) 0xF0A2)
#define    p_reg_tuner_data_1303_1296	0xF0A2 
#define	reg_tuner_data_1303_1296_pos 0
#define	reg_tuner_data_1303_1296_len 8
#define	reg_tuner_data_1303_1296_lsb 1296
#define xd_p_reg_tuner_data_1311_1304	(*(volatile byte xdata *) 0xF0A3)
#define    p_reg_tuner_data_1311_1304	0xF0A3 
#define	reg_tuner_data_1311_1304_pos 0
#define	reg_tuner_data_1311_1304_len 8
#define	reg_tuner_data_1311_1304_lsb 1304
#define xd_p_reg_tuner_data_1319_1312	(*(volatile byte xdata *) 0xF0A4)
#define    p_reg_tuner_data_1319_1312	0xF0A4 
#define	reg_tuner_data_1319_1312_pos 0
#define	reg_tuner_data_1319_1312_len 8
#define	reg_tuner_data_1319_1312_lsb 1312
#define xd_p_reg_tuner_data_1327_1320	(*(volatile byte xdata *) 0xF0A5)
#define    p_reg_tuner_data_1327_1320	0xF0A5 
#define	reg_tuner_data_1327_1320_pos 0
#define	reg_tuner_data_1327_1320_len 8
#define	reg_tuner_data_1327_1320_lsb 1320
#define xd_p_reg_tuner_data_1335_1328	(*(volatile byte xdata *) 0xF0A6)
#define    p_reg_tuner_data_1335_1328	0xF0A6 
#define	reg_tuner_data_1335_1328_pos 0
#define	reg_tuner_data_1335_1328_len 8
#define	reg_tuner_data_1335_1328_lsb 1328
#define xd_p_reg_tuner_data_1343_1336	(*(volatile byte xdata *) 0xF0A7)
#define    p_reg_tuner_data_1343_1336	0xF0A7 
#define	reg_tuner_data_1343_1336_pos 0
#define	reg_tuner_data_1343_1336_len 8
#define	reg_tuner_data_1343_1336_lsb 1336
#define xd_p_reg_tuner_data_1351_1344	(*(volatile byte xdata *) 0xF0A8)
#define    p_reg_tuner_data_1351_1344	0xF0A8 
#define	reg_tuner_data_1351_1344_pos 0
#define	reg_tuner_data_1351_1344_len 8
#define	reg_tuner_data_1351_1344_lsb 1344
#define xd_p_reg_tuner_data_1359_1352	(*(volatile byte xdata *) 0xF0A9)
#define    p_reg_tuner_data_1359_1352	0xF0A9 
#define	reg_tuner_data_1359_1352_pos 0
#define	reg_tuner_data_1359_1352_len 8
#define	reg_tuner_data_1359_1352_lsb 1352
#define xd_p_reg_tuner_data_1367_1360	(*(volatile byte xdata *) 0xF0AA)
#define    p_reg_tuner_data_1367_1360	0xF0AA 
#define	reg_tuner_data_1367_1360_pos 0
#define	reg_tuner_data_1367_1360_len 8
#define	reg_tuner_data_1367_1360_lsb 1360
#define xd_p_reg_tuner_data_1375_1368	(*(volatile byte xdata *) 0xF0AB)
#define    p_reg_tuner_data_1375_1368	0xF0AB 
#define	reg_tuner_data_1375_1368_pos 0
#define	reg_tuner_data_1375_1368_len 8
#define	reg_tuner_data_1375_1368_lsb 1368
#define xd_p_reg_tuner_data_1383_1376	(*(volatile byte xdata *) 0xF0AC)
#define    p_reg_tuner_data_1383_1376	0xF0AC 
#define	reg_tuner_data_1383_1376_pos 0
#define	reg_tuner_data_1383_1376_len 8
#define	reg_tuner_data_1383_1376_lsb 1376
#define xd_p_reg_tuner_data_1391_1384	(*(volatile byte xdata *) 0xF0AD)
#define    p_reg_tuner_data_1391_1384	0xF0AD 
#define	reg_tuner_data_1391_1384_pos 0
#define	reg_tuner_data_1391_1384_len 8
#define	reg_tuner_data_1391_1384_lsb 1384
#define xd_p_reg_tuner_data_1399_1392	(*(volatile byte xdata *) 0xF0AE)
#define    p_reg_tuner_data_1399_1392	0xF0AE 
#define	reg_tuner_data_1399_1392_pos 0
#define	reg_tuner_data_1399_1392_len 8
#define	reg_tuner_data_1399_1392_lsb 1392
#define xd_p_reg_tuner_data_1407_1400	(*(volatile byte xdata *) 0xF0AF)
#define    p_reg_tuner_data_1407_1400	0xF0AF 
#define	reg_tuner_data_1407_1400_pos 0
#define	reg_tuner_data_1407_1400_len 8
#define	reg_tuner_data_1407_1400_lsb 1400
#define xd_p_reg_tuner_data_1415_1408	(*(volatile byte xdata *) 0xF0B0)
#define    p_reg_tuner_data_1415_1408	0xF0B0 
#define	reg_tuner_data_1415_1408_pos 0
#define	reg_tuner_data_1415_1408_len 8
#define	reg_tuner_data_1415_1408_lsb 1408
#define xd_p_reg_tuner_data_1423_1416	(*(volatile byte xdata *) 0xF0B1)
#define    p_reg_tuner_data_1423_1416	0xF0B1 
#define	reg_tuner_data_1423_1416_pos 0
#define	reg_tuner_data_1423_1416_len 8
#define	reg_tuner_data_1423_1416_lsb 1416
#define xd_p_reg_tuner_data_1431_1424	(*(volatile byte xdata *) 0xF0B2)
#define    p_reg_tuner_data_1431_1424	0xF0B2 
#define	reg_tuner_data_1431_1424_pos 0
#define	reg_tuner_data_1431_1424_len 8
#define	reg_tuner_data_1431_1424_lsb 1424
#define xd_p_reg_tuner_data_1439_1432	(*(volatile byte xdata *) 0xF0B3)
#define    p_reg_tuner_data_1439_1432	0xF0B3 
#define	reg_tuner_data_1439_1432_pos 0
#define	reg_tuner_data_1439_1432_len 8
#define	reg_tuner_data_1439_1432_lsb 1432
#define xd_p_reg_tuner_data_1447_1440	(*(volatile byte xdata *) 0xF0B4)
#define    p_reg_tuner_data_1447_1440	0xF0B4 
#define	reg_tuner_data_1447_1440_pos 0
#define	reg_tuner_data_1447_1440_len 8
#define	reg_tuner_data_1447_1440_lsb 1440
#define xd_p_reg_tuner_data_1455_1448	(*(volatile byte xdata *) 0xF0B5)
#define    p_reg_tuner_data_1455_1448	0xF0B5 
#define	reg_tuner_data_1455_1448_pos 0
#define	reg_tuner_data_1455_1448_len 8
#define	reg_tuner_data_1455_1448_lsb 1448
#define xd_p_reg_tuner_data_1463_1456	(*(volatile byte xdata *) 0xF0B6)
#define    p_reg_tuner_data_1463_1456	0xF0B6 
#define	reg_tuner_data_1463_1456_pos 0
#define	reg_tuner_data_1463_1456_len 8
#define	reg_tuner_data_1463_1456_lsb 1456
#define xd_p_reg_tuner_data_1471_1464	(*(volatile byte xdata *) 0xF0B7)
#define    p_reg_tuner_data_1471_1464	0xF0B7 
#define	reg_tuner_data_1471_1464_pos 0
#define	reg_tuner_data_1471_1464_len 8
#define	reg_tuner_data_1471_1464_lsb 1464
#define xd_p_reg_tuner_data_1479_1472	(*(volatile byte xdata *) 0xF0B8)
#define    p_reg_tuner_data_1479_1472	0xF0B8 
#define	reg_tuner_data_1479_1472_pos 0
#define	reg_tuner_data_1479_1472_len 8
#define	reg_tuner_data_1479_1472_lsb 1472
#define xd_p_reg_tuner_data_1487_1480	(*(volatile byte xdata *) 0xF0B9)
#define    p_reg_tuner_data_1487_1480	0xF0B9 
#define	reg_tuner_data_1487_1480_pos 0
#define	reg_tuner_data_1487_1480_len 8
#define	reg_tuner_data_1487_1480_lsb 1480
#define xd_p_reg_tuner_data_1495_1488	(*(volatile byte xdata *) 0xF0BA)
#define    p_reg_tuner_data_1495_1488	0xF0BA 
#define	reg_tuner_data_1495_1488_pos 0
#define	reg_tuner_data_1495_1488_len 8
#define	reg_tuner_data_1495_1488_lsb 1488
#define xd_p_reg_tuner_data_1503_1496	(*(volatile byte xdata *) 0xF0BB)
#define    p_reg_tuner_data_1503_1496	0xF0BB 
#define	reg_tuner_data_1503_1496_pos 0
#define	reg_tuner_data_1503_1496_len 8
#define	reg_tuner_data_1503_1496_lsb 1496
#define xd_p_reg_tuner_data_1511_1504	(*(volatile byte xdata *) 0xF0BC)
#define    p_reg_tuner_data_1511_1504	0xF0BC 
#define	reg_tuner_data_1511_1504_pos 0
#define	reg_tuner_data_1511_1504_len 8
#define	reg_tuner_data_1511_1504_lsb 1504
#define xd_p_reg_tuner_data_1519_1512	(*(volatile byte xdata *) 0xF0BD)
#define    p_reg_tuner_data_1519_1512	0xF0BD 
#define	reg_tuner_data_1519_1512_pos 0
#define	reg_tuner_data_1519_1512_len 8
#define	reg_tuner_data_1519_1512_lsb 1512
#define xd_p_reg_tuner_data_1527_1520	(*(volatile byte xdata *) 0xF0BE)
#define    p_reg_tuner_data_1527_1520	0xF0BE 
#define	reg_tuner_data_1527_1520_pos 0
#define	reg_tuner_data_1527_1520_len 8
#define	reg_tuner_data_1527_1520_lsb 1520
#define xd_p_reg_tuner_data_1535_1528	(*(volatile byte xdata *) 0xF0BF)
#define    p_reg_tuner_data_1535_1528	0xF0BF 
#define	reg_tuner_data_1535_1528_pos 0
#define	reg_tuner_data_1535_1528_len 8
#define	reg_tuner_data_1535_1528_lsb 1528
#define xd_p_reg_tuner_data_1543_1536	(*(volatile byte xdata *) 0xF0C0)
#define    p_reg_tuner_data_1543_1536	0xF0C0 
#define	reg_tuner_data_1543_1536_pos 0
#define	reg_tuner_data_1543_1536_len 8
#define	reg_tuner_data_1543_1536_lsb 1536
#define xd_p_reg_tuner_data_1551_1544	(*(volatile byte xdata *) 0xF0C1)
#define    p_reg_tuner_data_1551_1544	0xF0C1 
#define	reg_tuner_data_1551_1544_pos 0
#define	reg_tuner_data_1551_1544_len 8
#define	reg_tuner_data_1551_1544_lsb 1544
#define xd_p_reg_tuner_data_1559_1552	(*(volatile byte xdata *) 0xF0C2)
#define    p_reg_tuner_data_1559_1552	0xF0C2 
#define	reg_tuner_data_1559_1552_pos 0
#define	reg_tuner_data_1559_1552_len 8
#define	reg_tuner_data_1559_1552_lsb 1552
#define xd_p_reg_tuner_data_1567_1560	(*(volatile byte xdata *) 0xF0C3)
#define    p_reg_tuner_data_1567_1560	0xF0C3 
#define	reg_tuner_data_1567_1560_pos 0
#define	reg_tuner_data_1567_1560_len 8
#define	reg_tuner_data_1567_1560_lsb 1560
#define xd_p_reg_tuner_data_1575_1568	(*(volatile byte xdata *) 0xF0C4)
#define    p_reg_tuner_data_1575_1568	0xF0C4 
#define	reg_tuner_data_1575_1568_pos 0
#define	reg_tuner_data_1575_1568_len 8
#define	reg_tuner_data_1575_1568_lsb 1568
#define xd_p_reg_tuner_data_1583_1576	(*(volatile byte xdata *) 0xF0C5)
#define    p_reg_tuner_data_1583_1576	0xF0C5 
#define	reg_tuner_data_1583_1576_pos 0
#define	reg_tuner_data_1583_1576_len 8
#define	reg_tuner_data_1583_1576_lsb 1576
#define xd_p_reg_tuner_data_1591_1584	(*(volatile byte xdata *) 0xF0C6)
#define    p_reg_tuner_data_1591_1584	0xF0C6 
#define	reg_tuner_data_1591_1584_pos 0
#define	reg_tuner_data_1591_1584_len 8
#define	reg_tuner_data_1591_1584_lsb 1584
#define xd_p_reg_tuner_data_1599_1592	(*(volatile byte xdata *) 0xF0C7)
#define    p_reg_tuner_data_1599_1592	0xF0C7 
#define	reg_tuner_data_1599_1592_pos 0
#define	reg_tuner_data_1599_1592_len 8
#define	reg_tuner_data_1599_1592_lsb 1592
#define xd_p_reg_tuner_data_1607_1600	(*(volatile byte xdata *) 0xF0C8)
#define    p_reg_tuner_data_1607_1600	0xF0C8 
#define	reg_tuner_data_1607_1600_pos 0
#define	reg_tuner_data_1607_1600_len 8
#define	reg_tuner_data_1607_1600_lsb 1600
#define xd_p_reg_tuner_data_1615_1608	(*(volatile byte xdata *) 0xF0C9)
#define    p_reg_tuner_data_1615_1608	0xF0C9 
#define	reg_tuner_data_1615_1608_pos 0
#define	reg_tuner_data_1615_1608_len 8
#define	reg_tuner_data_1615_1608_lsb 1608
#define xd_p_reg_tuner_data_1623_1616	(*(volatile byte xdata *) 0xF0CA)
#define    p_reg_tuner_data_1623_1616	0xF0CA 
#define	reg_tuner_data_1623_1616_pos 0
#define	reg_tuner_data_1623_1616_len 8
#define	reg_tuner_data_1623_1616_lsb 1616
#define xd_p_reg_tuner_data_1631_1624	(*(volatile byte xdata *) 0xF0CB)
#define    p_reg_tuner_data_1631_1624	0xF0CB 
#define	reg_tuner_data_1631_1624_pos 0
#define	reg_tuner_data_1631_1624_len 8
#define	reg_tuner_data_1631_1624_lsb 1624
#define xd_p_reg_tuner_data_1639_1632	(*(volatile byte xdata *) 0xF0CC)
#define    p_reg_tuner_data_1639_1632	0xF0CC 
#define	reg_tuner_data_1639_1632_pos 0
#define	reg_tuner_data_1639_1632_len 8
#define	reg_tuner_data_1639_1632_lsb 1632
#define xd_p_reg_tuner_data_1647_1640	(*(volatile byte xdata *) 0xF0CD)
#define    p_reg_tuner_data_1647_1640	0xF0CD 
#define	reg_tuner_data_1647_1640_pos 0
#define	reg_tuner_data_1647_1640_len 8
#define	reg_tuner_data_1647_1640_lsb 1640
#define xd_p_reg_tuner_data_1655_1648	(*(volatile byte xdata *) 0xF0CE)
#define    p_reg_tuner_data_1655_1648	0xF0CE 
#define	reg_tuner_data_1655_1648_pos 0
#define	reg_tuner_data_1655_1648_len 8
#define	reg_tuner_data_1655_1648_lsb 1648
#define xd_p_reg_tuner_data_1663_1656	(*(volatile byte xdata *) 0xF0CF)
#define    p_reg_tuner_data_1663_1656	0xF0CF 
#define	reg_tuner_data_1663_1656_pos 0
