liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define	reg_tuner_data_1663_1656_len 8
#define	reg_tuner_data_1663_1656_lsb 1656
#define xd_p_reg_tuner_data_1671_1664	(*(volatile byte xdata *) 0xF0D0)
#define    p_reg_tuner_data_1671_1664	0xF0D0 
#define	reg_tuner_data_1671_1664_pos 0
#define	reg_tuner_data_1671_1664_len 8
#define	reg_tuner_data_1671_1664_lsb 1664
#define xd_p_reg_tuner_data_1679_1672	(*(volatile byte xdata *) 0xF0D1)
#define    p_reg_tuner_data_1679_1672	0xF0D1 
#define	reg_tuner_data_1679_1672_pos 0
#define	reg_tuner_data_1679_1672_len 8
#define	reg_tuner_data_1679_1672_lsb 1672
#define xd_p_reg_tuner_data_1687_1680	(*(volatile byte xdata *) 0xF0D2)
#define    p_reg_tuner_data_1687_1680	0xF0D2 
#define	reg_tuner_data_1687_1680_pos 0
#define	reg_tuner_data_1687_1680_len 8
#define	reg_tuner_data_1687_1680_lsb 1680
#define xd_p_reg_tuner_data_1695_1688	(*(volatile byte xdata *) 0xF0D3)
#define    p_reg_tuner_data_1695_1688	0xF0D3 
#define	reg_tuner_data_1695_1688_pos 0
#define	reg_tuner_data_1695_1688_len 8
#define	reg_tuner_data_1695_1688_lsb 1688
#define xd_p_reg_tuner_data_1703_1696	(*(volatile byte xdata *) 0xF0D4)
#define    p_reg_tuner_data_1703_1696	0xF0D4 
#define	reg_tuner_data_1703_1696_pos 0
#define	reg_tuner_data_1703_1696_len 8
#define	reg_tuner_data_1703_1696_lsb 1696
#define xd_p_reg_tuner_data_1711_1704	(*(volatile byte xdata *) 0xF0D5)
#define    p_reg_tuner_data_1711_1704	0xF0D5 
#define	reg_tuner_data_1711_1704_pos 0
#define	reg_tuner_data_1711_1704_len 8
#define	reg_tuner_data_1711_1704_lsb 1704
#define xd_p_reg_tuner_data_1719_1712	(*(volatile byte xdata *) 0xF0D6)
#define    p_reg_tuner_data_1719_1712	0xF0D6 
#define	reg_tuner_data_1719_1712_pos 0
#define	reg_tuner_data_1719_1712_len 8
#define	reg_tuner_data_1719_1712_lsb 1712
#define xd_p_reg_tuner_data_1727_1720	(*(volatile byte xdata *) 0xF0D7)
#define    p_reg_tuner_data_1727_1720	0xF0D7 
#define	reg_tuner_data_1727_1720_pos 0
#define	reg_tuner_data_1727_1720_len 8
#define	reg_tuner_data_1727_1720_lsb 1720
#define xd_p_reg_tuner_data_1735_1728	(*(volatile byte xdata *) 0xF0D8)
#define    p_reg_tuner_data_1735_1728	0xF0D8 
#define	reg_tuner_data_1735_1728_pos 0
#define	reg_tuner_data_1735_1728_len 8
#define	reg_tuner_data_1735_1728_lsb 1728
#define xd_p_reg_tuner_data_1743_1736	(*(volatile byte xdata *) 0xF0D9)
#define    p_reg_tuner_data_1743_1736	0xF0D9 
#define	reg_tuner_data_1743_1736_pos 0
#define	reg_tuner_data_1743_1736_len 8
#define	reg_tuner_data_1743_1736_lsb 1736
#define xd_p_reg_tuner_data_1751_1744	(*(volatile byte xdata *) 0xF0DA)
#define    p_reg_tuner_data_1751_1744	0xF0DA 
#define	reg_tuner_data_1751_1744_pos 0
#define	reg_tuner_data_1751_1744_len 8
#define	reg_tuner_data_1751_1744_lsb 1744
#define xd_p_reg_tuner_data_1759_1752	(*(volatile byte xdata *) 0xF0DB)
#define    p_reg_tuner_data_1759_1752	0xF0DB 
#define	reg_tuner_data_1759_1752_pos 0
#define	reg_tuner_data_1759_1752_len 8
#define	reg_tuner_data_1759_1752_lsb 1752
#define xd_p_reg_tuner_data_1767_1760	(*(volatile byte xdata *) 0xF0DC)
#define    p_reg_tuner_data_1767_1760	0xF0DC 
#define	reg_tuner_data_1767_1760_pos 0
#define	reg_tuner_data_1767_1760_len 8
#define	reg_tuner_data_1767_1760_lsb 1760
#define xd_p_reg_tuner_data_1775_1768	(*(volatile byte xdata *) 0xF0DD)
#define    p_reg_tuner_data_1775_1768	0xF0DD 
#define	reg_tuner_data_1775_1768_pos 0
#define	reg_tuner_data_1775_1768_len 8
#define	reg_tuner_data_1775_1768_lsb 1768
#define xd_p_reg_tuner_data_1783_1776	(*(volatile byte xdata *) 0xF0DE)
#define    p_reg_tuner_data_1783_1776	0xF0DE 
#define	reg_tuner_data_1783_1776_pos 0
#define	reg_tuner_data_1783_1776_len 8
#define	reg_tuner_data_1783_1776_lsb 1776
#define xd_p_reg_tuner_data_1791_1784	(*(volatile byte xdata *) 0xF0DF)
#define    p_reg_tuner_data_1791_1784	0xF0DF 
#define	reg_tuner_data_1791_1784_pos 0
#define	reg_tuner_data_1791_1784_len 8
#define	reg_tuner_data_1791_1784_lsb 1784
#define xd_p_reg_tuner_data_1799_1792	(*(volatile byte xdata *) 0xF0E0)
#define    p_reg_tuner_data_1799_1792	0xF0E0 
#define	reg_tuner_data_1799_1792_pos 0
#define	reg_tuner_data_1799_1792_len 8
#define	reg_tuner_data_1799_1792_lsb 1792
#define xd_p_reg_tuner_data_1807_1800	(*(volatile byte xdata *) 0xF0E1)
#define    p_reg_tuner_data_1807_1800	0xF0E1 
#define	reg_tuner_data_1807_1800_pos 0
#define	reg_tuner_data_1807_1800_len 8
#define	reg_tuner_data_1807_1800_lsb 1800
#define xd_p_reg_tuner_data_1815_1808	(*(volatile byte xdata *) 0xF0E2)
#define    p_reg_tuner_data_1815_1808	0xF0E2 
#define	reg_tuner_data_1815_1808_pos 0
#define	reg_tuner_data_1815_1808_len 8
#define	reg_tuner_data_1815_1808_lsb 1808
#define xd_p_reg_tuner_data_1823_1816	(*(volatile byte xdata *) 0xF0E3)
#define    p_reg_tuner_data_1823_1816	0xF0E3 
#define	reg_tuner_data_1823_1816_pos 0
#define	reg_tuner_data_1823_1816_len 8
#define	reg_tuner_data_1823_1816_lsb 1816
#define xd_p_reg_tuner_data_1831_1824	(*(volatile byte xdata *) 0xF0E4)
#define    p_reg_tuner_data_1831_1824	0xF0E4 
#define	reg_tuner_data_1831_1824_pos 0
#define	reg_tuner_data_1831_1824_len 8
#define	reg_tuner_data_1831_1824_lsb 1824
#define xd_p_reg_tuner_data_1839_1832	(*(volatile byte xdata *) 0xF0E5)
#define    p_reg_tuner_data_1839_1832	0xF0E5 
#define	reg_tuner_data_1839_1832_pos 0
#define	reg_tuner_data_1839_1832_len 8
#define	reg_tuner_data_1839_1832_lsb 1832
#define xd_p_reg_tuner_data_1847_1840	(*(volatile byte xdata *) 0xF0E6)
#define    p_reg_tuner_data_1847_1840	0xF0E6 
#define	reg_tuner_data_1847_1840_pos 0
#define	reg_tuner_data_1847_1840_len 8
#define	reg_tuner_data_1847_1840_lsb 1840
#define xd_p_reg_tuner_data_1855_1848	(*(volatile byte xdata *) 0xF0E7)
#define    p_reg_tuner_data_1855_1848	0xF0E7 
#define	reg_tuner_data_1855_1848_pos 0
#define	reg_tuner_data_1855_1848_len 8
#define	reg_tuner_data_1855_1848_lsb 1848
#define xd_p_reg_tuner_data_1863_1856	(*(volatile byte xdata *) 0xF0E8)
#define    p_reg_tuner_data_1863_1856	0xF0E8 
#define	reg_tuner_data_1863_1856_pos 0
#define	reg_tuner_data_1863_1856_len 8
#define	reg_tuner_data_1863_1856_lsb 1856
#define xd_p_reg_tuner_data_1871_1864	(*(volatile byte xdata *) 0xF0E9)
#define    p_reg_tuner_data_1871_1864	0xF0E9 
#define	reg_tuner_data_1871_1864_pos 0
#define	reg_tuner_data_1871_1864_len 8
#define	reg_tuner_data_1871_1864_lsb 1864
#define xd_p_reg_tuner_data_1879_1872	(*(volatile byte xdata *) 0xF0EA)
#define    p_reg_tuner_data_1879_1872	0xF0EA 
#define	reg_tuner_data_1879_1872_pos 0
#define	reg_tuner_data_1879_1872_len 8
#define	reg_tuner_data_1879_1872_lsb 1872
#define xd_p_reg_tuner_data_1887_1880	(*(volatile byte xdata *) 0xF0EB)
#define    p_reg_tuner_data_1887_1880	0xF0EB 
#define	reg_tuner_data_1887_1880_pos 0
#define	reg_tuner_data_1887_1880_len 8
#define	reg_tuner_data_1887_1880_lsb 1880
#define xd_p_reg_tuner_data_1895_1888	(*(volatile byte xdata *) 0xF0EC)
#define    p_reg_tuner_data_1895_1888	0xF0EC 
#define	reg_tuner_data_1895_1888_pos 0
#define	reg_tuner_data_1895_1888_len 8
#define	reg_tuner_data_1895_1888_lsb 1888
#define xd_p_reg_tuner_data_1903_1896	(*(volatile byte xdata *) 0xF0ED)
#define    p_reg_tuner_data_1903_1896	0xF0ED 
#define	reg_tuner_data_1903_1896_pos 0
#define	reg_tuner_data_1903_1896_len 8
#define	reg_tuner_data_1903_1896_lsb 1896
#define xd_p_reg_tuner_data_1911_1904	(*(volatile byte xdata *) 0xF0EE)
#define    p_reg_tuner_data_1911_1904	0xF0EE 
#define	reg_tuner_data_1911_1904_pos 0
#define	reg_tuner_data_1911_1904_len 8
#define	reg_tuner_data_1911_1904_lsb 1904
#define xd_p_reg_tuner_data_1919_1912	(*(volatile byte xdata *) 0xF0EF)
#define    p_reg_tuner_data_1919_1912	0xF0EF 
#define	reg_tuner_data_1919_1912_pos 0
#define	reg_tuner_data_1919_1912_len 8
#define	reg_tuner_data_1919_1912_lsb 1912
#define xd_p_reg_tuner_data_1927_1920	(*(volatile byte xdata *) 0xF0F0)
#define    p_reg_tuner_data_1927_1920	0xF0F0 
#define	reg_tuner_data_1927_1920_pos 0
#define	reg_tuner_data_1927_1920_len 8
#define	reg_tuner_data_1927_1920_lsb 1920
#define xd_p_reg_tuner_data_1935_1928	(*(volatile byte xdata *) 0xF0F1)
#define    p_reg_tuner_data_1935_1928	0xF0F1 
#define	reg_tuner_data_1935_1928_pos 0
#define	reg_tuner_data_1935_1928_len 8
#define	reg_tuner_data_1935_1928_lsb 1928
#define xd_p_reg_tuner_data_1943_1936	(*(volatile byte xdata *) 0xF0F2)
#define    p_reg_tuner_data_1943_1936	0xF0F2 
#define	reg_tuner_data_1943_1936_pos 0
#define	reg_tuner_data_1943_1936_len 8
#define	reg_tuner_data_1943_1936_lsb 1936
#define xd_p_reg_tuner_data_1951_1944	(*(volatile byte xdata *) 0xF0F3)
#define    p_reg_tuner_data_1951_1944	0xF0F3 
#define	reg_tuner_data_1951_1944_pos 0
#define	reg_tuner_data_1951_1944_len 8
#define	reg_tuner_data_1951_1944_lsb 1944
#define xd_p_reg_tuner_data_1959_1952	(*(volatile byte xdata *) 0xF0F4)
#define    p_reg_tuner_data_1959_1952	0xF0F4 
#define	reg_tuner_data_1959_1952_pos 0
#define	reg_tuner_data_1959_1952_len 8
#define	reg_tuner_data_1959_1952_lsb 1952
#define xd_p_reg_tuner_data_1967_1960	(*(volatile byte xdata *) 0xF0F5)
#define    p_reg_tuner_data_1967_1960	0xF0F5 
#define	reg_tuner_data_1967_1960_pos 0
#define	reg_tuner_data_1967_1960_len 8
#define	reg_tuner_data_1967_1960_lsb 1960
#define xd_p_reg_tuner_data_1975_1968	(*(volatile byte xdata *) 0xF0F6)
#define    p_reg_tuner_data_1975_1968	0xF0F6 
#define	reg_tuner_data_1975_1968_pos 0
#define	reg_tuner_data_1975_1968_len 8
#define	reg_tuner_data_1975_1968_lsb 1968
#define xd_p_reg_tuner_data_1983_1976	(*(volatile byte xdata *) 0xF0F7)
#define    p_reg_tuner_data_1983_1976	0xF0F7 
#define	reg_tuner_data_1983_1976_pos 0
#define	reg_tuner_data_1983_1976_len 8
#define	reg_tuner_data_1983_1976_lsb 1976
#define xd_p_reg_tuner_data_1991_1984	(*(volatile byte xdata *) 0xF0F8)
#define    p_reg_tuner_data_1991_1984	0xF0F8 
#define	reg_tuner_data_1991_1984_pos 0
#define	reg_tuner_data_1991_1984_len 8
#define	reg_tuner_data_1991_1984_lsb 1984
#define xd_p_reg_tuner_data_1999_1992	(*(volatile byte xdata *) 0xF0F9)
#define    p_reg_tuner_data_1999_1992	0xF0F9 
#define	reg_tuner_data_1999_1992_pos 0
#define	reg_tuner_data_1999_1992_len 8
#define	reg_tuner_data_1999_1992_lsb 1992
#define xd_p_reg_tuner_data_2007_2000	(*(volatile byte xdata *) 0xF0FA)
#define    p_reg_tuner_data_2007_2000	0xF0FA 
#define	reg_tuner_data_2007_2000_pos 0
#define	reg_tuner_data_2007_2000_len 8
#define	reg_tuner_data_2007_2000_lsb 2000
#define xd_p_reg_tuner_data_2015_2008	(*(volatile byte xdata *) 0xF0FB)
#define    p_reg_tuner_data_2015_2008	0xF0FB 
#define	reg_tuner_data_2015_2008_pos 0
#define	reg_tuner_data_2015_2008_len 8
#define	reg_tuner_data_2015_2008_lsb 2008
#define xd_p_reg_tuner_data_2023_2016	(*(volatile byte xdata *) 0xF0FC)
#define    p_reg_tuner_data_2023_2016	0xF0FC 
#define	reg_tuner_data_2023_2016_pos 0
#define	reg_tuner_data_2023_2016_len 8
#define	reg_tuner_data_2023_2016_lsb 2016
#define xd_p_reg_tuner_data_2031_2024	(*(volatile byte xdata *) 0xF0FD)
#define    p_reg_tuner_data_2031_2024	0xF0FD 
#define	reg_tuner_data_2031_2024_pos 0
#define	reg_tuner_data_2031_2024_len 8
#define	reg_tuner_data_2031_2024_lsb 2024
#define xd_p_reg_tuner_data_2039_2032	(*(volatile byte xdata *) 0xF0FE)
#define    p_reg_tuner_data_2039_2032	0xF0FE 
#define	reg_tuner_data_2039_2032_pos 0
#define	reg_tuner_data_2039_2032_len 8
#define	reg_tuner_data_2039_2032_lsb 2032
#define xd_p_reg_tuner_data_2047_2040	(*(volatile byte xdata *) 0xF0FF)
#define    p_reg_tuner_data_2047_2040	0xF0FF 
#define	reg_tuner_data_2047_2040_pos 0
#define	reg_tuner_data_2047_2040_len 8
#define	reg_tuner_data_2047_2040_lsb 2040
#define xd_p_reg_tuner_master_rd_wr	(*(volatile byte xdata *) 0xF100)
#define    p_reg_tuner_master_rd_wr	0xF100 
#define	reg_tuner_master_rd_wr_pos 0
#define	reg_tuner_master_rd_wr_len 1
#define	reg_tuner_master_rd_wr_lsb 0
#define xd_p_reg_tuner_master_length	(*(volatile byte xdata *) 0xF101)
#define    p_reg_tuner_master_length	0xF101 
#define	reg_tuner_master_length_pos 0
#define	reg_tuner_master_length_len 8
#define	reg_tuner_master_length_lsb 0
#define xd_p_reg_tuner_cmd_exe	(*(volatile byte xdata *) 0xF102)
#define    p_reg_tuner_cmd_exe	0xF102 
#define	reg_tuner_cmd_exe_pos 0
#define	reg_tuner_cmd_exe_len 1
#define	reg_tuner_cmd_exe_lsb 0
#define xd_p_reg_tuner_wdat_done	(*(volatile byte xdata *) 0xF102)
#define    p_reg_tuner_wdat_done	0xF102 
#define	reg_tuner_wdat_done_pos 1
#define	reg_tuner_wdat_done_len 1
#define	reg_tuner_wdat_done_lsb 0
#define xd_p_reg_tuner_wdat_fail	(*(volatile byte xdata *) 0xF102)
#define    p_reg_tuner_wdat_fail	0xF102 
#define	reg_tuner_wdat_fail_pos 2
#define	reg_tuner_wdat_fail_len 1
#define	reg_tuner_wdat_fail_lsb 0
#define xd_p_reg_tuner_ofsm_i2cm_rdat_rdy	(*(volatile byte xdata *) 0xF102)
#define    p_reg_tuner_ofsm_i2cm_rdat_rdy	0xF102 
#define	reg_tuner_ofsm_i2cm_rdat_rdy_pos 3
#define	reg_tuner_ofsm_i2cm_rdat_rdy_len 1
#define	reg_tuner_ofsm_i2cm_rdat_rdy_lsb 0
#define xd_p_reg_tuner_current_state	(*(volatile byte xdata *) 0xF102)
#define    p_reg_tuner_current_state	0xF102 
#define	reg_tuner_current_state_pos 4
#define	reg_tuner_current_state_len 3
#define	reg_tuner_current_state_lsb 0
#define xd_p_reg_one_cycle_counter_tuner	(*(volatile byte xdata *) 0xF103)
#define    p_reg_one_cycle_counter_tuner	0xF103 
#define	reg_one_cycle_counter_tuner_pos 0
#define	reg_one_cycle_counter_tuner_len 8
#define	reg_one_cycle_counter_tuner_lsb 0
#define xd_p_reg_msb_lsb	(*(volatile byte xdata *) 0xF104)
#define    p_reg_msb_lsb	0xF104 
#define	reg_msb_lsb_pos 0
#define	reg_msb_lsb_len 1
#define	reg_msb_lsb_lsb 0
#define xd_p_reg_ofdm_rst	(*(volatile byte xdata *) 0xF104)
#define    p_reg_ofdm_rst	0xF104 
#define	reg_ofdm_rst_pos 1
#define	reg_ofdm_rst_len 1
#define	reg_ofdm_rst_lsb 0
#define xd_p_reg_sel_thirdi2c	(*(volatile byte xdata *) 0xF104)
#define    p_reg_sel_thirdi2c	0xF104 
#define	reg_sel_thirdi2c_pos 2
#define	reg_sel_thirdi2c_len 1
#define	reg_sel_thirdi2c_lsb 0
#define xd_p_reg_sel_tuner	(*(volatile byte xdata *) 0xF104)
#define    p_reg_sel_tuner	0xF104 
#define	reg_sel_tuner_pos 3
#define	reg_sel_tuner_len 1
#define	reg_sel_tuner_lsb 0
#define xd_p_reg_ofdm_rst_en	(*(volatile byte xdata *) 0xF104)
#define    p_reg_ofdm_rst_en	0xF104 
#define	reg_ofdm_rst_en_pos 4
#define	reg_ofdm_rst_en_len 1
#define	reg_ofdm_rst_en_lsb 0
#define xd_r_link_ofsm_mailbox_int	(*(volatile byte xdata *) 0xF402)
#define    r_link_ofsm_mailbox_int	0xF402 
#define	link_ofsm_mailbox_int_pos 4
#define	link_ofsm_mailbox_int_len 1
#define	link_ofsm_mailbox_int_lsb 0
#define xd_r_link_ofsm_dvbt_int	(*(volatile byte xdata *) 0xF403)
#define    r_link_ofsm_dvbt_int	0xF403 
#define	link_ofsm_dvbt_int_pos 2
#define	link_ofsm_dvbt_int_len 1
#define	link_ofsm_dvbt_int_lsb 0
#define xd_p_reg_dvbt_intsts	(*(volatile byte xdata *) 0xF404)
#define    p_reg_dvbt_intsts	0xF404 
#define	reg_dvbt_intsts_pos 2
#define	reg_dvbt_intsts_len 1
#define	reg_dvbt_intsts_lsb 0
#define xd_p_reg_link_mailbox_int	(*(volatile byte xdata *) 0xF405)
#define    p_reg_link_mailbox_int	0xF405 
#define	reg_link_mailbox_int_pos 5
#define	reg_link_mailbox_int_len 1
#define	reg_link_mailbox_int_lsb 0
#define xd_p_reg_mailbox_wptr_rst	(*(volatile byte xdata *) 0xF408)
#define    p_reg_mailbox_wptr_rst	0xF408 
#define	reg_mailbox_wptr_rst_pos 0
#define	reg_mailbox_wptr_rst_len 1
#define	reg_mailbox_wptr_rst_lsb 0
#define xd_p_reg_link_mailbox_wptr	(*(volatile byte xdata *) 0xF409)
#define    p_reg_link_mailbox_wptr	0xF409 
#define	reg_link_mailbox_wptr_pos 0
#define	reg_link_mailbox_wptr_len 8
#define	reg_link_mailbox_wptr_lsb 0
#define xd_p_reg_link_mailbox_wend	(*(volatile byte xdata *) 0xF410)
#define    p_reg_link_mailbox_wend	0xF410 
#define	reg_link_mailbox_wend_pos 0
#define	reg_link_mailbox_wend_len 1
#define	reg_link_mailbox_wend_lsb 0
#define xd_p_reg_rd_data_sel	(*(volatile byte xdata *) 0xF411)
#define    p_reg_rd_data_sel	0xF411 
#define	reg_rd_data_sel_pos 0
#define	reg_rd_data_sel_len 2
#define	reg_rd_data_sel_lsb 0
#define xd_p_reg_fifo_rd_length_7_0	(*(volatile byte xdata *) 0xF412)
#define    p_reg_fifo_rd_length_7_0	0xF412 
#define	reg_fifo_rd_length_7_0_pos 0
#define	reg_fifo_rd_length_7_0_len 8
#define	reg_fifo_rd_length_7_0_lsb 0
#define xd_p_reg_fifo_rd_length_15_8	(*(volatile byte xdata *) 0xF413)
#define    p_reg_fifo_rd_length_15_8	0xF413 
#define	reg_fifo_rd_length_15_8_pos 0
#define	reg_fifo_rd_length_15_8_len 8
#define	reg_fifo_rd_length_15_8_lsb 8
#define xd_p_reg_fifo_rd_length_17_16	(*(volatile byte xdata *) 0xF414)
#define    p_reg_fifo_rd_length_17_16	0xF414 
#define	reg_fifo_rd_length_17_16_pos 0
#define	reg_fifo_rd_length_17_16_len 2
#define	reg_fifo_rd_length_17_16_lsb 16
#define xd_p_reg_rst_fifo_rptr	(*(volatile byte xdata *) 0xF414)
#define    p_reg_rst_fifo_rptr	0xF414 
#define	reg_rst_fifo_rptr_pos 6
#define	reg_rst_fifo_rptr_len 1
#define	reg_rst_fifo_rptr_lsb 0
#define xd_p_reg_force_sel	(*(volatile byte xdata *) 0xF414)
#define    p_reg_force_sel	0xF414 
#define	reg_force_sel_pos 7
#define	reg_force_sel_len 1
#define	reg_force_sel_lsb 0
#define xd_p_reg_fifo_rptr_7_0	(*(volatile byte xdata *) 0xF415)
#define    p_reg_fifo_rptr_7_0	0xF415 
#define	reg_fifo_rptr_7_0_pos 0
#define	reg_fifo_rptr_7_0_len 8
#define	reg_fifo_rptr_7_0_lsb 0
#define xd_p_reg_fifo_rptr_15_8	(*(volatile byte xdata *) 0xF416)
#define    p_reg_fifo_rptr_15_8	0xF416 
#define	reg_fifo_rptr_15_8_pos 0
#define	reg_fifo_rptr_15_8_len 8
#define	reg_fifo_rptr_15_8_lsb 8
#define xd_p_reg_fifo_rptr_17_16	(*(volatile byte xdata *) 0xF417)
#define    p_reg_fifo_rptr_17_16	0xF417 
#define	reg_fifo_rptr_17_16_pos 0
#define	reg_fifo_rptr_17_16_len 2
#define	reg_fifo_rptr_17_16_lsb 16
#define xd_p_reg_max_package_size_7_0	(*(volatile byte xdata *) 0xF418)
#define    p_reg_max_package_size_7_0	0xF418 
#define	reg_max_package_size_7_0_pos 0
#define	reg_max_package_size_7_0_len 8
#define	reg_max_package_size_7_0_lsb 0
#define xd_p_reg_max_package_size_11_8	(*(volatile byte xdata *) 0xF419)
#define    p_reg_max_package_size_11_8	0xF419 
#define	reg_max_package_size_11_8_pos 0
#define	reg_max_package_size_11_8_len 4
#define	reg_max_package_size_11_8_lsb 8
#define xd_p_reg_dvbt_en	(*(volatile byte xdata *) 0xF41A)
#define    p_reg_dvbt_en	0xF41A 
#define	reg_dvbt_en_pos 0
#define	reg_dvbt_en_len 1
#define	reg_dvbt_en_lsb 0
#define xd_p_reg_dvbt_bufsize	(*(volatile byte xdata *) 0xF41A)
#define    p_reg_dvbt_bufsize	0xF41A 
#define	reg_dvbt_bufsize_pos 1
#define	reg_dvbt_bufsize_len 1
#define	reg_dvbt_bufsize_lsb 0
#define xd_p_reg_dvbt_path	(*(volatile byte xdata *) 0xF41A)
#define    p_reg_dvbt_path	0xF41A 
#define	reg_dvbt_path_pos 2
#define	reg_dvbt_path_len 1
#define	reg_dvbt_path_lsb 0
#define xd_p_reg_dvbt_r5	(*(volatile byte xdata *) 0xF41A)
#define    p_reg_dvbt_r5	0xF41A 
#define	reg_dvbt_r5_pos 3
#define	reg_dvbt_r5_len 1
#define	reg_dvbt_r5_lsb 0
#define xd_p_reg_mailbox_inten	(*(volatile byte xdata *) 0xF41E)
#define    p_reg_mailbox_inten	0xF41E 
#define	reg_mailbox_inten_pos 4
#define	reg_mailbox_inten_len 1
#define	reg_mailbox_inten_lsb 0
#define xd_p_reg_dvbt_inten	(*(volatile byte xdata *) 0xF41F)
#define    p_reg_dvbt_inten	0xF41F 
#define	reg_dvbt_inten_pos 2
#define	reg_dvbt_inten_len 1
#define	reg_dvbt_inten_lsb 0
#define xd_p_reg_ping_pong_ctl	(*(volatile byte xdata *) 0xF420)
#define    p_reg_ping_pong_ctl	0xF420 
#define	reg_ping_pong_ctl_pos 0
#define	reg_ping_pong_ctl_len 1
#define	reg_ping_pong_ctl_lsb 0
#define xd_p_reg_i2c_read_done	(*(volatile byte xdata *) 0xF421)
#define    p_reg_i2c_read_done	0xF421 
#define	reg_i2c_read_done_pos 0
#define	reg_i2c_read_done_len 1
#define	reg_i2c_read_done_lsb 0
#define xd_p_reg_mem_map_ctl	(*(volatile byte xdata *) 0xF422)
#define    p_reg_mem_map_ctl	0xF422 
#define	reg_mem_map_ctl_pos 0
#define	reg_mem_map_ctl_len 1
#define	reg_mem_map_ctl_lsb 0
#define xd_p_reg_ping_pong_dbg	(*(volatile byte xdata *) 0xF423)
#define    p_reg_ping_pong_dbg	0xF423 
#define	reg_ping_pong_dbg_pos 0
#define	reg_ping_pong_dbg_len 1
#define	reg_ping_pong_dbg_lsb 0
#define xd_p_reg_repeat_start	(*(volatile byte xdata *) 0xF424)
#define    p_reg_repeat_start	0xF424 
#define	reg_repeat_start_pos 0
#define	reg_repeat_start_len 1
#define	reg_repeat_start_lsb 0
#define xd_p_reg_cycle_counter_fine_tune	(*(volatile byte xdata *) 0xF425)
#define    p_reg_cycle_counter_fine_tune	0xF425 
#define	reg_cycle_counter_fine_tune_pos 0
#define	reg_cycle_counter_fine_tune_len 3
#define	reg_cycle_counter_fine_tune_lsb 0
#define xd_p_reg_stretch_word	(*(volatile byte xdata *) 0xF426)
#define    p_reg_stretch_word	0xF426 
#define	reg_stretch_word_pos 0
#define	reg_stretch_word_len 8
#define	reg_stretch_word_lsb 0
#define xd_p_reg_master_state_rst	(*(volatile byte xdata *) 0xF427)
#define    p_reg_master_state_rst	0xF427 
#define	reg_master_state_rst_pos 0
#define	reg_master_state_rst_len 1
#define	reg_master_state_rst_lsb 0
#define xd_p_reg_mailbox_rptr_rst	(*(volatile byte xdata *) 0xF428)
#define    p_reg_mailbox_rptr_rst	0xF428 
#define	reg_mailbox_rptr_rst_pos 0
#define	reg_mailbox_rptr_rst_len 1
#define	reg_mailbox_rptr_rst_lsb 0
#define xd_p_reg_link_mailbox_rptr	(*(volatile byte xdata *) 0xF429)
#define    p_reg_link_mailbox_rptr	0xF429 
#define	reg_link_mailbox_rptr_pos 0
#define	reg_link_mailbox_rptr_len 8
#define	reg_link_mailbox_rptr_lsb 0
#define xd_p_reg_top_gpioscli	(*(volatile byte xdata *) 0xF42A)
#define    p_reg_top_gpioscli	0xF42A 
#define	reg_top_gpioscli_pos 0
#define	reg_top_gpioscli_len 1
#define	reg_top_gpioscli_lsb 0
#define xd_p_reg_top_gpiosdai	(*(volatile byte xdata *) 0xF42A)
#define    p_reg_top_gpiosdai	0xF42A 
#define	reg_top_gpiosdai_pos 1
#define	reg_top_gpiosdai_len 1
#define	reg_top_gpiosdai_lsb 0
#define xd_p_link_ofsm_ping_pong_ctl	(*(volatile byte xdata *) 0xF430)
#define    p_link_ofsm_ping_pong_ctl	0xF430 
#define	link_ofsm_ping_pong_ctl_pos 0
#define	link_ofsm_ping_pong_ctl_len 1
#define	link_ofsm_ping_pong_ctl_lsb 0
#define xd_p_link_ofsm_stretch_db	(*(volatile byte xdata *) 0xF431)
#define    p_link_ofsm_stretch_db	0xF431 
#define	link_ofsm_stretch_db_pos 0
#define	link_ofsm_stretch_db_len 8
#define	link_ofsm_stretch_db_lsb 0
#define xd_r_link_ofsm_ip_length_7_0	(*(volatile byte xdata *) 0xF447)
#define    r_link_ofsm_ip_length_7_0	0xF447 
#define	link_ofsm_ip_length_7_0_pos 0
#define	link_ofsm_ip_length_7_0_len 8
#define	link_ofsm_ip_length_7_0_lsb 0
#define xd_r_link_ofsm_ip_length_11_8	(*(volatile byte xdata *) 0xF448)
#define    r_link_ofsm_ip_length_11_8	0xF448 
#define	link_ofsm_ip_length_11_8_pos 0
#define	link_ofsm_ip_length_11_8_len 4
#define	link_ofsm_ip_length_11_8_lsb 8
#define xd_r_link_ofsm_ip_valid	(*(volatile byte xdata *) 0xF448)
#define    r_link_ofsm_ip_valid	0xF448 
#define	link_ofsm_ip_valid_pos 7
#define	link_ofsm_ip_valid_len 1
#define	link_ofsm_ip_valid_lsb 0
#define xd_p_reg_wake_by_remote	(*(volatile byte xdata *) 0xF44C)
#define    p_reg_wake_by_remote	0xF44C 
#define	reg_wake_by_remote_pos 0
#define	reg_wake_by_remote_len 1
#define	reg_wake_by_remote_lsb 0
#define xd_p_reg_ir_int_en	(*(volatile byte xdata *) 0xF44D)
#define    p_reg_ir_int_en	0xF44D 
#define	reg_ir_int_en_pos 0
#define	reg_ir_int_en_len 1
#define	reg_ir_int_en_lsb 0
#define xd_p_reg_cir_int_en	(*(volatile byte xdata *) 0xF44E)
#define    p_reg_cir_int_en	0xF44E 
#define	reg_cir_int_en_pos 0
#define	reg_cir_int_en_len 1
#define	reg_cir_int_en_lsb 0
#define xd_p_reg_led_polarity	(*(volatile byte xdata *) 0xF44F)
#define    p_reg_led_polarity	0xF44F 
#define	reg_led_polarity_pos 0
#define	reg_led_polarity_len 1
#define	reg_led_polarity_lsb 0
#define xd_p_reg_led_flash	(*(volatile byte xdata *) 0xF450)
#define    p_reg_led_flash	0xF450 
#define	reg_led_flash_pos 0
#define	reg_led_flash_len 1
#define	reg_led_flash_lsb 0
#define xd_p_reg_carrier_prescalar	(*(volatile byte xdata *) 0xF451)
#define    p_reg_carrier_prescalar	0xF451 
#define	reg_carrier_prescalar_pos 0
#define	reg_carrier_prescalar_len 1
#define	reg_carrier_prescalar_lsb 0
#define xd_p_reg_carrier_period_cnt	(*(volatile byte xdata *) 0xF452)
