liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define    p_reg_carrier_period_cnt	0xF452 
#define	reg_carrier_period_cnt_pos 0
#define	reg_carrier_period_cnt_len 8
#define	reg_carrier_period_cnt_lsb 0
#define xd_p_reg_cir_emit_polarity	(*(volatile byte xdata *) 0xF453)
#define    p_reg_cir_emit_polarity	0xF453 
#define	reg_cir_emit_polarity_pos 0
#define	reg_cir_emit_polarity_len 1
#define	reg_cir_emit_polarity_lsb 0
#define xd_p_reg_cir_emit_launch	(*(volatile byte xdata *) 0xF454)
#define    p_reg_cir_emit_launch	0xF454 
#define	reg_cir_emit_launch_pos 0
#define	reg_cir_emit_launch_len 1
#define	reg_cir_emit_launch_lsb 0
#define xd_p_reg_cir_emit_fifo_in	(*(volatile byte xdata *) 0xF455)
#define    p_reg_cir_emit_fifo_in	0xF455 
#define	reg_cir_emit_fifo_in_pos 0
#define	reg_cir_emit_fifo_in_len 8
#define	reg_cir_emit_fifo_in_lsb 0
#define xd_r_reg_cir_emit_fifo_empty	(*(volatile byte xdata *) 0xF456)
#define    r_reg_cir_emit_fifo_empty	0xF456 
#define	reg_cir_emit_fifo_empty_pos 0
#define	reg_cir_emit_fifo_empty_len 1
#define	reg_cir_emit_fifo_empty_lsb 0
#define xd_r_reg_cir_emit_fifo_full	(*(volatile byte xdata *) 0xF457)
#define    r_reg_cir_emit_fifo_full	0xF457 
#define	reg_cir_emit_fifo_full_pos 0
#define	reg_cir_emit_fifo_full_len 1
#define	reg_cir_emit_fifo_full_lsb 0
#define xd_p_reg_cir_emit_fifo_clear	(*(volatile byte xdata *) 0xF458)
#define    p_reg_cir_emit_fifo_clear	0xF458 
#define	reg_cir_emit_fifo_clear_pos 0
#define	reg_cir_emit_fifo_clear_len 1
#define	reg_cir_emit_fifo_clear_lsb 0
#define xd_p_reg_ir_demodulated	(*(volatile byte xdata *) 0xF460)
#define    p_reg_ir_demodulated	0xF460 
#define	reg_ir_demodulated_pos 0
#define	reg_ir_demodulated_len 1
#define	reg_ir_demodulated_lsb 0
#define xd_p_reg_cir_rx_enable	(*(volatile byte xdata *) 0xF461)
#define    p_reg_cir_rx_enable	0xF461 
#define	reg_cir_rx_enable_pos 0
#define	reg_cir_rx_enable_len 1
#define	reg_cir_rx_enable_lsb 0
#define xd_r_link_ofsm_cir_raw_int	(*(volatile byte xdata *) 0xF462)
#define    r_link_ofsm_cir_raw_int	0xF462 
#define	link_ofsm_cir_raw_int_pos 0
#define	link_ofsm_cir_raw_int_len 1
#define	link_ofsm_cir_raw_int_lsb 0
#define xd_p_reg_cir_rx_polarity	(*(volatile byte xdata *) 0xF463)
#define    p_reg_cir_rx_polarity	0xF463 
#define	reg_cir_rx_polarity_pos 0
#define	reg_cir_rx_polarity_len 1
#define	reg_cir_rx_polarity_lsb 0
#define xd_p_reg_timeout_length_h	(*(volatile byte xdata *) 0xF464)
#define    p_reg_timeout_length_h	0xF464 
#define	reg_timeout_length_h_pos 0
#define	reg_timeout_length_h_len 8
#define	reg_timeout_length_h_lsb 0
#define xd_p_reg_timeout_length_l	(*(volatile byte xdata *) 0xF465)
#define    p_reg_timeout_length_l	0xF465 
#define	reg_timeout_length_l_pos 0
#define	reg_timeout_length_l_len 8
#define	reg_timeout_length_l_lsb 0
#define xd_r_link_ofsm_cir_raw_data_msb	(*(volatile byte xdata *) 0xF466)
#define    r_link_ofsm_cir_raw_data_msb	0xF466 
#define	link_ofsm_cir_raw_data_msb_pos 0
#define	link_ofsm_cir_raw_data_msb_len 1
#define	link_ofsm_cir_raw_data_msb_lsb 0
#define xd_r_link_ofsm_cir_raw_data_h	(*(volatile byte xdata *) 0xF467)
#define    r_link_ofsm_cir_raw_data_h	0xF467 
#define	link_ofsm_cir_raw_data_h_pos 0
#define	link_ofsm_cir_raw_data_h_len 8
#define	link_ofsm_cir_raw_data_h_lsb 0
#define xd_r_link_ofsm_cir_raw_data_l	(*(volatile byte xdata *) 0xF468)
#define    r_link_ofsm_cir_raw_data_l	0xF468 
#define	link_ofsm_cir_raw_data_l_pos 0
#define	link_ofsm_cir_raw_data_l_len 8
#define	link_ofsm_cir_raw_data_l_lsb 0
#define xd_p_reg_cir_learn_enable	(*(volatile byte xdata *) 0xF469)
#define    p_reg_cir_learn_enable	0xF469 
#define	reg_cir_learn_enable_pos 0
#define	reg_cir_learn_enable_len 1
#define	reg_cir_learn_enable_lsb 0
#define xd_r_link_ofsm_cir_carrier_cnt_h	(*(volatile byte xdata *) 0xF46A)
#define    r_link_ofsm_cir_carrier_cnt_h	0xF46A 
#define	link_ofsm_cir_carrier_cnt_h_pos 0
#define	link_ofsm_cir_carrier_cnt_h_len 8
#define	link_ofsm_cir_carrier_cnt_h_lsb 0
#define xd_p_link_ofsm_cir_carrier_cnt_l	(*(volatile byte xdata *) 0xF46B)
#define    p_link_ofsm_cir_carrier_cnt_l	0xF46B 
#define	link_ofsm_cir_carrier_cnt_l_pos 0
#define	link_ofsm_cir_carrier_cnt_l_len 8
#define	link_ofsm_cir_carrier_cnt_l_lsb 0
#define xd_r_reg_cir_rx_fifo_overflow	(*(volatile byte xdata *) 0xF46C)
#define    r_reg_cir_rx_fifo_overflow	0xF46C 
#define	reg_cir_rx_fifo_overflow_pos 0
#define	reg_cir_rx_fifo_overflow_len 1
#define	reg_cir_rx_fifo_overflow_lsb 0
#define xd_r_reg_cir_rx_fifo_empty	(*(volatile byte xdata *) 0xF46D)
#define    r_reg_cir_rx_fifo_empty	0xF46D 
#define	reg_cir_rx_fifo_empty_pos 0
#define	reg_cir_rx_fifo_empty_len 1
#define	reg_cir_rx_fifo_empty_lsb 0
#define xd_p_reg_cir_rx_fifo_clear	(*(volatile byte xdata *) 0xF46E)
#define    p_reg_cir_rx_fifo_clear	0xF46E 
#define	reg_cir_rx_fifo_clear_pos 0
#define	reg_cir_rx_fifo_clear_len 1
#define	reg_cir_rx_fifo_clear_lsb 0
#define xd_p_reg_cir_rx_fifo_rd_done	(*(volatile byte xdata *) 0xF46F)
#define    p_reg_cir_rx_fifo_rd_done	0xF46F 
#define	reg_cir_rx_fifo_rd_done_pos 0
#define	reg_cir_rx_fifo_rd_done_len 1
#define	reg_cir_rx_fifo_rd_done_lsb 0
#define xd_p_reg_p_link_fix_rom_en	(*(volatile byte xdata *) 0xF53A)
#define    p_reg_p_link_fix_rom_en	0xF53A 
#define	reg_p_link_fix_rom_en_pos 0
#define	reg_p_link_fix_rom_en_len 1
#define	reg_p_link_fix_rom_en_lsb 0
/*#define xd_p_reg_ofsm_bug_addh_0	(*(volatile byte xdata *) 0xF53B)
#define    p_reg_ofsm_bug_addh_0	0xF53B 
#define	reg_ofsm_bug_addh_0_pos 0
#define	reg_ofsm_bug_addh_0_len 8
#define	reg_ofsm_bug_addh_0_lsb 0
#define xd_p_reg_ofsm_bug_addl_0	(*(volatile byte xdata *) 0xF53C)
#define    p_reg_ofsm_bug_addl_0	0xF53C 
#define	reg_ofsm_bug_addl_0_pos 0
#define	reg_ofsm_bug_addl_0_len 8
#define	reg_ofsm_bug_addl_0_lsb 0
#define xd_p_reg_ofsm_bug_addh_1	(*(volatile byte xdata *) 0xF53D)
#define    p_reg_ofsm_bug_addh_1	0xF53D 
#define	reg_ofsm_bug_addh_1_pos 0
#define	reg_ofsm_bug_addh_1_len 8
#define	reg_ofsm_bug_addh_1_lsb 0
#define xd_p_reg_ofsm_bug_addl_1	(*(volatile byte xdata *) 0xF53E)
#define    p_reg_ofsm_bug_addl_1	0xF53E 
#define	reg_ofsm_bug_addl_1_pos 0
#define	reg_ofsm_bug_addl_1_len 8
#define	reg_ofsm_bug_addl_1_lsb 0
#define xd_p_reg_ofsm_bug_addh_2	(*(volatile byte xdata *) 0xF53F)
#define    p_reg_ofsm_bug_addh_2	0xF53F 
#define	reg_ofsm_bug_addh_2_pos 0
#define	reg_ofsm_bug_addh_2_len 8
#define	reg_ofsm_bug_addh_2_lsb 0
#define xd_p_reg_ofsm_bug_addl_2	(*(volatile byte xdata *) 0xF540)
#define    p_reg_ofsm_bug_addl_2	0xF540 
#define	reg_ofsm_bug_addl_2_pos 0
#define	reg_ofsm_bug_addl_2_len 8
#define	reg_ofsm_bug_addl_2_lsb 0
#define xd_p_reg_ofsm_bug_addh_3	(*(volatile byte xdata *) 0xF541)
#define    p_reg_ofsm_bug_addh_3	0xF541 
#define	reg_ofsm_bug_addh_3_pos 0
#define	reg_ofsm_bug_addh_3_len 8
#define	reg_ofsm_bug_addh_3_lsb 0
#define xd_p_reg_ofsm_bug_addl_3	(*(volatile byte xdata *) 0xF542)
#define    p_reg_ofsm_bug_addl_3	0xF542 
#define	reg_ofsm_bug_addl_3_pos 0
#define	reg_ofsm_bug_addl_3_len 8
#define	reg_ofsm_bug_addl_3_lsb 0
#define xd_p_reg_ofsm_bug_addh_4	(*(volatile byte xdata *) 0xF543)
#define    p_reg_ofsm_bug_addh_4	0xF543 
#define	reg_ofsm_bug_addh_4_pos 0
#define	reg_ofsm_bug_addh_4_len 8
#define	reg_ofsm_bug_addh_4_lsb 0
#define xd_p_reg_ofsm_bug_addl_4	(*(volatile byte xdata *) 0xF544)
#define    p_reg_ofsm_bug_addl_4	0xF544 
#define	reg_ofsm_bug_addl_4_pos 0
#define	reg_ofsm_bug_addl_4_len 8
#define	reg_ofsm_bug_addl_4_lsb 0
#define xd_p_reg_ofsm_bug_addh_5	(*(volatile byte xdata *) 0xF545)
#define    p_reg_ofsm_bug_addh_5	0xF545 
#define	reg_ofsm_bug_addh_5_pos 0
#define	reg_ofsm_bug_addh_5_len 8
#define	reg_ofsm_bug_addh_5_lsb 0
#define xd_p_reg_ofsm_bug_addl_5	(*(volatile byte xdata *) 0xF546)
#define    p_reg_ofsm_bug_addl_5	0xF546 
#define	reg_ofsm_bug_addl_5_pos 0
#define	reg_ofsm_bug_addl_5_len 8
#define	reg_ofsm_bug_addl_5_lsb 0
#define xd_p_reg_ofsm_bug_addh_6	(*(volatile byte xdata *) 0xF547)
#define    p_reg_ofsm_bug_addh_6	0xF547 
#define	reg_ofsm_bug_addh_6_pos 0
#define	reg_ofsm_bug_addh_6_len 8
#define	reg_ofsm_bug_addh_6_lsb 0
#define xd_p_reg_ofsm_bug_addl_6	(*(volatile byte xdata *) 0xF548)
#define    p_reg_ofsm_bug_addl_6	0xF548 
#define	reg_ofsm_bug_addl_6_pos 0
#define	reg_ofsm_bug_addl_6_len 8
#define	reg_ofsm_bug_addl_6_lsb 0
#define xd_p_reg_ofsm_bug_addh_7	(*(volatile byte xdata *) 0xF549)
#define    p_reg_ofsm_bug_addh_7	0xF549 
#define	reg_ofsm_bug_addh_7_pos 0
#define	reg_ofsm_bug_addh_7_len 8
#define	reg_ofsm_bug_addh_7_lsb 0
#define xd_p_reg_ofsm_bug_addl_7	(*(volatile byte xdata *) 0xF54A)
#define    p_reg_ofsm_bug_addl_7	0xF54A 
#define	reg_ofsm_bug_addl_7_pos 0
#define	reg_ofsm_bug_addl_7_len 8
#define	reg_ofsm_bug_addl_7_lsb 0
#define xd_p_reg_ofsm_bug_addh_8	(*(volatile byte xdata *) 0xF54B)
#define    p_reg_ofsm_bug_addh_8	0xF54B 
#define	reg_ofsm_bug_addh_8_pos 0
#define	reg_ofsm_bug_addh_8_len 8
#define	reg_ofsm_bug_addh_8_lsb 0
#define xd_p_reg_ofsm_bug_addl_8	(*(volatile byte xdata *) 0xF54C)
#define    p_reg_ofsm_bug_addl_8	0xF54C 
#define	reg_ofsm_bug_addl_8_pos 0
#define	reg_ofsm_bug_addl_8_len 8
#define	reg_ofsm_bug_addl_8_lsb 0
#define xd_p_reg_ofsm_bug_addh_9	(*(volatile byte xdata *) 0xF54D)
#define    p_reg_ofsm_bug_addh_9	0xF54D 
#define	reg_ofsm_bug_addh_9_pos 0
#define	reg_ofsm_bug_addh_9_len 8
#define	reg_ofsm_bug_addh_9_lsb 0
#define xd_p_reg_ofsm_bug_addl_9	(*(volatile byte xdata *) 0xF54E)
#define    p_reg_ofsm_bug_addl_9	0xF54E 
#define	reg_ofsm_bug_addl_9_pos 0
#define	reg_ofsm_bug_addl_9_len 8
#define	reg_ofsm_bug_addl_9_lsb 0
#define xd_p_reg_ofsm_bug_addh_10	(*(volatile byte xdata *) 0xF54F)
#define    p_reg_ofsm_bug_addh_10	0xF54F 
#define	reg_ofsm_bug_addh_10_pos 0
#define	reg_ofsm_bug_addh_10_len 8
#define	reg_ofsm_bug_addh_10_lsb 0
#define xd_p_reg_ofsm_bug_addl_10	(*(volatile byte xdata *) 0xF550)
#define    p_reg_ofsm_bug_addl_10	0xF550 
#define	reg_ofsm_bug_addl_10_pos 0
#define	reg_ofsm_bug_addl_10_len 8
#define	reg_ofsm_bug_addl_10_lsb 0
#define xd_p_reg_ofsm_bug_addh_11	(*(volatile byte xdata *) 0xF551)
#define    p_reg_ofsm_bug_addh_11	0xF551 
#define	reg_ofsm_bug_addh_11_pos 0
#define	reg_ofsm_bug_addh_11_len 8
#define	reg_ofsm_bug_addh_11_lsb 0
#define xd_p_reg_ofsm_bug_addl_11	(*(volatile byte xdata *) 0xF552)
#define    p_reg_ofsm_bug_addl_11	0xF552 
#define	reg_ofsm_bug_addl_11_pos 0
#define	reg_ofsm_bug_addl_11_len 8
#define	reg_ofsm_bug_addl_11_lsb 0
#define xd_p_reg_ofsm_bug_addh_12	(*(volatile byte xdata *) 0xF553)
#define    p_reg_ofsm_bug_addh_12	0xF553 
#define	reg_ofsm_bug_addh_12_pos 0
#define	reg_ofsm_bug_addh_12_len 8
#define	reg_ofsm_bug_addh_12_lsb 0
#define xd_p_reg_ofsm_bug_addl_12	(*(volatile byte xdata *) 0xF554)
#define    p_reg_ofsm_bug_addl_12	0xF554 
#define	reg_ofsm_bug_addl_12_pos 0
#define	reg_ofsm_bug_addl_12_len 8
#define	reg_ofsm_bug_addl_12_lsb 0
#define xd_p_reg_ofsm_bug_addh_13	(*(volatile byte xdata *) 0xF555)
#define    p_reg_ofsm_bug_addh_13	0xF555 
#define	reg_ofsm_bug_addh_13_pos 0
#define	reg_ofsm_bug_addh_13_len 8
#define	reg_ofsm_bug_addh_13_lsb 0
#define xd_p_reg_ofsm_bug_addl_13	(*(volatile byte xdata *) 0xF556)
#define    p_reg_ofsm_bug_addl_13	0xF556 
#define	reg_ofsm_bug_addl_13_pos 0
#define	reg_ofsm_bug_addl_13_len 8
#define	reg_ofsm_bug_addl_13_lsb 0
#define xd_p_reg_ofsm_bug_addh_14	(*(volatile byte xdata *) 0xF557)
#define    p_reg_ofsm_bug_addh_14	0xF557 
#define	reg_ofsm_bug_addh_14_pos 0
#define	reg_ofsm_bug_addh_14_len 8
#define	reg_ofsm_bug_addh_14_lsb 0
#define xd_p_reg_ofsm_bug_addl_14	(*(volatile byte xdata *) 0xF558)
#define    p_reg_ofsm_bug_addl_14	0xF558 
#define	reg_ofsm_bug_addl_14_pos 0
#define	reg_ofsm_bug_addl_14_len 8
#define	reg_ofsm_bug_addl_14_lsb 0
#define xd_p_reg_ofsm_bug_addh_15	(*(volatile byte xdata *) 0xF559)
#define    p_reg_ofsm_bug_addh_15	0xF559 
#define	reg_ofsm_bug_addh_15_pos 0
#define	reg_ofsm_bug_addh_15_len 8
#define	reg_ofsm_bug_addh_15_lsb 0
#define xd_p_reg_ofsm_bug_addl_15	(*(volatile byte xdata *) 0xF55A)
#define    p_reg_ofsm_bug_addl_15	0xF55A 
#define	reg_ofsm_bug_addl_15_pos 0
#define	reg_ofsm_bug_addl_15_len 8
#define	reg_ofsm_bug_addl_15_lsb 0
#define xd_p_reg_ofsm_jmp_addh_0	(*(volatile byte xdata *) 0xF55B)
#define    p_reg_ofsm_jmp_addh_0	0xF55B 
#define	reg_ofsm_jmp_addh_0_pos 0
#define	reg_ofsm_jmp_addh_0_len 8
#define	reg_ofsm_jmp_addh_0_lsb 0
#define xd_p_reg_ofsm_jmp_addl_0	(*(volatile byte xdata *) 0xF55C)
#define    p_reg_ofsm_jmp_addl_0	0xF55C 
#define	reg_ofsm_jmp_addl_0_pos 0
#define	reg_ofsm_jmp_addl_0_len 8
#define	reg_ofsm_jmp_addl_0_lsb 0
#define xd_p_reg_ofsm_jmp_addh_1	(*(volatile byte xdata *) 0xF55D)
#define    p_reg_ofsm_jmp_addh_1	0xF55D 
#define	reg_ofsm_jmp_addh_1_pos 0
#define	reg_ofsm_jmp_addh_1_len 8
#define	reg_ofsm_jmp_addh_1_lsb 0
#define xd_p_reg_ofsm_jmp_addl_1	(*(volatile byte xdata *) 0xF55E)
#define    p_reg_ofsm_jmp_addl_1	0xF55E 
#define	reg_ofsm_jmp_addl_1_pos 0
#define	reg_ofsm_jmp_addl_1_len 8
#define	reg_ofsm_jmp_addl_1_lsb 0
#define xd_p_reg_ofsm_jmp_addh_2	(*(volatile byte xdata *) 0xF55F)
#define    p_reg_ofsm_jmp_addh_2	0xF55F 
#define	reg_ofsm_jmp_addh_2_pos 0
#define	reg_ofsm_jmp_addh_2_len 8
#define	reg_ofsm_jmp_addh_2_lsb 0
#define xd_p_reg_ofsm_jmp_addl_2	(*(volatile byte xdata *) 0xF560)
#define    p_reg_ofsm_jmp_addl_2	0xF560 
#define	reg_ofsm_jmp_addl_2_pos 0
#define	reg_ofsm_jmp_addl_2_len 8
#define	reg_ofsm_jmp_addl_2_lsb 0
#define xd_p_reg_ofsm_jmp_addh_3	(*(volatile byte xdata *) 0xF561)
#define    p_reg_ofsm_jmp_addh_3	0xF561 
#define	reg_ofsm_jmp_addh_3_pos 0
#define	reg_ofsm_jmp_addh_3_len 8
#define	reg_ofsm_jmp_addh_3_lsb 0
#define xd_p_reg_ofsm_jmp_addl_3	(*(volatile byte xdata *) 0xF562)
#define    p_reg_ofsm_jmp_addl_3	0xF562 
#define	reg_ofsm_jmp_addl_3_pos 0
#define	reg_ofsm_jmp_addl_3_len 8
#define	reg_ofsm_jmp_addl_3_lsb 0
#define xd_p_reg_ofsm_jmp_addh_4	(*(volatile byte xdata *) 0xF563)
#define    p_reg_ofsm_jmp_addh_4	0xF563 
#define	reg_ofsm_jmp_addh_4_pos 0
#define	reg_ofsm_jmp_addh_4_len 8
#define	reg_ofsm_jmp_addh_4_lsb 0
#define xd_p_reg_ofsm_jmp_addl_4	(*(volatile byte xdata *) 0xF564)
#define    p_reg_ofsm_jmp_addl_4	0xF564 
#define	reg_ofsm_jmp_addl_4_pos 0
#define	reg_ofsm_jmp_addl_4_len 8
#define	reg_ofsm_jmp_addl_4_lsb 0
#define xd_p_reg_ofsm_jmp_addh_5	(*(volatile byte xdata *) 0xF565)
#define    p_reg_ofsm_jmp_addh_5	0xF565 
#define	reg_ofsm_jmp_addh_5_pos 0
#define	reg_ofsm_jmp_addh_5_len 8
#define	reg_ofsm_jmp_addh_5_lsb 0
#define xd_p_reg_ofsm_jmp_addl_5	(*(volatile byte xdata *) 0xF566)
#define    p_reg_ofsm_jmp_addl_5	0xF566 
#define	reg_ofsm_jmp_addl_5_pos 0
#define	reg_ofsm_jmp_addl_5_len 8
#define	reg_ofsm_jmp_addl_5_lsb 0
#define xd_p_reg_ofsm_jmp_addh_6	(*(volatile byte xdata *) 0xF567)
#define    p_reg_ofsm_jmp_addh_6	0xF567 
#define	reg_ofsm_jmp_addh_6_pos 0
#define	reg_ofsm_jmp_addh_6_len 8
#define	reg_ofsm_jmp_addh_6_lsb 0
#define xd_p_reg_ofsm_jmp_addl_6	(*(volatile byte xdata *) 0xF568)
#define    p_reg_ofsm_jmp_addl_6	0xF568 
#define	reg_ofsm_jmp_addl_6_pos 0
#define	reg_ofsm_jmp_addl_6_len 8
#define	reg_ofsm_jmp_addl_6_lsb 0
#define xd_p_reg_ofsm_jmp_addh_7	(*(volatile byte xdata *) 0xF569)
#define    p_reg_ofsm_jmp_addh_7	0xF569 
#define	reg_ofsm_jmp_addh_7_pos 0
#define	reg_ofsm_jmp_addh_7_len 8
#define	reg_ofsm_jmp_addh_7_lsb 0
#define xd_p_reg_ofsm_jmp_addl_7	(*(volatile byte xdata *) 0xF56A)
#define    p_reg_ofsm_jmp_addl_7	0xF56A 
#define	reg_ofsm_jmp_addl_7_pos 0
#define	reg_ofsm_jmp_addl_7_len 8
#define	reg_ofsm_jmp_addl_7_lsb 0
#define xd_p_reg_ofsm_jmp_addh_8	(*(volatile byte xdata *) 0xF56B)
#define    p_reg_ofsm_jmp_addh_8	0xF56B 
#define	reg_ofsm_jmp_addh_8_pos 0
#define	reg_ofsm_jmp_addh_8_len 8
#define	reg_ofsm_jmp_addh_8_lsb 0
#define xd_p_reg_ofsm_jmp_addl_8	(*(volatile byte xdata *) 0xF56C)
#define    p_reg_ofsm_jmp_addl_8	0xF56C 
#define	reg_ofsm_jmp_addl_8_pos 0
#define	reg_ofsm_jmp_addl_8_len 8
#define	reg_ofsm_jmp_addl_8_lsb 0
#define xd_p_reg_ofsm_jmp_addh_9	(*(volatile byte xdata *) 0xF56D)
#define    p_reg_ofsm_jmp_addh_9	0xF56D 
#define	reg_ofsm_jmp_addh_9_pos 0
#define	reg_ofsm_jmp_addh_9_len 8
#define	reg_ofsm_jmp_addh_9_lsb 0
#define xd_p_reg_ofsm_jmp_addl_9	(*(volatile byte xdata *) 0xF56E)
#define    p_reg_ofsm_jmp_addl_9	0xF56E 
#define	reg_ofsm_jmp_addl_9_pos 0
#define	reg_ofsm_jmp_addl_9_len 8
#define	reg_ofsm_jmp_addl_9_lsb 0
#define xd_p_reg_ofsm_jmp_addh_10	(*(volatile byte xdata *) 0xF56F)
#define    p_reg_ofsm_jmp_addh_10	0xF56F 
#define	reg_ofsm_jmp_addh_10_pos 0
#define	reg_ofsm_jmp_addh_10_len 8
#define	reg_ofsm_jmp_addh_10_lsb 0
#define xd_p_reg_ofsm_jmp_addl_10	(*(volatile byte xdata *) 0xF570)
#define    p_reg_ofsm_jmp_addl_10	0xF570 
#define	reg_ofsm_jmp_addl_10_pos 0
#define	reg_ofsm_jmp_addl_10_len 8
#define	reg_ofsm_jmp_addl_10_lsb 0
#define xd_p_reg_ofsm_jmp_addh_11	(*(volatile byte xdata *) 0xF571)
#define    p_reg_ofsm_jmp_addh_11	0xF571 
#define	reg_ofsm_jmp_addh_11_pos 0
#define	reg_ofsm_jmp_addh_11_len 8
#define	reg_ofsm_jmp_addh_11_lsb 0
#define xd_p_reg_ofsm_jmp_addl_11	(*(volatile byte xdata *) 0xF572)
#define    p_reg_ofsm_jmp_addl_11	0xF572 
#define	reg_ofsm_jmp_addl_11_pos 0
#define	reg_ofsm_jmp_addl_11_len 8
#define	reg_ofsm_jmp_addl_11_lsb 0
#define xd_p_reg_ofsm_jmp_addh_12	(*(volatile byte xdata *) 0xF573)
#define    p_reg_ofsm_jmp_addh_12	0xF573 
#define	reg_ofsm_jmp_addh_12_pos 0
#define	reg_ofsm_jmp_addh_12_len 8
#define	reg_ofsm_jmp_addh_12_lsb 0
#define xd_p_reg_ofsm_jmp_addl_12	(*(volatile byte xdata *) 0xF574)
#define    p_reg_ofsm_jmp_addl_12	0xF574 
#define	reg_ofsm_jmp_addl_12_pos 0
#define	reg_ofsm_jmp_addl_12_len 8
#define	reg_ofsm_jmp_addl_12_lsb 0
#define xd_p_reg_ofsm_jmp_addh_13	(*(volatile byte xdata *) 0xF575)
#define    p_reg_ofsm_jmp_addh_13	0xF575 
#define	reg_ofsm_jmp_addh_13_pos 0
#define	reg_ofsm_jmp_addh_13_len 8
#define	reg_ofsm_jmp_addh_13_lsb 0
#define xd_p_reg_ofsm_jmp_addl_13	(*(volatile byte xdata *) 0xF576)
#define    p_reg_ofsm_jmp_addl_13	0xF576 
#define	reg_ofsm_jmp_addl_13_pos 0
#define	reg_ofsm_jmp_addl_13_len 8
#define	reg_ofsm_jmp_addl_13_lsb 0
#define xd_p_reg_ofsm_jmp_addh_14	(*(volatile byte xdata *) 0xF577)
#define    p_reg_ofsm_jmp_addh_14	0xF577 
#define	reg_ofsm_jmp_addh_14_pos 0
#define	reg_ofsm_jmp_addh_14_len 8
#define	reg_ofsm_jmp_addh_14_lsb 0
#define xd_p_reg_ofsm_jmp_addl_14	(*(volatile byte xdata *) 0xF578)
#define    p_reg_ofsm_jmp_addl_14	0xF578 
#define	reg_ofsm_jmp_addl_14_pos 0
#define	reg_ofsm_jmp_addl_14_len 8
#define	reg_ofsm_jmp_addl_14_lsb 0
#define xd_p_reg_ofsm_jmp_addh_15	(*(volatile byte xdata *) 0xF579)
#define    p_reg_ofsm_jmp_addh_15	0xF579 
#define	reg_ofsm_jmp_addh_15_pos 0
#define	reg_ofsm_jmp_addh_15_len 8
#define	reg_ofsm_jmp_addh_15_lsb 0
#define xd_p_reg_ofsm_jmp_addl_15	(*(volatile byte xdata *) 0xF57A)
#define    p_reg_ofsm_jmp_addl_15	0xF57A 
#define	reg_ofsm_jmp_addl_15_pos 0
#define	reg_ofsm_jmp_addl_15_len 8
#define	reg_ofsm_jmp_addl_15_lsb 0*/
#define xd_p_reg_spi_master	(*(volatile byte xdata *) 0xF600)
#define    p_reg_spi_master	0xF600 
#define	reg_spi_master_pos 0
#define	reg_spi_master_len 1
#define	reg_spi_master_lsb 0
#define xd_p_reg_spi_bit	(*(volatile byte xdata *) 0xF601)
#define    p_reg_spi_bit	0xF601 
#define	reg_spi_bit_pos 0
#define	reg_spi_bit_len 2
#define	reg_spi_bit_lsb 0
#define xd_p_reg_spi_cs	(*(volatile byte xdata *) 0xF602)
#define    p_reg_spi_cs	0xF602 
#define	reg_spi_cs_pos 0
#define	reg_spi_cs_len 1
#define	reg_spi_cs_lsb 0
#define xd_p_reg_spi_polarity	(*(volatile byte xdata *) 0xF602)
#define    p_reg_spi_polarity	0xF602 
#define	reg_spi_polarity_pos 1
#define	reg_spi_polarity_len 1
#define	reg_spi_polarity_lsb 0
#define xd_p_reg_spi_phase	(*(volatile byte xdata *) 0xF602)
#define    p_reg_spi_phase	0xF602 
#define	reg_spi_phase_pos 2
#define	reg_spi_phase_len 1
#define	reg_spi_phase_lsb 0
#define xd_p_reg_spi_1st_byte	(*(volatile byte xdata *) 0xF603)
#define    p_reg_spi_1st_byte	0xF603 
#define	reg_spi_1st_byte_pos 0
#define	reg_spi_1st_byte_len 4
#define	reg_spi_1st_byte_lsb 0
#define xd_p_reg_spi_clk_div	(*(volatile byte xdata *) 0xF603)
#define    p_reg_spi_clk_div	0xF603 
#define	reg_spi_clk_div_pos 4
#define	reg_spi_clk_div_len 4
#define	reg_spi_clk_div_lsb 0
#define xd_p_reg_spi_rst	(*(volatile byte xdata *) 0xF604)
#define    p_reg_spi_rst	0xF604 
#define	reg_spi_rst_pos 0
#define	reg_spi_rst_len 1
#define	reg_spi_rst_lsb 0
#define xd_r_reg_spi_tx_done	(*(volatile byte xdata *) 0xF604)
#define    r_reg_spi_tx_done	0xF604 
#define	reg_spi_tx_done_pos 1
#define	reg_spi_tx_done_len 1
#define	reg_spi_tx_done_lsb 0
#define xd_r_reg_spi_rx_done	(*(volatile byte xdata *) 0xF604)
#define    r_reg_spi_rx_done	0xF604 
#define	reg_spi_rx_done_pos 2
#define	reg_spi_rx_done_len 1
#define	reg_spi_rx_done_lsb 0
#define xd_p_reg_spi_dbg_sel	(*(volatile byte xdata *) 0xF604)
#define    p_reg_spi_dbg_sel	0xF604 
#define	reg_spi_dbg_sel_pos 3
#define	reg_spi_dbg_sel_len 1
#define	reg_spi_dbg_sel_lsb 0
#define xd_r_reg_spi_crc_err	(*(volatile byte xdata *) 0xF604)
#define    r_reg_spi_crc_err	0xF604 
#define	reg_spi_crc_err_pos 4
#define	reg_spi_crc_err_len 4
#define	reg_spi_crc_err_lsb 0
#define xd_r_link_ofsm_usb20_mode	(*(volatile byte xdata *) 0xF613)
#define    r_link_ofsm_usb20_mode	0xF613 
#define	link_ofsm_usb20_mode_pos 0
#define	link_ofsm_usb20_mode_len 1
#define	link_ofsm_usb20_mode_lsb 0
#define xd_r_link_ofsm_strap_usb20_mode	(*(volatile byte xdata *) 0xF613)
#define    r_link_ofsm_strap_usb20_mode	0xF613 
#define	link_ofsm_strap_usb20_mode_pos 1
#define	link_ofsm_strap_usb20_mode_len 1
#define	link_ofsm_strap_usb20_mode_lsb 0
#define xd_p_reg_link_stick_mem_end_7_0	(*(volatile byte xdata *) 0xF618)
#define    p_reg_link_stick_mem_end_7_0	0xF618 
#define	reg_link_stick_mem_end_7_0_pos 0
#define	reg_link_stick_mem_end_7_0_len 8
#define	reg_link_stick_mem_end_7_0_lsb 0
#define xd_p_reg_link_stick_mem_end_15_8	(*(volatile byte xdata *) 0xF619)
#define    p_reg_link_stick_mem_end_15_8	0xF619 
#define	reg_link_stick_mem_end_15_8_pos 0
#define	reg_link_stick_mem_end_15_8_len 8
#define	reg_link_stick_mem_end_15_8_lsb 8
#define xd_p_reg_ofdm_auto_write_addr_l	(*(volatile byte xdata *) 0xF61A)
#define    p_reg_ofdm_auto_write_addr_l	0xF61A 
#define	reg_ofdm_auto_write_addr_l_pos 0
#define	reg_ofdm_auto_write_addr_l_len 8
#define	reg_ofdm_auto_write_addr_l_lsb 0
#define xd_p_reg_ofdm_auto_write_addr_h	(*(volatile byte xdata *) 0xF61B)
#define    p_reg_ofdm_auto_write_addr_h	0xF61B 
#define	reg_ofdm_auto_write_addr_h_pos 0
#define	reg_ofdm_auto_write_addr_h_len 8
#define	reg_ofdm_auto_write_addr_h_lsb 0
#define xd_p_reg_link_auto_write_addr_l	(*(volatile byte xdata *) 0xF61C)
#define    p_reg_link_auto_write_addr_l	0xF61C 
#define	reg_link_auto_write_addr_l_pos 0
#define	reg_link_auto_write_addr_l_len 8
#define	reg_link_auto_write_addr_l_lsb 0
#define xd_p_reg_link_auto_write_addr_h	(*(volatile byte xdata *) 0xF61D)
#define    p_reg_link_auto_write_addr_h	0xF61D 
#define	reg_link_auto_write_addr_h_pos 0
#define	reg_link_auto_write_addr_h_len 8
#define	reg_link_auto_write_addr_h_lsb 0
#define xd_p_reg_mailbox_auto_write_addr	(*(volatile byte xdata *) 0xF61E)
#define    p_reg_mailbox_auto_write_addr	0xF61E 
#define	reg_mailbox_auto_write_addr_pos 0
#define	reg_mailbox_auto_write_addr_len 8
#define	reg_mailbox_auto_write_addr_lsb 0
#define xd_p_reg_usbmem_auto_write_addr	(*(volatile byte xdata *) 0xF61F)
#define    p_reg_usbmem_auto_write_addr	0xF61F 
#define	reg_usbmem_auto_write_addr_pos 0
#define	reg_usbmem_auto_write_addr_len 8
#define	reg_usbmem_auto_write_addr_lsb 0
#define xd_p_reg_mailbox_auto_read_addr	(*(volatile byte xdata *) 0xF620)
#define    p_reg_mailbox_auto_read_addr	0xF620 
#define	reg_mailbox_auto_read_addr_pos 0
#define	reg_mailbox_auto_read_addr_len 8
#define	reg_mailbox_auto_read_addr_lsb 0
#define xd_p_reg_usbmem_auto_read_addr	(*(volatile byte xdata *) 0xF621)
#define    p_reg_usbmem_auto_read_addr	0xF621 
#define	reg_usbmem_auto_read_addr_pos 0
#define	reg_usbmem_auto_read_addr_len 8
#define	reg_usbmem_auto_read_addr_lsb 0
