liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
#define xd_p_reg_auto_write_ofdm	(*(volatile byte xdata *) 0xF622)
#define    p_reg_auto_write_ofdm	0xF622 
#define	reg_auto_write_ofdm_pos 0
#define	reg_auto_write_ofdm_len 1
#define	reg_auto_write_ofdm_lsb 0
#define xd_p_reg_auto_write_link	(*(volatile byte xdata *) 0xF622)
#define    p_reg_auto_write_link	0xF622 
#define	reg_auto_write_link_pos 1
#define	reg_auto_write_link_len 1
#define	reg_auto_write_link_lsb 0
#define xd_p_reg_auto_write_mailbox	(*(volatile byte xdata *) 0xF622)
#define    p_reg_auto_write_mailbox	0xF622 
#define	reg_auto_write_mailbox_pos 2
#define	reg_auto_write_mailbox_len 1
#define	reg_auto_write_mailbox_lsb 0
#define xd_p_reg_auto_write_usbmem	(*(volatile byte xdata *) 0xF622)
#define    p_reg_auto_write_usbmem	0xF622 
#define	reg_auto_write_usbmem_pos 3
#define	reg_auto_write_usbmem_len 1
#define	reg_auto_write_usbmem_lsb 0
#define xd_p_reg_auto_write_i2cm	(*(volatile byte xdata *) 0xF622)
#define    p_reg_auto_write_i2cm	0xF622 
#define	reg_auto_write_i2cm_pos 4
#define	reg_auto_write_i2cm_len 1
#define	reg_auto_write_i2cm_lsb 0
#define xd_p_reg_auto_read_mailbox	(*(volatile byte xdata *) 0xF623)
#define    p_reg_auto_read_mailbox	0xF623 
#define	reg_auto_read_mailbox_pos 0
#define	reg_auto_read_mailbox_len 1
#define	reg_auto_read_mailbox_lsb 0
#define xd_p_reg_auto_read_rom	(*(volatile byte xdata *) 0xF623)
#define    p_reg_auto_read_rom	0xF623 
#define	reg_auto_read_rom_pos 1
#define	reg_auto_read_rom_len 1
#define	reg_auto_read_rom_lsb 0
#define xd_p_reg_auto_sum_l	(*(volatile byte xdata *) 0xF624)
#define    p_reg_auto_sum_l	0xF624 
#define	reg_auto_sum_l_pos 0
#define	reg_auto_sum_l_len 8
#define	reg_auto_sum_l_lsb 0
#define xd_p_reg_auto_sum_h	(*(volatile byte xdata *) 0xF625)
#define    p_reg_auto_sum_h	0xF625 
#define	reg_auto_sum_h_pos 0
#define	reg_auto_sum_h_len 8
#define	reg_auto_sum_h_lsb 0
#define xd_p_reg_auto_sum_to_h	(*(volatile byte xdata *) 0xF626)
#define    p_reg_auto_sum_to_h	0xF626 
#define	reg_auto_sum_to_h_pos 0
#define	reg_auto_sum_to_h_len 1
#define	reg_auto_sum_to_h_lsb 0
#define xd_p_reg_auto_sum_en	(*(volatile byte xdata *) 0xF627)
#define    p_reg_auto_sum_en	0xF627 
#define	reg_auto_sum_en_pos 0
#define	reg_auto_sum_en_len 1
#define	reg_auto_sum_en_lsb 0
#define xd_p_reg_rom_remap_begin_7_0	(*(volatile byte xdata *) 0xF628)
#define    p_reg_rom_remap_begin_7_0	0xF628 
#define	reg_rom_remap_begin_7_0_pos 0
#define	reg_rom_remap_begin_7_0_len 8
#define	reg_rom_remap_begin_7_0_lsb 0
#define xd_p_reg_rom_remap_begin_15_8	(*(volatile byte xdata *) 0xF629)
#define    p_reg_rom_remap_begin_15_8	0xF629 
#define	reg_rom_remap_begin_15_8_pos 0
#define	reg_rom_remap_begin_15_8_len 8
#define	reg_rom_remap_begin_15_8_lsb 8
#define xd_p_reg_rom_remap_end_7_0	(*(volatile byte xdata *) 0xF62A)
#define    p_reg_rom_remap_end_7_0	0xF62A 
#define	reg_rom_remap_end_7_0_pos 0
#define	reg_rom_remap_end_7_0_len 8
#define	reg_rom_remap_end_7_0_lsb 0
#define xd_p_reg_rom_remap_end_15_8	(*(volatile byte xdata *) 0xF62B)
#define    p_reg_rom_remap_end_15_8	0xF62B 
#define	reg_rom_remap_end_15_8_pos 0
#define	reg_rom_remap_end_15_8_len 8
#define	reg_rom_remap_end_15_8_lsb 8
#define xd_p_reg_rom_remap_delta_7_0	(*(volatile byte xdata *) 0xF62C)
#define    p_reg_rom_remap_delta_7_0	0xF62C 
#define	reg_rom_remap_delta_7_0_pos 0
#define	reg_rom_remap_delta_7_0_len 8
#define	reg_rom_remap_delta_7_0_lsb 0
#define xd_p_reg_rom_remap_delta_15_8	(*(volatile byte xdata *) 0xF62D)
#define    p_reg_rom_remap_delta_15_8	0xF62D 
#define	reg_rom_remap_delta_15_8_pos 0
#define	reg_rom_remap_delta_15_8_len 8
#define	reg_rom_remap_delta_15_8_lsb 8
#define xd_p_reg_rom_remap_en	(*(volatile byte xdata *) 0xF62E)
#define    p_reg_rom_remap_en	0xF62E 
#define	reg_rom_remap_en_pos 0
#define	reg_rom_remap_en_len 1
#define	reg_rom_remap_en_lsb 0
#define xd_p_reg_rom_remap_ofdm	(*(volatile byte xdata *) 0xF62E)
#define    p_reg_rom_remap_ofdm	0xF62E 
#define	reg_rom_remap_ofdm_pos 1
#define	reg_rom_remap_ofdm_len 1
#define	reg_rom_remap_ofdm_lsb 0
#define xd_p_reg_link_cpu_reset	(*(volatile byte xdata *) 0xF62F)
#define    p_reg_link_cpu_reset	0xF62F 
#define	reg_link_cpu_reset_pos 0
#define	reg_link_cpu_reset_len 1
#define	reg_link_cpu_reset_lsb 0
#define xd_p_reg_i2cm_auto_write_addr	(*(volatile byte xdata *) 0xF630)
#define    p_reg_i2cm_auto_write_addr	0xF630 
#define	reg_i2cm_auto_write_addr_pos 0
#define	reg_i2cm_auto_write_addr_len 8
#define	reg_i2cm_auto_write_addr_lsb 0
#define xd_p_reg_link_bank_float_en	(*(volatile byte xdata *) 0xF631)
#define    p_reg_link_bank_float_en	0xF631 
#define	reg_link_bank_float_en_pos 0
#define	reg_link_bank_float_en_len 1
#define	reg_link_bank_float_en_lsb 0
#define xd_p_reg_link_bank_float_start	(*(volatile byte xdata *) 0xF632)
#define    p_reg_link_bank_float_start	0xF632 
#define	reg_link_bank_float_start_pos 0
#define	reg_link_bank_float_start_len 8
#define	reg_link_bank_float_start_lsb 0
#define xd_p_reg_link_bank_float_stop	(*(volatile byte xdata *) 0xF633)
#define    p_reg_link_bank_float_stop	0xF633 
#define	reg_link_bank_float_stop_pos 0
#define	reg_link_bank_float_stop_len 8
#define	reg_link_bank_float_stop_lsb 0
#define xd_p_reg_rom_auto_read_addr_7_0	(*(volatile byte xdata *) 0xF638)
#define    p_reg_rom_auto_read_addr_7_0	0xF638 
#define	reg_rom_auto_read_addr_7_0_pos 0
#define	reg_rom_auto_read_addr_7_0_len 8
#define	reg_rom_auto_read_addr_7_0_lsb 0
#define xd_p_reg_rom_auto_read_addr_15_8	(*(volatile byte xdata *) 0xF639)
#define    p_reg_rom_auto_read_addr_15_8	0xF639 
#define	reg_rom_auto_read_addr_15_8_pos 0
#define	reg_rom_auto_read_addr_15_8_len 8
#define	reg_rom_auto_read_addr_15_8_lsb 8
#define xd_p_reg_link_ofsm_dummy_7_0	(*(volatile byte xdata *) 0xF640)
#define    p_reg_link_ofsm_dummy_7_0	0xF640 
#define	reg_link_ofsm_dummy_7_0_pos 0
#define	reg_link_ofsm_dummy_7_0_len 8
#define	reg_link_ofsm_dummy_7_0_lsb 0
#define xd_p_reg_link_ofsm_dummy_15_8	(*(volatile byte xdata *) 0xF641)
#define    p_reg_link_ofsm_dummy_15_8	0xF641 
#define	reg_link_ofsm_dummy_15_8_pos 0
#define	reg_link_ofsm_dummy_15_8_len 8
#define	reg_link_ofsm_dummy_15_8_lsb 8
#define xd_p_reg_link_ofsm_dummy_23_16	(*(volatile byte xdata *) 0xF642)
#define    p_reg_link_ofsm_dummy_23_16	0xF642 
#define	reg_link_ofsm_dummy_23_16_pos 0
#define	reg_link_ofsm_dummy_23_16_len 8
#define	reg_link_ofsm_dummy_23_16_lsb 16
#define xd_p_reg_link_ofsm_dummy_31_24	(*(volatile byte xdata *) 0xF643)
#define    p_reg_link_ofsm_dummy_31_24	0xF643 
#define	reg_link_ofsm_dummy_31_24_pos 0
#define	reg_link_ofsm_dummy_31_24_len 8
#define	reg_link_ofsm_dummy_31_24_lsb 24
#define xd_p_reg_link_ofsm_dummy_39_32	(*(volatile byte xdata *) 0xF644)
#define    p_reg_link_ofsm_dummy_39_32	0xF644 
#define	reg_link_ofsm_dummy_39_32_pos 0
#define	reg_link_ofsm_dummy_39_32_len 8
#define	reg_link_ofsm_dummy_39_32_lsb 32
#define xd_p_reg_link_ofsm_dummy_47_40	(*(volatile byte xdata *) 0xF645)
#define    p_reg_link_ofsm_dummy_47_40	0xF645 
#define	reg_link_ofsm_dummy_47_40_pos 0
#define	reg_link_ofsm_dummy_47_40_len 8
#define	reg_link_ofsm_dummy_47_40_lsb 40
#define xd_p_reg_link_ofsm_dummy_55_48	(*(volatile byte xdata *) 0xF646)
#define    p_reg_link_ofsm_dummy_55_48	0xF646 
#define	reg_link_ofsm_dummy_55_48_pos 0
#define	reg_link_ofsm_dummy_55_48_len 8
#define	reg_link_ofsm_dummy_55_48_lsb 48
#define xd_p_reg_link_ofsm_dummy_63_56	(*(volatile byte xdata *) 0xF647)
#define    p_reg_link_ofsm_dummy_63_56	0xF647 
#define	reg_link_ofsm_dummy_63_56_pos 0
#define	reg_link_ofsm_dummy_63_56_len 8
#define	reg_link_ofsm_dummy_63_56_lsb 56
#define xd_p_reg_link_ofsm_dummy_71_64	(*(volatile byte xdata *) 0xF648)
#define    p_reg_link_ofsm_dummy_71_64	0xF648 
#define	reg_link_ofsm_dummy_71_64_pos 0
#define	reg_link_ofsm_dummy_71_64_len 8
#define	reg_link_ofsm_dummy_71_64_lsb 64
#define xd_p_reg_link_ofsm_dummy_79_72	(*(volatile byte xdata *) 0xF649)
#define    p_reg_link_ofsm_dummy_79_72	0xF649 
#define	reg_link_ofsm_dummy_79_72_pos 0
#define	reg_link_ofsm_dummy_79_72_len 8
#define	reg_link_ofsm_dummy_79_72_lsb 72
#define xd_p_reg_lnk2ofdm_data_7_0	(*(volatile byte xdata *) 0xF6A0)
#define    p_reg_lnk2ofdm_data_7_0	0xF6A0 
#define	reg_lnk2ofdm_data_7_0_pos 0
#define	reg_lnk2ofdm_data_7_0_len 8
#define	reg_lnk2ofdm_data_7_0_lsb 0
#define xd_p_reg_lnk2ofdm_data_15_8	(*(volatile byte xdata *) 0xF6A1)
#define    p_reg_lnk2ofdm_data_15_8	0xF6A1 
#define	reg_lnk2ofdm_data_15_8_pos 0
#define	reg_lnk2ofdm_data_15_8_len 8
#define	reg_lnk2ofdm_data_15_8_lsb 8
#define xd_p_reg_lnk2ofdm_data_23_16	(*(volatile byte xdata *) 0xF6A2)
#define    p_reg_lnk2ofdm_data_23_16	0xF6A2 
#define	reg_lnk2ofdm_data_23_16_pos 0
#define	reg_lnk2ofdm_data_23_16_len 8
#define	reg_lnk2ofdm_data_23_16_lsb 16
#define xd_p_reg_lnk2ofdm_data_31_24	(*(volatile byte xdata *) 0xF6A3)
#define    p_reg_lnk2ofdm_data_31_24	0xF6A3 
#define	reg_lnk2ofdm_data_31_24_pos 0
#define	reg_lnk2ofdm_data_31_24_len 8
#define	reg_lnk2ofdm_data_31_24_lsb 24
#define xd_p_reg_lnk2ofdm_data_39_32	(*(volatile byte xdata *) 0xF6A4)
#define    p_reg_lnk2ofdm_data_39_32	0xF6A4 
#define	reg_lnk2ofdm_data_39_32_pos 0
#define	reg_lnk2ofdm_data_39_32_len 8
#define	reg_lnk2ofdm_data_39_32_lsb 32
#define xd_p_reg_lnk2ofdm_data_47_40	(*(volatile byte xdata *) 0xF6A5)
#define    p_reg_lnk2ofdm_data_47_40	0xF6A5 
#define	reg_lnk2ofdm_data_47_40_pos 0
#define	reg_lnk2ofdm_data_47_40_len 8
#define	reg_lnk2ofdm_data_47_40_lsb 40
#define xd_p_reg_lnk2ofdm_data_55_48	(*(volatile byte xdata *) 0xF6A6)
#define    p_reg_lnk2ofdm_data_55_48	0xF6A6 
#define	reg_lnk2ofdm_data_55_48_pos 0
#define	reg_lnk2ofdm_data_55_48_len 8
#define	reg_lnk2ofdm_data_55_48_lsb 48
#define xd_p_reg_lnk2ofdm_data_63_56	(*(volatile byte xdata *) 0xF6A7)
#define    p_reg_lnk2ofdm_data_63_56	0xF6A7 
#define	reg_lnk2ofdm_data_63_56_pos 0
#define	reg_lnk2ofdm_data_63_56_len 8
#define	reg_lnk2ofdm_data_63_56_lsb 56
#define xd_p_reg_ofdmtolnk_data_7_0	(*(volatile byte xdata *) 0xF6A8)
#define    p_reg_ofdmtolnk_data_7_0	0xF6A8 
#define	reg_ofdmtolnk_data_7_0_pos 0
#define	reg_ofdmtolnk_data_7_0_len 8
#define	reg_ofdmtolnk_data_7_0_lsb 0
#define xd_p_reg_ofdmtolnk_data_15_8	(*(volatile byte xdata *) 0xF6A9)
#define    p_reg_ofdmtolnk_data_15_8	0xF6A9 
#define	reg_ofdmtolnk_data_15_8_pos 0
#define	reg_ofdmtolnk_data_15_8_len 8
#define	reg_ofdmtolnk_data_15_8_lsb 8
#define xd_p_reg_ofdmtolnk_data_23_16	(*(volatile byte xdata *) 0xF6AA)
#define    p_reg_ofdmtolnk_data_23_16	0xF6AA 
#define	reg_ofdmtolnk_data_23_16_pos 0
#define	reg_ofdmtolnk_data_23_16_len 8
#define	reg_ofdmtolnk_data_23_16_lsb 16
#define xd_p_reg_ofdmtolnk_data_31_24	(*(volatile byte xdata *) 0xF6AB)
#define    p_reg_ofdmtolnk_data_31_24	0xF6AB 
#define	reg_ofdmtolnk_data_31_24_pos 0
#define	reg_ofdmtolnk_data_31_24_len 8
#define	reg_ofdmtolnk_data_31_24_lsb 24
#define xd_p_reg_ofdmtolnk_data_39_32	(*(volatile byte xdata *) 0xF6AC)
#define    p_reg_ofdmtolnk_data_39_32	0xF6AC 
#define	reg_ofdmtolnk_data_39_32_pos 0
#define	reg_ofdmtolnk_data_39_32_len 8
#define	reg_ofdmtolnk_data_39_32_lsb 32
#define xd_p_reg_ofdmtolnk_data_47_40	(*(volatile byte xdata *) 0xF6AD)
#define    p_reg_ofdmtolnk_data_47_40	0xF6AD 
#define	reg_ofdmtolnk_data_47_40_pos 0
#define	reg_ofdmtolnk_data_47_40_len 8
#define	reg_ofdmtolnk_data_47_40_lsb 40
#define xd_p_reg_ofdmtolnk_data_55_48	(*(volatile byte xdata *) 0xF6AE)
#define    p_reg_ofdmtolnk_data_55_48	0xF6AE 
#define	reg_ofdmtolnk_data_55_48_pos 0
#define	reg_ofdmtolnk_data_55_48_len 8
#define	reg_ofdmtolnk_data_55_48_lsb 48
#define xd_p_reg_ofdmtolnk_data_63_56	(*(volatile byte xdata *) 0xF6AF)
#define    p_reg_ofdmtolnk_data_63_56	0xF6AF 
#define	reg_ofdmtolnk_data_63_56_pos 0
#define	reg_ofdmtolnk_data_63_56_len 8
#define	reg_ofdmtolnk_data_63_56_lsb 56
#define xd_p_reg_mon51_flag	(*(volatile byte xdata *) 0xF6B0)
#define    p_reg_mon51_flag	0xF6B0 
#define	reg_mon51_flag_pos 0
#define	reg_mon51_flag_len 1
#define	reg_mon51_flag_lsb 0
#define xd_p_reg_force_mon51	(*(volatile byte xdata *) 0xF6B1)
#define    p_reg_force_mon51	0xF6B1 
#define	reg_force_mon51_pos 0
#define	reg_force_mon51_len 1
#define	reg_force_mon51_lsb 0
#define xd_p_reg_which_cpu	(*(volatile byte xdata *) 0xF6B2)
#define    p_reg_which_cpu	0xF6B2 
#define	reg_which_cpu_pos 0
#define	reg_which_cpu_len 1
#define	reg_which_cpu_lsb 0
#define xd_p_reg_program_ofdm_code_ready	(*(volatile byte xdata *) 0xF6B3)
#define    p_reg_program_ofdm_code_ready	0xF6B3 
#define	reg_program_ofdm_code_ready_pos 0
#define	reg_program_ofdm_code_ready_len 1
#define	reg_program_ofdm_code_ready_lsb 0
#define xd_p_reg_link_wr_ofdm_en	(*(volatile byte xdata *) 0xF6B3)
#define    p_reg_link_wr_ofdm_en	0xF6B3 
#define	reg_link_wr_ofdm_en_pos 1
#define	reg_link_wr_ofdm_en_len 1
#define	reg_link_wr_ofdm_en_lsb 0
#define xd_p_reg_i2c_mode	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_i2c_mode	0xF6B4 
#define	reg_i2c_mode_pos 0
#define	reg_i2c_mode_len 1
#define	reg_i2c_mode_lsb 0
#define xd_p_reg_sw_reset_sdio	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_sw_reset_sdio	0xF6B4 
#define	reg_sw_reset_sdio_pos 1
#define	reg_sw_reset_sdio_len 1
#define	reg_sw_reset_sdio_lsb 0
#define xd_p_reg_debug_mpefec_sel	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_debug_mpefec_sel	0xF6B4 
#define	reg_debug_mpefec_sel_pos 2
#define	reg_debug_mpefec_sel_len 1
#define	reg_debug_mpefec_sel_lsb 0
#define xd_p_reg_lnk_dynamic_clk	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_lnk_dynamic_clk	0xF6B4 
#define	reg_lnk_dynamic_clk_pos 3
#define	reg_lnk_dynamic_clk_len 1
#define	reg_lnk_dynamic_clk_lsb 0
#define xd_p_reg_lnk_free_clk	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_lnk_free_clk	0xF6B4 
#define	reg_lnk_free_clk_pos 4
#define	reg_lnk_free_clk_len 1
#define	reg_lnk_free_clk_lsb 0
#define xd_p_reg_i2c_sample_rate_up_en	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_i2c_sample_rate_up_en	0xF6B4 
#define	reg_i2c_sample_rate_up_en_pos 5
#define	reg_i2c_sample_rate_up_en_len 1
#define	reg_i2c_sample_rate_up_en_lsb 0
#define xd_p_reg_i2c_start_patch	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_i2c_start_patch	0xF6B4 
#define	reg_i2c_start_patch_pos 6
#define	reg_i2c_start_patch_len 1
#define	reg_i2c_start_patch_lsb 0
#define xd_p_reg_i2c_sample_rate_extd	(*(volatile byte xdata *) 0xF6B4)
#define    p_reg_i2c_sample_rate_extd	0xF6B4 
#define	reg_i2c_sample_rate_extd_pos 7
#define	reg_i2c_sample_rate_extd_len 1
#define	reg_i2c_sample_rate_extd_lsb 0
//#define xd_p_reg_bypass_host2tuner	(*(volatile byte xdata *) 0xF6B5)
//#define    p_reg_bypass_host2tuner	0xF6B5 
//#define	reg_bypass_host2tuner_pos 0
//#define	reg_bypass_host2tuner_len 1
//#define	reg_bypass_host2tuner_lsb 0
#define xd_p_reg_link_i2cs_msb	(*(volatile byte xdata *) 0xF6B5)
#define    p_reg_link_i2cs_msb	0xF6B5 
#define	reg_link_i2cs_msb_pos 1
#define	reg_link_i2cs_msb_len 1
#define	reg_link_i2cs_msb_lsb 0
//#define xd_p_reg_rst_i2cs	(*(volatile byte xdata *) 0xF6B5)
//#define    p_reg_rst_i2cs	0xF6B5 
//#define	reg_rst_i2cs_pos 2
//#define	reg_rst_i2cs_len 1
//#define	reg_rst_i2cs_lsb 0
//#define xd_p_reg_rst_i2cm	(*(volatile byte xdata *) 0xF6B5)
//#define    p_reg_rst_i2cm	0xF6B5 
//#define	reg_rst_i2cm_pos 3
//#define	reg_rst_i2cm_len 1
//#define	reg_rst_i2cm_lsb 0
#define xd_p_reg_link_ofsm_dbg_en	(*(volatile byte xdata *) 0xF6B5)
#define    p_reg_link_ofsm_dbg_en	0xF6B5 
#define	reg_link_ofsm_dbg_en_pos 4
#define	reg_link_ofsm_dbg_en_len 1
#define	reg_link_ofsm_dbg_en_lsb 0
#define xd_p_reg_link_i2c_dbg_sel	(*(volatile byte xdata *) 0xF6B5)
#define    p_reg_link_i2c_dbg_sel	0xF6B5 
#define	reg_link_i2c_dbg_sel_pos 5
#define	reg_link_i2c_dbg_sel_len 1
#define	reg_link_i2c_dbg_sel_lsb 0
#define xd_p_reg_bypass_host2third	(*(volatile byte xdata *) 0xF6B5)
#define    p_reg_bypass_host2third	0xF6B5 
#define	reg_bypass_host2third_pos 6
#define	reg_bypass_host2third_len 1
#define	reg_bypass_host2third_lsb 0
#define xd_p_reg_fast_slow_train	(*(volatile byte xdata *) 0xF6DD)
#define    p_reg_fast_slow_train	0xF6DD 
#define	reg_fast_slow_train_pos 0
#define	reg_fast_slow_train_len 1
#define	reg_fast_slow_train_lsb 0
#define xd_p_reg_lnk2ofdm_int	(*(volatile byte xdata *) 0xF6DE)
#define    p_reg_lnk2ofdm_int	0xF6DE 
#define	reg_lnk2ofdm_int_pos 0
#define	reg_lnk2ofdm_int_len 1
#define	reg_lnk2ofdm_int_lsb 0
#define xd_p_reg_ofdm2lnk_int	(*(volatile byte xdata *) 0xF6DF)
#define    p_reg_ofdm2lnk_int	0xF6DF 
#define	reg_ofdm2lnk_int_pos 0
#define	reg_ofdm2lnk_int_len 1
#define	reg_ofdm2lnk_int_lsb 0
#define xd_p_reg_load_ofdm_reg	(*(volatile byte xdata *) 0xF6E4)
#define    p_reg_load_ofdm_reg	0xF6E4 
#define	reg_load_ofdm_reg_pos 0
#define	reg_load_ofdm_reg_len 1
#define	reg_load_ofdm_reg_lsb 0
#define xd_p_link_ofsm_cmd_reg	(*(volatile byte xdata *) 0xF6EA)
#define    p_link_ofsm_cmd_reg	0xF6EA 
#define	link_ofsm_cmd_reg_pos 0
#define	link_ofsm_cmd_reg_len 8
#define	link_ofsm_cmd_reg_lsb 0
#define xd_p_link_ofsm_addr_reg_h	(*(volatile byte xdata *) 0xF6EB)
#define    p_link_ofsm_addr_reg_h	0xF6EB 
#define	link_ofsm_addr_reg_h_pos 0
#define	link_ofsm_addr_reg_h_len 8
#define	link_ofsm_addr_reg_h_lsb 0
#define xd_p_link_ofsm_addr_reg_l	(*(volatile byte xdata *) 0xF6EC)
#define    p_link_ofsm_addr_reg_l	0xF6EC 
#define	link_ofsm_addr_reg_l_pos 0
#define	link_ofsm_addr_reg_l_len 8
#define	link_ofsm_addr_reg_l_lsb 0
#define xd_p_link_ofsm_data_reg_0	(*(volatile byte xdata *) 0xF6ED)
#define    p_link_ofsm_data_reg_0	0xF6ED 
#define	link_ofsm_data_reg_0_pos 0
#define	link_ofsm_data_reg_0_len 8
#define	link_ofsm_data_reg_0_lsb 0
#define xd_p_link_ofsm_data_reg_1	(*(volatile byte xdata *) 0xF6EE)
#define    p_link_ofsm_data_reg_1	0xF6EE 
#define	link_ofsm_data_reg_1_pos 0
#define	link_ofsm_data_reg_1_len 8
#define	link_ofsm_data_reg_1_lsb 0
#define xd_p_link_ofsm_data_reg_2	(*(volatile byte xdata *) 0xF6EF)
#define    p_link_ofsm_data_reg_2	0xF6EF 
#define	link_ofsm_data_reg_2_pos 0
#define	link_ofsm_data_reg_2_len 8
#define	link_ofsm_data_reg_2_lsb 0
#define xd_p_link_ofsm_data_reg_3	(*(volatile byte xdata *) 0xF6F0)
#define    p_link_ofsm_data_reg_3	0xF6F0 
#define	link_ofsm_data_reg_3_pos 0
#define	link_ofsm_data_reg_3_len 8
#define	link_ofsm_data_reg_3_lsb 0
#define xd_p_link_ofsm_data_reg_4	(*(volatile byte xdata *) 0xF6F1)
#define    p_link_ofsm_data_reg_4	0xF6F1 
#define	link_ofsm_data_reg_4_pos 0
#define	link_ofsm_data_reg_4_len 8
#define	link_ofsm_data_reg_4_lsb 0
#define xd_p_link_ofsm_data_reg_5	(*(volatile byte xdata *) 0xF6F2)
#define    p_link_ofsm_data_reg_5	0xF6F2 
#define	link_ofsm_data_reg_5_pos 0
#define	link_ofsm_data_reg_5_len 8
#define	link_ofsm_data_reg_5_lsb 0
#define xd_p_link_ofsm_data_reg_6	(*(volatile byte xdata *) 0xF6F3)
#define    p_link_ofsm_data_reg_6	0xF6F3 
#define	link_ofsm_data_reg_6_pos 0
#define	link_ofsm_data_reg_6_len 8
#define	link_ofsm_data_reg_6_lsb 0
#define xd_p_link_ofsm_data_reg_7	(*(volatile byte xdata *) 0xF6F4)
#define    p_link_ofsm_data_reg_7	0xF6F4 
#define	link_ofsm_data_reg_7_pos 0
#define	link_ofsm_data_reg_7_len 8
#define	link_ofsm_data_reg_7_lsb 0
#define xd_p_link_ofsm_data_reg_8	(*(volatile byte xdata *) 0xF6F5)
#define    p_link_ofsm_data_reg_8	0xF6F5 
#define	link_ofsm_data_reg_8_pos 0
#define	link_ofsm_data_reg_8_len 8
#define	link_ofsm_data_reg_8_lsb 0
#define xd_p_link_ofsm_data_reg_9	(*(volatile byte xdata *) 0xF6F6)
#define    p_link_ofsm_data_reg_9	0xF6F6 
#define	link_ofsm_data_reg_9_pos 0
#define	link_ofsm_data_reg_9_len 8
#define	link_ofsm_data_reg_9_lsb 0
#define xd_p_link_ofsm_data_reg_10	(*(volatile byte xdata *) 0xF6F7)
#define    p_link_ofsm_data_reg_10	0xF6F7 
#define	link_ofsm_data_reg_10_pos 0
#define	link_ofsm_data_reg_10_len 8
#define	link_ofsm_data_reg_10_lsb 0
#define xd_p_link_ofsm_data_reg_11	(*(volatile byte xdata *) 0xF6F8)
#define    p_link_ofsm_data_reg_11	0xF6F8 
#define	link_ofsm_data_reg_11_pos 0
#define	link_ofsm_data_reg_11_len 8
#define	link_ofsm_data_reg_11_lsb 0
#define xd_p_link_ofsm_data_reg_12	(*(volatile byte xdata *) 0xF6F9)
#define    p_link_ofsm_data_reg_12	0xF6F9 
#define	link_ofsm_data_reg_12_pos 0
#define	link_ofsm_data_reg_12_len 8
#define	link_ofsm_data_reg_12_lsb 0
#define xd_p_link_ofsm_data_reg_13	(*(volatile byte xdata *) 0xF6FA)
#define    p_link_ofsm_data_reg_13	0xF6FA 
#define	link_ofsm_data_reg_13_pos 0
#define	link_ofsm_data_reg_13_len 8
#define	link_ofsm_data_reg_13_lsb 0
#define xd_p_link_ofsm_data_reg_14	(*(volatile byte xdata *) 0xF6FB)
#define    p_link_ofsm_data_reg_14	0xF6FB 
#define	link_ofsm_data_reg_14_pos 0
#define	link_ofsm_data_reg_14_len 8
#define	link_ofsm_data_reg_14_lsb 0
#define xd_p_link_ofsm_data_reg_15	(*(volatile byte xdata *) 0xF6FC)
#define    p_link_ofsm_data_reg_15	0xF6FC 
#define	link_ofsm_data_reg_15_pos 0
#define	link_ofsm_data_reg_15_len 8
#define	link_ofsm_data_reg_15_lsb 0
//#define xd_p_reg_sw_mon51	(*(volatile byte xdata *) 0xF6FD)
//#define    p_reg_sw_mon51	0xF6FD 
//#define	reg_sw_mon51_pos 0
//#define	reg_sw_mon51_len 7
//#define	reg_sw_mon51_lsb 0
//#define xd_p_reg_wdti_level	(*(volatile byte xdata *) 0xF6FE)
//#define    p_reg_wdti_level	0xF6FE 
//#define	reg_wdti_level_pos 1
//#define	reg_wdti_level_len 1
//#define	reg_wdti_level_lsb 0
//#define xd_p_reg_fw_int_mask_n	(*(volatile byte xdata *) 0xF6FE)
//#define    p_reg_fw_int_mask_n	0xF6FE 
//#define	reg_fw_int_mask_n_pos 2
//#define	reg_fw_int_mask_n_len 1
//#define	reg_fw_int_mask_n_lsb 0
#define xd_p_reg_debug_mux	(*(volatile byte xdata *) 0xF6FE)
#define    p_reg_debug_mux	0xF6FE 
#define	reg_debug_mux_pos 3
#define	reg_debug_mux_len 1
#define	reg_debug_mux_lsb 0
#define xd_p_reg_top_gpioon0	(*(volatile byte xdata *) 0xF6FF)
#define    p_reg_top_gpioon0	0xF6FF 
#define	reg_top_gpioon0_pos 0
#define	reg_top_gpioon0_len 1
#define	reg_top_gpioon0_lsb 0
//#define xd_p_reg_top_gpiosclon	(*(volatile byte xdata *) 0xF6FF)
//#define    p_reg_top_gpiosclon	0xF6FF 
//#define	reg_top_gpiosclon_pos 1
//#define	reg_top_gpiosclon_len 1
//#define	reg_top_gpiosclon_lsb 0
//#define xd_p_reg_top_gpiosclo	(*(volatile byte xdata *) 0xF6FF)
//#define    p_reg_top_gpiosclo	0xF6FF 
//#define	reg_top_gpiosclo_pos 2
//#define	reg_top_gpiosclo_len 1
//#define	reg_top_gpiosclo_lsb 0
//#define xd_p_reg_top_gpiosdaon	(*(volatile byte xdata *) 0xF6FF)
//#define    p_reg_top_gpiosdaon	0xF6FF 
//#define	reg_top_gpiosdaon_pos 3
//#define	reg_top_gpiosdaon_len 1
//#define	reg_top_gpiosdaon_lsb 0
//#define xd_p_reg_top_gpiosdao	(*(volatile byte xdata *) 0xF6FF)
//#define    p_reg_top_gpiosdao	0xF6FF 
//#define	reg_top_gpiosdao_pos 4
//#define	reg_top_gpiosdao_len 1
//#define	reg_top_gpiosdao_lsb 0

