liyenho/lgdst_module_private/rx/atmel/samg55/ite/proj-rx/src/video/inc/register.h
//--fake register
#define xd_p_reg_aagc_if_loop_bw_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_acquire	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_acquire_pos 0
#define	reg_aagc_if_loop_bw_scale_acquire_len 5
#define	reg_aagc_if_loop_bw_scale_acquire_lsb 0
#define xd_p_reg_aagc_if_loop_bw_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_track	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_track_pos 0
#define	reg_aagc_if_loop_bw_scale_track_len 5
#define	reg_aagc_if_loop_bw_scale_track_lsb 0
#define xd_p_reg_top_gpiot2_on  (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot2_on  0xCFFF
#define reg_top_gpiot2_on_pos 0
#define reg_top_gpiot2_on_len 1
#define reg_top_gpiot2_on_lsb 0
#define xd_p_reg_top_gpiot2_en  (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot2_en  0xCFFF
#define reg_top_gpiot2_en_pos 0
#define reg_top_gpiot2_en_len 1
#define reg_top_gpiot2_en_lsb 0
#define xd_p_reg_top_gpiot2_o   (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot2_o   0xCFFF
#define reg_top_gpiot2_o_pos 0
#define reg_top_gpiot2_o_len 1
#define reg_top_gpiot2_o_lsb 0
#define xd_p_reg_top_gpiot3_on  (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot3_on  0xCFFF
#define reg_top_gpiot3_on_pos 0
#define reg_top_gpiot3_on_len 1
#define reg_top_gpiot3_on_lsb 0
#define xd_p_reg_top_gpiot3_en  (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot3_en  0xCFFF
#define reg_top_gpiot3_en_pos 0
#define reg_top_gpiot3_en_len 1
#define reg_top_gpiot3_en_lsb 0
#define xd_p_reg_top_gpiot3_o   (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_gpiot3_o   0xCFFF
#define reg_top_gpiot3_o_pos 0
#define reg_top_gpiot3_o_len 1
#define reg_top_gpiot3_o_lsb 0
#define xd_r_reg_aagc_rf_gain	(*(volatile byte xdata *) 0xCFFF)
#define    r_reg_aagc_rf_gain	0xCFFF 
#define	reg_aagc_rf_gain_pos 0
#define	reg_aagc_rf_gain_len 8
#define	reg_aagc_rf_gain_lsb 0
#define xd_r_reg_aagc_if_gain	(*(volatile byte xdata *) 0xCFFF)
#define    r_reg_aagc_if_gain	0xCFFF 
#define	reg_aagc_if_gain_pos 0
#define	reg_aagc_if_gain_len 8
#define	reg_aagc_if_gain_lsb 0
#define xd_p_reg_top_clkoen (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_clkoen 0xCFFF
#define reg_top_clkoen_pos 0
#define reg_top_clkoen_len 1
#define reg_top_clkoen_lsb 0
#define xd_p_reg_aagc_if_loop_bw_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_acquire	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_acquire_pos 0
#define	reg_aagc_if_loop_bw_scale_acquire_len 5
#define	reg_aagc_if_loop_bw_scale_acquire_lsb 0
#define xd_p_reg_aagc_if_loop_bw_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_track	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_track_pos 0
#define	reg_aagc_if_loop_bw_scale_track_len 5
#define	reg_aagc_if_loop_bw_scale_track_lsb 0
#define xd_p_reg_top_hosta_mpeg_ser_mode    (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_hosta_mpeg_ser_mode    0xCFFF
#define reg_top_hosta_mpeg_ser_mode_pos 0
#define reg_top_hosta_mpeg_ser_mode_len 1
#define reg_top_hosta_mpeg_ser_mode_lsb 0
#define xd_p_reg_top_hosta_mpeg_par_mode    (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_hosta_mpeg_par_mode    0xCFFF
#define reg_top_hosta_mpeg_par_mode_pos 0
#define reg_top_hosta_mpeg_par_mode_len 1
#define reg_top_hosta_mpeg_par_mode_lsb 0
#define xd_p_reg_top_hosta_dca_upper    (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_hosta_dca_upper    0xCFFF
#define reg_top_hosta_dca_upper_pos 0
#define reg_top_hosta_dca_upper_len 1
#define reg_top_hosta_dca_upper_lsb 0
#define xd_p_reg_top_hosta_dca_lower    (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_top_hosta_dca_lower    0xCFFF
#define reg_top_hosta_dca_lower_pos 0
#define reg_top_hosta_dca_lower_len 1
#define reg_top_hosta_dca_lower_lsb 0
#define xd_p_reg_p_dmb_sw_reset (*(volatile byte xdata *) 0xCFFF)
#define    p_reg_p_dmb_sw_reset 0xCFFF
#define reg_p_dmb_sw_reset_pos 0
#define reg_p_dmb_sw_reset_len 1
#define reg_p_dmb_sw_reset_lsb 0
#define xd_p_reg_aagc_rf_loop_bw_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_loop_bw_scale_acquire	0xCFFF 
#define	reg_aagc_rf_loop_bw_scale_acquire_pos 0
#define	reg_aagc_rf_loop_bw_scale_acquire_len 5
#define	reg_aagc_rf_loop_bw_scale_acquire_lsb 0
#define xd_p_reg_aagc_rf_loop_bw_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_loop_bw_scale_track	0xCFFF 
#define	reg_aagc_rf_loop_bw_scale_track_pos 0
#define	reg_aagc_rf_loop_bw_scale_track_len 5
#define	reg_aagc_rf_loop_bw_scale_track_lsb 0
#define xd_p_reg_aagc_if_loop_bw_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_acquire	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_acquire_pos 0
#define	reg_aagc_if_loop_bw_scale_acquire_len 5
#define	reg_aagc_if_loop_bw_scale_acquire_lsb 0
#define xd_p_reg_aagc_if_loop_bw_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_loop_bw_scale_track	0xCFFF 
#define	reg_aagc_if_loop_bw_scale_track_pos 0
#define	reg_aagc_if_loop_bw_scale_track_len 5
#define	reg_aagc_if_loop_bw_scale_track_lsb 0
#define xd_p_reg_aagc_max_rf_agc_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_max_rf_agc_7_0	0xCFFF 
#define	reg_aagc_max_rf_agc_7_0_pos 0
#define	reg_aagc_max_rf_agc_7_0_len 8
#define	reg_aagc_max_rf_agc_7_0_lsb 0
#define xd_p_reg_aagc_max_rf_agc_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_max_rf_agc_9_8	0xCFFF 
#define	reg_aagc_max_rf_agc_9_8_pos 0
#define	reg_aagc_max_rf_agc_9_8_len 2
#define	reg_aagc_max_rf_agc_9_8_lsb 8
#define xd_p_reg_aagc_min_rf_agc_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_min_rf_agc_7_0	0xCFFF
#define	reg_aagc_min_rf_agc_7_0_pos 0
#define	reg_aagc_min_rf_agc_7_0_len 8
#define	reg_aagc_min_rf_agc_7_0_lsb 0
#define xd_p_reg_aagc_min_rf_agc_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_min_rf_agc_9_8	0xCFFF 
#define	reg_aagc_min_rf_agc_9_8_pos 0
#define	reg_aagc_min_rf_agc_9_8_len 2
#define	reg_aagc_min_rf_agc_9_8_lsb 8
#define xd_p_reg_aagc_max_if_agc_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_max_if_agc_7_0	0xCFFF 
#define	reg_aagc_max_if_agc_7_0_pos 0
#define	reg_aagc_max_if_agc_7_0_len 8
#define	reg_aagc_max_if_agc_7_0_lsb 0
#define xd_p_reg_aagc_max_if_agc_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_max_if_agc_9_8	0xCFFF 
#define	reg_aagc_max_if_agc_9_8_pos 0
#define	reg_aagc_max_if_agc_9_8_len 2
#define	reg_aagc_max_if_agc_9_8_lsb 8
#define xd_p_reg_aagc_min_if_agc_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_min_if_agc_7_0	0xCFFF 
#define	reg_aagc_min_if_agc_7_0_pos 0
#define	reg_aagc_min_if_agc_7_0_len 8
#define	reg_aagc_min_if_agc_7_0_lsb 0
#define xd_p_reg_aagc_min_if_agc_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_min_if_agc_9_8	0xCFFF 
#define	reg_aagc_min_if_agc_9_8_pos 0
#define	reg_aagc_min_if_agc_9_8_len 2
#define	reg_aagc_min_if_agc_9_8_lsb 8
#define xd_p_reg_aagc_rf_top_numerator_s_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_top_numerator_s_7_0	0xCFFF 
#define	reg_aagc_rf_top_numerator_s_7_0_pos 0
#define	reg_aagc_rf_top_numerator_s_7_0_len 8
#define	reg_aagc_rf_top_numerator_s_7_0_lsb 0
#define xd_p_reg_aagc_rf_top_numerator_s_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_top_numerator_s_9_8	0xCFFF 
#define	reg_aagc_rf_top_numerator_s_9_8_pos 0
#define	reg_aagc_rf_top_numerator_s_9_8_len 2
#define	reg_aagc_rf_top_numerator_s_9_8_lsb 8
#define xd_p_reg_aagc_if_top_numerator_s_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_top_numerator_s_7_0	0xCFFF 
#define	reg_aagc_if_top_numerator_s_7_0_pos 0
#define	reg_aagc_if_top_numerator_s_7_0_len 8
#define	reg_aagc_if_top_numerator_s_7_0_lsb 0
#define xd_p_reg_aagc_if_top_numerator_s_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_top_numerator_s_9_8	0xCFFF 
#define	reg_aagc_if_top_numerator_s_9_8_pos 0
#define	reg_aagc_if_top_numerator_s_9_8_len 2
#define	reg_aagc_if_top_numerator_s_9_8_lsb 8
#define xd_p_reg_aagc_rf_top_numerator_m_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_top_numerator_m_7_0	0xCFFF 
#define	reg_aagc_rf_top_numerator_m_7_0_pos 0
#define	reg_aagc_rf_top_numerator_m_7_0_len 8
#define	reg_aagc_rf_top_numerator_m_7_0_lsb 0
#define xd_p_reg_aagc_rf_top_numerator_m_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_top_numerator_m_9_8	0xCFFF 
#define	reg_aagc_rf_top_numerator_m_9_8_pos 0
#define	reg_aagc_rf_top_numerator_m_9_8_len 2
#define	reg_aagc_rf_top_numerator_m_9_8_lsb 8
#define xd_p_reg_aagc_if_top_numerator_m_7_0	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_top_numerator_m_7_0	0xCFFF 
#define	reg_aagc_if_top_numerator_m_7_0_pos 0
#define	reg_aagc_if_top_numerator_m_7_0_len 8
#define	reg_aagc_if_top_numerator_m_7_0_lsb 0
#define xd_p_reg_aagc_if_top_numerator_m_9_8	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_top_numerator_m_9_8	0xCFFF 
#define	reg_aagc_if_top_numerator_m_9_8_pos 0
#define	reg_aagc_if_top_numerator_m_9_8_len 2
#define	reg_aagc_if_top_numerator_m_9_8_lsb 8
#define xd_p_reg_aagc_top_th_dis	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_top_th_dis	0xCFFF 
#define	reg_aagc_top_th_dis_pos 0
#define	reg_aagc_top_th_dis_len 1
#define	reg_aagc_top_th_dis_lsb 0
#define xd_p_reg_aagc_top_reload	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_top_reload	0xCFFF 
#define	reg_aagc_top_reload_pos 0
#define	reg_aagc_top_reload_len 1
#define	reg_aagc_top_reload_lsb 0
#define xd_p_reg_aagc_rf_agc_lock_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_agc_lock_scale_acquire	0xCFFF 
#define	reg_aagc_rf_agc_lock_scale_acquire_pos 0
#define	reg_aagc_rf_agc_lock_scale_acquire_len 3
#define	reg_aagc_rf_agc_lock_scale_acquire_lsb 0
#define xd_p_reg_aagc_rf_agc_lock_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_rf_agc_lock_scale_track	0xCFFF 
#define	reg_aagc_rf_agc_lock_scale_track_pos 0
#define	reg_aagc_rf_agc_lock_scale_track_len 3
#define	reg_aagc_rf_agc_lock_scale_track_lsb 0
#define xd_p_reg_aagc_if_agc_lock_scale_acquire	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_agc_lock_scale_acquire	0xCFFF
#define	reg_aagc_if_agc_lock_scale_acquire_pos 0
#define	reg_aagc_if_agc_lock_scale_acquire_len 3
#define	reg_aagc_if_agc_lock_scale_acquire_lsb 0
#define xd_p_reg_aagc_if_agc_lock_scale_track	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_if_agc_lock_scale_track	0xCFFF 
#define	reg_aagc_if_agc_lock_scale_track_pos 0
#define	reg_aagc_if_agc_lock_scale_track_len 3
#define	reg_aagc_if_agc_lock_scale_track_lsb 0
#define xd_p_reg_sdioc_external_int_en	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_sdioc_external_int_en	0xCFFF 
#define	reg_sdioc_external_int_en_pos 1
#define	reg_sdioc_external_int_en_len 1
#define	reg_sdioc_external_int_en_lsb 0
#define xd_p_reg_aagc_out_if_inv	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_out_if_inv	0xCFFF 
#define	reg_aagc_out_if_inv_pos 0
#define	reg_aagc_out_if_inv_len 1
#define	reg_aagc_out_if_inv_lsb 0
#define xd_p_reg_aagc_out_rf_inv	(*(volatile byte xdata *) 0xCFFF)
#define    p_reg_aagc_out_rf_inv	0xCFFF 
#define	reg_aagc_out_rf_inv_pos 0
#define	reg_aagc_out_rf_inv_len 1
#define	reg_aagc_out_rf_inv_lsb 0